{
    "id": "2021-AirForce-PB-3600-MJBOOK-3-0-4ccc939241b47239c36ee98d5519ce37a7e18b46d494a025321d2035cb3d38d7-37",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0401115F"
        },
        "ProgramElementTitle": {
            "val": "C-130 Airlift Squadron"
        },
        "R1LineNumber": {
            "val": "278"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "58.408"
            },
            "CurrentYear": {
                "val": "101.425"
            },
            "BudgetYearOne": {
                "val": "41.973"
            },
            "BudgetYearOneBase": {
                "val": "41.973"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "24.370"
            },
            "BudgetYearThree": {
                "val": "0.399"
            },
            "BudgetYearFour": {
                "val": "0.405"
            },
            "BudgetYearFive": {
                "val": "9.957"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "236.937"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The C-130H is a medium sized tactical transport aircraft providing multi-purpose theater support throughout the globe. The C-130H fleet supports several diverse Air\nForce roles, including but not limited to tactical and inter-theater airlift and airdrop support, Arctic resupply, special operations support, aeromedical evacuation, aerial\nspraying, firefighting duties, and natural disaster and humanitarian relief missions.\n\nC-130H AMP Increment 1 addresses modifications to meet airspace compliance mandates and safety requirements. RDT&E efforts cover design, integration,\ndevelopmental and operational test, studies and risk reduction efforts, trial kit buy and installation, spares and peculiar support equipment in support of trial kit installs,\ntype 1 training and C-130H aircrew and maintenance training systems and course ware development efforts, program office support and other efforts necessary to fulfill program requirements.\n\nC-130H AMP Increment 2 includes digital avionics upgrades (e.g. Flight Management System, improved navigation), cockpit modernization (e.g. glass\/engine flight\ndisplays) and resolves select obsolescence and Diminishing Manufacturing Source (DMS) issues. RDT&E efforts will cover software development, design, integration,\ndevelopmental and operational test, studies and risk reduction efforts, trial kit buy and installation, technical order development validation and verification, spares and\npeculiar support equipment in support of trial kit installs, Systems Integration Laboratory (SIL) development, type 1 training and C-130H aircrew and maintenance\ntraining systems and course ware development efforts, program office support and other efforts necessary to fulfill program requirements.\n\nThe development and fielding of the MUOS\/SATURN Radio program (Project 672030) will be executed under the AMP Increment 2 program (Project 675250). The MUOS\/Saturn Radio program updates radios due to future DMS\/integration issues and the incorporation of MUOS\/SATURN capabilities. The funding is required for the Non-Recurring Effort associated with integration, testing, Technical Orders, Engineering drawing's, Trial Kit Installations, Verification Kit Installations, and spectrum authorization.  \n\nThis funding includes Rapid Global Mobility (RGM) platform related activities including but not limited to prototyping, capability development, process activities, planning\nanalysis and systems engineering activities.\n\nProject 672030, C-130H MUOS\/SATURN Radio changed from C-130H MUOS Radio. \n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver C-130H weapon system capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "105.988"
                },
                "CurrentYear": {
                    "val": "140.425"
                },
                "BudgetYearOne": {
                    "val": "113.473"
                },
                "BudgetYearOneBase": {
                    "val": "113.473"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "58.408"
                },
                "CurrentYear": {
                    "val": "101.425"
                },
                "BudgetYearOne": {
                    "val": "41.973"
                },
                "BudgetYearOneBase": {
                    "val": "41.973"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-47.580"
                },
                "CurrentYear": {
                    "val": "-39.000"
                },
                "BudgetYearOne": {
                    "val": "-71.500"
                },
                "BudgetYearOneBase": {
                    "val": "-71.500"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-39.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-44.205"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.375"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-71.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-71.500"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY19 funding reduced by -$44.205M for below threshold reprogramming actions and -$3.375M for Small Business Innovation Research (SBIR).  \n\nFY20 Congressionally directed reduction due to \"Contract award savings\".\n\nFY21 funding request reduced due to Contract award savings."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "672030"
                    },
                    "ProjectTitle": {
                        "val": "C-130H MUOS\/SATURN Radio"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "15.800"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.399"
                        },
                        "BudgetYearThree": {
                            "val": "0.399"
                        },
                        "BudgetYearFour": {
                            "val": "0.399"
                        },
                        "BudgetYearFive": {
                            "val": "9.951"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "26.948"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The development and fielding of the MUOS\/SATURN Radio program will be executed under the AMP Increment 2 program. The MUOS\/Saturn Radio program updates radios due to future Diminishing Manufacturing Source (DMS)\/integration issues and the incorporation of MUOS\/SATURN capabilities. The funding is required for the Non-Recurring Effort associated with integration, testing, TO's, Engineering drawing's, TKI, VKI, and spectrum authorization.\n  \nThe C-130H MUOS\/SATURN Radio program modifies up to 176 C-130H USAF-owned aircraft consisting of H3s, H2.5s, H2s, H1s and LC-130H aircraft. The modification effort will have up to four prototype aircraft representative of variations in the mission designs and required for accomplishment of the Engineering and Manufacturing Development (EMD) phase with the remaining aircraft modified in the production phase.\n\nThis funding includes Rapid Global Mobility (RGM) platform related activities including but not limited to prototyping, capability development, process activities, planning analysis and systems engineering activities.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver C-130H weapon system capabilities.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F.  The program may also include any Contractor Manpower Equivalent (CME)\/A&AS support deemed necessary to support the program objectives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C-130H MUOS\/SATURN Radio"
                                    },
                                    "Description": {
                                        "val": "The program is currently executing the Engineering and Manufacturing Development (EMD) phase activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.800"
                                            },
                                            "Text": {
                                                "val": "Continuation of EMD activities to include but are not limited to software development, design, integration, development and operational test, program office support, studies and risk reduction efforts, trial kit buy and installation, technical order development validation and verification, peculiar support equipment and spares in support of trial kit installs, SIL development, Type 1 training, C-130H aircrew and maintenance training systems, and courseware development efforts and other efforts required to fulfill program requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreased due to transfer of MUOS\/SATURN Radio program and associated efforts to C-130H AMP Increment 2."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The MUOS\/Saturn radios will be included in the C-130 AMP Increment 2 production funding to begin in FY21."
                        },
                        "AcquisitionStrategy": {
                            "val": "The MUOS\/SATURN Radio effort will be added to the C-130H AMP Increment 2 contract through an Undefinitized Contract Action (UCA) 2nd quarter of 2020 and a definitive contract modification 1st quarter of 2021. Current efforts are primarily focused on the Engineering and Manufacturing Development (EMD). The C-130H AMP Increment 2 contract was awarded 3rd quarter of 2019."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Increment 2 EMD UCA"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L3Harris:Waco, TX"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "15.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "15.800"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "C-130H MUOS\/SATURN Radio"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "MUOS\/SATURN RADIO transfer to AMP Increment 2"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675248"
                    },
                    "ProjectTitle": {
                        "val": "C-130H Avionics Modernization Program (AMP) Increment 1"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.660"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.660"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The C-130H AMP Increment 1 program performs modifications to meet airspace compliance and safety mandates; the mod includes Automatic Dependent Surveillance-Broadcast (ADS-B) Out, Enhanced Mode S, 8.33 kHz radios, and Cockpit Voice Recorder\/Digital Flight Data Recorder (CVR\/DFDR).\n\nRDT&E efforts include but are not limited to, design, integration, development and operational test, studies and risk reduction efforts, trial kit buy and installation, spares and peculiar support equipment in support of trial kit installs, Type 1 training and C-130H aircrew and maintenance training systems and courseware development efforts (including Mode 5 effort for the trainers), program office support and other efforts necessary to fulfill program mandates and requirements.  Obsolescence and Diminishing Manufacturing Sources (DMS) issues will be resolved with solutions that may include life of type buys or bridge buys.  DMS efforts to include removal of end of-life software\/hardware within simulator systems and move to a modular, common open system architecture that is sustainable and cyber-resilient.  Implement requirements and standards defined under the Simulator Common Architecture Requirements and Standards (SCARS) initiative.\n\nThe C-130H AMP Increment 1 program currently modifies up to 176 C-130H USAF-owned aircraft consisting of H3s, H2.5s, H2s,H1s and LC-130H aircraft.  The modification effort consists of four prototype aircraft representative of variations in the mission designs and required for accomplishment of the Engineering and Manufacturing Development (EMD) phase with the remaining aircraft modified in the production phase.\n\nThis funding includes Rapid Global Mobility (RGM) platform related activities including but not limited to prototyping, capability development, process activities, planning analysis and systems engineering activities.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver AMP Increment 1 weapon system capability. The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F. The program may also include any Contractor Manpower Equivalent (CME)\/A&AS support deemed necessary to support the program objectives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C-130H AMP Increment 1"
                                    },
                                    "Description": {
                                        "val": "Completion of EMD phase activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.660"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF 05 Line Item C13000"
                                    },
                                    "Title": {
                                        "val": "C-130"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.101"
                                        },
                                        "CurrentYear": {
                                            "val": "7.338"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.841"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.841"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "17.280"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 06 Line Item 000999"
                                    },
                                    "Title": {
                                        "val": "Initial Spares\/Repair Parts"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.034"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.034"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "C-130H AMP Increment 1 acquisition strategy (30 Sept 2015) was to conduct a competitive small business set aside source selection for ADS-B Out and Enhanced Mode S followed by a Federal Acquisition Regulation (FAR) Part 15 contract award.  The EMD contract was awarded in 2nd quarter FY17.  Preliminary Design Review (PDR) completed 3rd quarter FY17 and Critical Design Review (CDR) completed 4th quarter FY17. Milestone C approved 4th quarter FY18 (23 Jul 2018). Current efforts continue to focus on the completion of Engineering and Manufacturing Development (EMD) to include Weapon Systems Trainer (WST)."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "C-130H AMP Increment 1 EMD Contract"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.980"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.980"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.980"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "C-130H AMP Increment 1 PMA Contractor Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Specified"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.680"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.680"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.680"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "C-130H AMP Increment 1"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "EMD Contract Awards"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Design\/Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Trainers & Training"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675250"
                    },
                    "ProjectTitle": {
                        "val": "C-130H Avionics Modernization Program (AMP) Increment 2"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "53.748"
                        },
                        "CurrentYear": {
                            "val": "85.625"
                        },
                        "BudgetYearOne": {
                            "val": "41.973"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.973"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "23.971"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.006"
                        },
                        "BudgetYearFive": {
                            "val": "0.006"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "205.329"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The C-130H AMP Increment 2 upgrades the C-130H fleet with comprehensive avionics and cockpit modernization which replaces aging unreliable equipment and adds combat capability enhancements. It also updates radios due to future Diminishing Manufacturing Sources (DMS)\/integration issues and incorporation of MUOS\/SATURN radio capabilities. It also addresses select obsolescence and DMS issues with solutions that may include life of type buys or bridge buys.  DMS efforts to include removal of end-of-life software\/hardware within simulators systems and move to a modular, common open system architecture that is sustainable and cyber-resilient.  Implement requirements and standards defined under the Simulator Common Architecture Requirements and Standards (SCARS) initiative.\n\nRDT&E efforts include but are not limited to software development, design, integration, development and operational test, studies and risk reduction efforts, trial kit buy and installation, technical order development validation and verification, peculiar support equipment and spares in support of trial kit installs, SIL development, type 1 training, and C-130H aircrew and maintenance training systems and courseware development efforts, program office support and other efforts required to fulfill requirements.\n\nThe C-130H AMP Increment 2 program modifies up to 176 C-130H USAF owned aircraft consisting of H3s, H2.5s, H2s,H1s and LC-130H aircraft. The modification effort will have up to four prototype aircraft representative of variations in the mission designs and required for accomplishment of the Engineering and Manufacturing Development (EMD) phase with the remaining aircraft modified in the production phase.\n\nThe development and fielding of the MUOS\/SATURN program will be executed under the AMP Increment 2 program. The MUOS radio funding is required for the Non-Recurring Effort associated with integration, testing, Technical Order's, Engineering drawings, Trial Kit Installations, Verification Kit Installations, and spectrum authorization.  \n\nThis funding includes Rapid Global Mobility (RGM) platform related activities including but not limited to prototyping, capability development, process activities, planning analysis and systems engineering activities.\n \nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver AMP Increment 1 weapon system capability. The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F. The program may also include any Contractor Manpower Equivalent (CME)\/A&AS support deemed necessary to support the program objectives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C-130H Avionics Modernization Program (AMP) Increment 2"
                                    },
                                    "Description": {
                                        "val": "The program is currently executing the Engineering and Manufacturing Development (EMD) phase activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "53.748"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "85.625"
                                            },
                                            "Text": {
                                                "val": "Continuation of EMD activities to include but are not limited to software development, design, integration, development and operational test, program office support, studies and risk reduction efforts, trial kit buy and installation, technical order development validation and verification, peculiar support equipment and spares in support of trial kit installs, SIL development, type 1 training, and C-130H aircrew and maintenance training systems and courseware development efforts and other efforts required to fulfill program requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "41.973"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "41.973"
                                            },
                                            "Text": {
                                                "val": "Continuation of EMD activities to include but are not limited to software development, design, integration, development and operational test, program office support, studies and risk reduction efforts, trial kit buy and installation, technical order development validation and verification, peculiar support equipment and spares in support of trial kit installs, SIL development, type 1 training, and C-130H aircrew and maintenance training systems and courseware development efforts and other efforts required to fulfill program requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreased due to the majority of EMD development and integration activity occurring in FY19 and FY20."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF 05 Line Item C13000"
                                    },
                                    "Title": {
                                        "val": "C-130"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "0.050"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.050"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.403"
                                        },
                                        "BudgetYearThree": {
                                            "val": "106.691"
                                        },
                                        "BudgetYearFour": {
                                            "val": "77.575"
                                        },
                                        "BudgetYearFive": {
                                            "val": "74.573"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 06 Line Item 000999"
                                    },
                                    "Title": {
                                        "val": "Initial Spares\/Repair Parts"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.427"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.789"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.862"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.630"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The C-130H Avionics Modernization Program (AMP) Increment 2 procurement funding begins in FY21."
                        },
                        "AcquisitionStrategy": {
                            "val": "C-130H AMP Increment 2 contract was awarded 3rd quarter of 2019.  Current efforts are primarily focused on the Engineering and Manufacturing Development (EMD) activities under a Fixed-Price Incentive (Firm) contract structure."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Remarks\nFINANCIAL PERFORMANCE: AMP Increment 2 is evaluated against traditional Research and Development (R&D) program expenditure benchmarks. Unlike many traditional R&D programs, however, the AMP Increment 2 EMD phase contract is an FPIF contract with progress payments. 20 percent of incurred costs are withheld until the end of the contract, when they are liquidated. Mandatory funding obligations and progress payment withholds will cause the program to lag traditional expenditure benchmarks, painting an inaccurate portrait of overall program health."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "C-130H AMP Increment 2 EMD Contract"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L3Harris"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Waco, TX"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "49.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "68.215"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "27.926"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "27.926"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "162.941"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Joint Mission Planning System"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "8.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Other Government Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "C-130H AMP Increment 2 Development Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.900"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.900"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.600"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "C-130H AMP Increment 2 PMA Contractor Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Specified"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.748"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.860"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.997"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.997"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "21.835"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "C-130H AMP Increment 2 PMA - Government Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Specified"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.500"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "C-130H AMP Increment 2"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone B"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "EMD Contract Award"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Design\/Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Preliminary Design Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Critical Design Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Design\/Integration Training Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Development Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Functional Configuration Audit"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone C"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}