{
    "id": "2021-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-9791cb30a17933e364f6388e243081e196aa85793c267cee3ac7042f1c1057a0-2",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0602115E"
        },
        "ProgramElementTitle": {
            "val": "BIOMEDICAL TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "94.423"
            },
            "CurrentYear": {
                "val": "92.771"
            },
            "BudgetYearOne": {
                "val": "107.568"
            },
            "BudgetYearOneBase": {
                "val": "107.568"
            },
            "BudgetYearTwo": {
                "val": "110.953"
            },
            "BudgetYearThree": {
                "val": "115.878"
            },
            "BudgetYearFour": {
                "val": "125.768"
            },
            "BudgetYearFive": {
                "val": "136.352"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "101.300"
                },
                "CurrentYear": {
                    "val": "97.771"
                },
                "BudgetYearOne": {
                    "val": "123.570"
                },
                "BudgetYearOneBase": {
                    "val": "123.570"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "94.423"
                },
                "CurrentYear": {
                    "val": "92.771"
                },
                "BudgetYearOne": {
                    "val": "107.568"
                },
                "BudgetYearOneBase": {
                    "val": "107.568"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-6.877"
                },
                "CurrentYear": {
                    "val": "-5.000"
                },
                "BudgetYearOne": {
                    "val": "-16.002"
                },
                "BudgetYearOneBase": {
                    "val": "-16.002"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-5.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-3.471"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.406"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-16.002"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-16.002"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019:  Decrease reflects reprogrammings and the SBIR\/STTR transfer.\nFY 2020:  Decrease reflects congressional reduction.\nFY 2021:  Decrease reflects completion of the Prosthetic Hand Proprioception & Touch Interfaces (HAPTIX) program in FY 2020."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "BT-01"
                    },
                    "ProjectTitle": {
                        "val": "BIOMEDICAL TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "94.423"
                        },
                        "CurrentYear": {
                            "val": "92.771"
                        },
                        "BudgetYearOne": {
                            "val": "107.568"
                        },
                        "BudgetYearOneBase": {
                            "val": "107.568"
                        },
                        "BudgetYearTwo": {
                            "val": "110.953"
                        },
                        "BudgetYearThree": {
                            "val": "115.878"
                        },
                        "BudgetYearFour": {
                            "val": "125.768"
                        },
                        "BudgetYearFive": {
                            "val": "136.352"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Biomedical Technology Program Element focuses on applied research for medical related technology, information, processes, materials, systems, and devices.  Successful battlefield medical and neural interface technologies developed within this Program Element address a broad range of DoD challenges to ensure warfighter readiness, including both resilience to infectious disease and neurotechnology for improved warfighter performance. To maintain warfighter health, battlefield medical technologies research in this project will investigate disease forecasting, detection, and therapeutic response. Example programs include a predictive platform for forecasting disease outbreak, identification of early infection biomarkers to diagnose and prevent widespread infection in-theater, new methods to rapidly develop medical countermeasures in response to an emerging biothreat, and in-theater manufacturing capabilities for field-relevant pharmaceuticals to reduce the logistical burden and infrastructure requirements. To improve warfighter performance, this project will develop new neural architectures and data processing algorithms to interface the nervous system with multiple devices, enabling control of robotic prosthetic-limb technology.  Additionally, advanced evidence-based techniques will be developed to supplement warfighter healthcare, including the diagnosis of post-traumatic stress disorder (PTSD) and traumatic brain injury (TBI) and treatment of spinal cord injury."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Restoration of Auditory and Visual Function After Injury"
                                    },
                                    "Description": {
                                        "val": "The Restoration of Auditory and Visual Function After Injury program is developing neurotechnology to mitigate the effects of physical injury to the auditory and visual systems of military personnel. Research is also focusing on understanding various forms of sensing and actuation to improve outcomes and how biofeedback over time can alter human brain function. Technologies developed through this program will provide foundational neural interface technology for restoring lost capability, improving situational awareness, and enhancing cognitive and physical effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.485"
                                            },
                                            "Text": {
                                                "val": "-  Validated system designs and safety methods against standard regulatory practices.\n-  Demonstrated large-scale neural read capabilities using a fully integrated system.\n-  Collected data for the development and refinement of neural decoding and encoding algorithms.\n-  Prepared regulatory documents for regulatory approval."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.676"
                                            },
                                            "Text": {
                                                "val": "-  Validate system designs for prototyping and manufacture.\n-  Harden size, weight, and power of complete integrated system.\n-  Perform in vivo demonstration of the fully integrated input-output platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.217"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.217"
                                            },
                                            "Text": {
                                                "val": "-  Submit regulatory documentation to acquire regulatory approval for clinical testing.\n-  Construct a sensory restoration testbed for the fully integrated input-output platform.\n-  Quantify improvements offered by large-scale recording capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects reduction of research activities to conduct final system validation and demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neural Signal Interfaces and Applications (NSIA)"
                                    },
                                    "Description": {
                                        "val": "As part of their daily duties, many military personnel must handle large volumes of data and interact with complex systems.  These tasks could be made less difficult with advanced neurotechnology platforms, but all such devices currently require invasive surgery to implement.  The Neural Signal Interfaces and Applications (NSIA) program is developing non-invasive neurotechnologies able to interface with the nervous system with high resolution and precision without surgery. NSIA is utilizing recent advances to transduce neural signals through tissue. Resulting technologies will facilitate standard human-machine interfaces for improved workload balance between man and machine."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.895"
                                            },
                                            "Text": {
                                                "val": "-  Developed preliminary system level design to optimize power usage.\n-  Engineered prototypes of neural interface subcomponents and neural transducers.\n-  Computationally modeled proposed neural pathway mechanisms.\n-  Assessed neural read and write subcomponents and neural transducers in vitro.\n-  Completed preliminary design review of read and write components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.125"
                                            },
                                            "Text": {
                                                "val": "-  Initiate experiments toward achieving regulatory approval for clinical studies.\n-  Complete critical design review of read and write components.\n-  Verify and validate the safety, resolution, and stability of subcomponents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.924"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.924"
                                            },
                                            "Text": {
                                                "val": "-  Integrate neural read and write subcomponents.\n-  Optimize neural transducer delivery plan.\n-  Develop algorithms for noninvasive interaction with neural tissue.\n-  Conduct initial testing of integrated record and stimulate capabilities in vivo."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects completion of system design and integration plans of the neural interface system."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pandemic Prevention"
                                    },
                                    "Description": {
                                        "val": "Military personnel are deployed all over the world for traditional operations, and are often specifically called upon in response to emerging or re-emerging disease outbreaks with pandemic potential (e.g., Ebola). In both instances, the DoD needs effective countermeasures to protect its deployed forces and maintain warfighter readiness. The Pandemic Prevention program is focusing on novel methods to rapidly accelerate countermeasure discovery, pre-clinical testing, and manufacturing. This program seeks to advance and integrate newly developed approaches including bioinformatics assessment of genetic sequencing and nucleic acid-based vaccines and to address technology bottlenecks associated with each stage of medical countermeasure development. Additional research will investigate new methods improving the manufacturability, distribution, and delivery of novel therapeutics. Pandemic Prevention will enable an integrated therapeutic development platform that leverages state-of-the-art technologies to prevent disease outbreaks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.985"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated the ability to rapidly discover and mature antibodies against viral infections.\n-  Established gene-encoded antibody delivery methods in animal models.\n-  Demonstrated protection from pathogen challenge in animal models.\n-  Conducted, in under 90 days, preliminary demonstration of integrated technologies identifying, maturing, and delivering a gene-encoded antibody to provide protection against viral challenge in animal models.\n-  Initiated development and testing of nucleic acid constructs to encode for multiple antibody targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.450"
                                            },
                                            "Text": {
                                                "val": "-  Investigate the kinetic profile of gene-encoded antibodies in large animal models.\n-  Conduct, in under 60 days, a demonstration of integrated technologies identifying, maturing, and delivering a gene-encoded antibody to provide protection against viral challenge in animal models.\n-  Demonstrate, in less than 20 days, the ability to identify a highly potent antibody, targeting a viral pathogen.\n-  File an Investigational New Drug (IND) application with the Food and Drug Administration for a gene-encoded antibody product.\n-  Initiate a Phase I clinical safety study of a gene-encoded antibody.\n-  Initiate IND enabling studies for a nucleic acid construct encoding multiple antibodies.\n-  Initiate development of chemical assays for the distributed, rapid synthesis and purification of biomolecules."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.250"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the ability to manufacture clinical doses of gene-encoded antibody product at scale for use in clinical trials.\n-  Conduct a demonstration of integrated technologies identifying, maturing, and delivering a gene-encoded antibody to provide protection against viral challenge in vivo for a second viral indication. \n-  Conduct a demonstration of integrated technologies identifying, maturing, and delivering a gene-encoded antibody against a virus revealed just prior to demonstration.  \n-  Investigate the potential for a link between antibody sequence and level of expression from a nucleic acid construct."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Forensic Indicators of Threat Exposure (FITE)"
                                    },
                                    "Description": {
                                        "val": "Based on initial research conducted under the Enhanced Monitoring of Health and Disease program, the Forensic Indicators of Threat Exposure (FITE) program is developing a field-deployable resource for indicators of an individual's exposure history to Weapons of Mass Destruction (WMD) and WMD precursors. FITE will investigate the ability to characterize epigenetic signatures in an individual's genome caused by specific exposures. The program will create the framework for modular technology capable of performing forensic or diagnostic analysis using epigenetic information to provide high specificity of the type of exposure and when it occurred. This novel capability could serve as a field-forward forensic tool for use by the DoD to assist in Chemical, Biological, Radiological, and Nuclear (CBRN) threat detection and response."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.995"
                                            },
                                            "Text": {
                                                "val": "-  Identified exposure-specific epigenetic marks that reflect WMD or WMD precursor exposure events.\n-  Initiated efforts to validate sensitivity and specificity of the forensic and diagnostics signatures when combined with detection \talgorithms.\n-  Initiated efforts in discovering new methods to integrate multiple molecular analysis techniques and perform forensic and diagnostic assessment of exposure.\n-  Initiated research to understand connections between genotype and phenotype to inform correlation on human performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.404"
                                            },
                                            "Text": {
                                                "val": "-  Develop bioinformatics algorithms to decode and characterize differences in the complex epigenetic marks associated with each exposure event.\n-  Complete validation efforts to understand sensitivity and specificity of the forensic and diagnostics signatures when combined with detection algorithms.\n-  Select molecular analysis methods for integration into the deployable platform.\n-  Develop a platform prototype to integrate discovered molecular analysis techniques and perform forensic and diagnostic assessment of exposure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.285"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.285"
                                            },
                                            "Text": {
                                                "val": "-  Perform pressure tests to assess the ability to distinguish viral from bacterial signatures in clinical samples.\n-  Generate epigenetic signatures that reveal temporal resolution of exposure events from WMD or WMD precursor exposure events.\n-  Refine bioinformatics algorithms for increased sensitivity and specificity of the epigenetic signatures.\n-  Finalize selection of module components and complete system design for deployable platform prototype."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects the completion of research activities to focus on final system design and integration tasks."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Personnel Placement (IPP)"
                                    },
                                    "Description": {
                                        "val": "Building upon work initiated under the Forensic Indicators of Threat Exposure (FITE) program, the Improved Personnel Placement (IPP) program aims to improve force lethality and overmatch by identifying and training candidates for specialized military positions in order to maximize performance and resilience, while minimizing attrition. IPP will study the relationships between genotype and phenotype to identify unique physical, cognitive, and behavioral traits associated with a broad spectrum of military specialties. The program will develop technology to measure how someone uses their own genes to yield specific performance traits.  This knowledge will help the individual leverage this information to improve training, thus maximizing their potential. Measuring an individual's biological system will ensure that they achieve their maximum potential while facilitating readiness and resilience for the DoD."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.967"
                                            },
                                            "Text": {
                                                "val": "-  Identify initial set of traits that separate retrospective performance and resilience.\n-  Compare attributes of specialized warfighters to identify biomarkers associated with specialized military roles.\n-  Build data analysis approaches that can integrate proteomic, genomic, and epigenetic results to characterize elite performers.\n-  Implement novel phenotypic detection assays in a performance cohort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.167"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.167"
                                            },
                                            "Text": {
                                                "val": "-  Conduct multi-omics assays to create layered biological data for building gene expression circuits.\n-  Identify gene expression circuits related to elite performance.\n-  Refine analytical approaches to improve sensitivity and selectivity.\n-  Determine signal transduction method for biosensors.\n-  Develop initial indicators that can measure how gene expression changes over time to drive human performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Deployable Medical Countermeasures for Warfighter Readiness"
                                    },
                                    "Description": {
                                        "val": "Maintaining robust protection and treatment against infectious disease threats during stabilization operations (e.g., Humanitarian and Disaster Relief [HADR]) can cause a drug discovery, manufacturing and supply chain burden. A major limitation of our current response to emerging biological and chemical threats is the lack of immediate availability of ideal medical countermeasures (MCM) for rapid response. The Deployable Medical Countermeasures for Warfighter Readiness program aims to develop an on-demand deployable platform to manufacture nucleic acid drugs at scale, in short timeframes. The platform will be comprised of a fully contained system capable of selectively manufacturing relevant doses of current Good Manufacturing Process (cGMP) grade nucleic acid therapeutics at or near the point of care. This on-demand platform will enable countermeasures capable of combating novel threats, allowing a small force to prevent regional outbreaks from becoming global emergencies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.728"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.728"
                                            },
                                            "Text": {
                                                "val": "-  Initiate development of hardware and software to support production of biomolecules in a laboratory setting.\n-  Demonstrate the ability to biochemically or chemically synthesize and purify biomolecules.\n-  Demonstrate the efficacy of biochemically or chemically synthesized nucleic acids (DNA and\/or RNA).\n-  Demonstrate the ability to purify and analyze synthesized nucleic acids in a laboratory setting."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bridging the Gap after Spinal Cord Injury"
                                    },
                                    "Description": {
                                        "val": "The Bridging the Gap after Spinal Cord Injury program will develop and integrate technologies to heal and restore function associated with spinal cord injuries. Building upon foundational work done under the Prosthetic Hand Proprioception & Touch Interfaces program, this program will significantly advance treatment technologies by developing implantable, adaptive devices to address different stages of spinal cord injury (acute, sub-acute, and chronic). For early phases of injury, this program will develop technologies for real-time biomarker tracking and delivery of therapies to stabilize or rebuild nerve connections at the injury site. For final phase of injury, the Bridging the Gap after Spinal Cord Injury program will develop and integrate a network of devices deployed across the body to effectively create a synthetic nervous system and \"bridge the gap\" of the spinal cord injury to restore function and sensory feedback. The Bridging the Gap after Spinal Cord Injury program will dramatically improve the quality of life for wounded warfighters and veterans suffering from spinal cord injuries."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.997"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.997"
                                            },
                                            "Text": {
                                                "val": "-  Research and design initial prototype sensors that will monitor the state of the spinal cord injury.\n-  Initiate assessment of the prototype devices that will help stabilize injury and restore lost function.\n-  Establish preliminary design plans for system integration. \n-  Initiate the design of a software development kit that will facilitate system modularity."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prosthetic Hand Proprioception & Touch Interfaces (HAPTIX)"
                                    },
                                    "Description": {
                                        "val": "Wounded warriors often suffer from neural injury due to spinal cord injury or amputations.  Military personnel with amputated limbs get limited benefit from recent advances in prosthetic-limb technology because the user interface for controlling the limb is low-performance and unreliable.  Through investments in the DARPA Reliable Neural-Interface Technology (RE-NET) program, novel interface systems have been developed that overcome these issues and are designed to last for the lifetime of the patient.  The goal of the Prosthetic Hand Proprioception & Touch Interfaces (HAPTIX) program is to create the first bi-directional (motor & sensory) peripheral nerve implant for controlling and sensing advanced prosthetic limb systems.  With a strong focus on transition, the HAPTIX program will create and transition clinically relevant technology in support of wounded warriors suffering from single or multiple limb loss.  Research in this area will also address similar interface technologies with other nerve pathways such as the spinal cord.  The anticipated transition partner is the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.985"
                                            },
                                            "Text": {
                                                "val": "-  Obtained regulatory approval for HAPTIX technology.\n-  Conducted novel outcome metric testing on HAPTIX amputee participants.\n-  Initiated algorithm development, hardware manufacturing, and system integration for an implanted percutaneous device to link information flow across a spinal cord injury."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.149"
                                            },
                                            "Text": {
                                                "val": "-  Initiate take-home studies of the HAPTIX system.\n-  Evaluate benefits of sensory feedback during extended system use outside the laboratory.\n-  Complete surgical implants and perform proof of concept testing of the percutaneous spinal cord injury device.\n-  Review and assess efforts to build novel sensors, stimulators, and algorithms for spinal cord injury stabilization and functional restoration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neuro-Adaptive Technology"
                                    },
                                    "Description": {
                                        "val": "The Neuro-Adaptive Technology program explored and developed advanced technologies for real-time detection and monitoring of neural activity. One shortcoming of today's brain functional mapping technologies was the inability to obtain real-time correlation data that links neural function to human activity and behavior. Understanding the structure-function relationship as well as the underlying mechanisms that link brain and behavior is a critical step in providing real-time, closed-loop therapies for military personnel suffering from a variety of brain disorders. Efforts under this program examined the networks of neurons involved in post-traumatic stress disorder (PTSD), traumatic brain injury (TBI), depression, and anxiety as well as determined how to best ameliorate these disorders. The objective for this program was to develop new hardware and modeling tools to better discriminate the relationship between human behavioral expression and neural function and to provide relief through novel devices. These tools allowed for an improved understanding of how the brain regulates behavior and enabled new, disorder-specific, dynamic neuro-therapies for treating neuropsychiatric and neurological disorders in military personnel. Technologies developed under this program include devices for real-time detection of brain activity during operational tasks, time synchronized acquisition of brain activity and behavior, and statistical models that correlate neural activity with human behavioral expression."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.078"
                                            },
                                            "Text": {
                                                "val": "-  Utilized clinical data to further refine biomarkers, computational models, and stimulation paradigms for closed-loop modulation of psychiatric or neurologic conditions.\n-  Integrated approaches targeting psychiatric or neurologic conditions with complementary biomarkers, neural targets, and computational models.\n-  Demonstrated use of neural devices in a clinical setting to reduce relevant psychiatric or neurologic symptoms through real-time, closed-loop, biomarker-driven stimulation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Monitoring of Health and Disease"
                                    },
                                    "Description": {
                                        "val": "The Enhanced Monitoring of Health and Disease program has improved military health and force readiness by leveraging advanced data collection methods and prognostic capabilities to predict changes in health and spread of infectious disease from the individual to the population scale. While new technology platforms have enhanced our ability to respond to illness and disease, there is a need for predictive and pre-emptive technologies that enable us to correctly prepare a response prior to its obvious need, such as in a barracks or in a confined environment (e.g., submarine). Research in this program  investigated new methods for the collection and detection of multiplexed biological markers as well as the analysis, correlation, and ultimate integration of vast personalized data into the clinical care information technology infrastructure. Additionally, this program developed new approaches to integrate multi-source data streams to create effective predictive models of disease outbreak and spread. Technologies developed in this program have enabled clinically actionable information, even when an individual exhibiting no symptoms, that will extend to infectious disease forecasting into a real-time, accurate capability for decision support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiated additional clinical cohort studies that represent secondary transmission events for biomarker and contagiousness measurements.\n-  Evaluated performance of the minimal set of biomarkers for the ability to predict contagiousness outcomes against the clinical cohort data.\n-  Initiated development of a prognostic assay that predicts contagiousness using the minimal set of biomarkers."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}