{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-9035d21372bc28631c31031b85da2fbd962d290bf8d6ca6eecbc49021508de49-76",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0605170D8Z"
        },
        "ProgramElementTitle": {
            "val": "Support to Networks and Information Integration"
        },
        "R1LineNumber": {
            "val": "158"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "71.017"
            },
            "PriorYear": {
                "val": "11.042"
            },
            "CurrentYear": {
                "val": "9.441"
            },
            "BudgetYearOne": {
                "val": "9.582"
            },
            "BudgetYearOneBase": {
                "val": "9.582"
            },
            "BudgetYearTwo": {
                "val": "8.983"
            },
            "BudgetYearThree": {
                "val": "8.888"
            },
            "BudgetYearFour": {
                "val": "8.885"
            },
            "BudgetYearFive": {
                "val": "9.063"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.424"
                },
                "CurrentYear": {
                    "val": "9.441"
                },
                "BudgetYearOne": {
                    "val": "9.341"
                },
                "BudgetYearOneBase": {
                    "val": "9.341"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.042"
                },
                "CurrentYear": {
                    "val": "9.441"
                },
                "BudgetYearOne": {
                    "val": "9.582"
                },
                "BudgetYearOneBase": {
                    "val": "9.582"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.382"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.241"
                },
                "BudgetYearOneBase": {
                    "val": "0.241"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.380"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Financing Cancelled Account"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.002"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Program Budget Review"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.250"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.250"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.009"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.009"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY19: BTR +1.746 million\nFY19: SIBR\/STTR Reduction -0.380 million.\nFY19: Reprogramming FY19 Financing Cancelled Account Reduction -0.002 million.\nFY21: Increase for IT Modernization (Classified) +0.250 million.\nFY21: Defense-Wide Economic Assumptions -.009 million."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "170"
                    },
                    "ProjectTitle": {
                        "val": "Support to NII"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "71.017"
                        },
                        "PriorYear": {
                            "val": "11.042"
                        },
                        "CurrentYear": {
                            "val": "9.441"
                        },
                        "BudgetYearOne": {
                            "val": "9.582"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.582"
                        },
                        "BudgetYearTwo": {
                            "val": "8.983"
                        },
                        "BudgetYearThree": {
                            "val": "8.888"
                        },
                        "BudgetYearFour": {
                            "val": "8.885"
                        },
                        "BudgetYearFive": {
                            "val": "9.063"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Funding supports Global Positioning System (GPS) User Equipment Synchronization with GPS space and operational control segments to conduct DoD CIO oversight of Global Positioning System (GPS) management and planning activities required for meeting JCIDs requirements. Funding supports policy and guidance for incorporation of alternative means of PNT delivery to augment GPS. Funding also supports the DoD’s PNT Oversight Council and inputs into interagency activities under the National Space-Based Positioning, Navigation, and Timing Executive Committee.\n\nIn support of the National Defense Strategy (NDS), GPS continues to provide a force multiplier for the Joint Force and key US allies. Its modernization, and alternative, complement means of PNT provision will maintain this advantage. Superior PNT provides enhanced Joint Force lethality through precision targeting, exacting ISR, efficient logistics, blue force tracking, and a myriad of other force enhancements. These are enjoyed by the Joint Force and key US allies. As such, they ensure efficient and effective force employment.\n\nThe Integrated Planning and Management Project encompasses the Nuclear Management Office's (NMO) responsibilities for establishing overall DoD policy and oversight with respect to the capability development, interoperability, standards, and architecture for National Command Capabilities for our Nation’s Senior Leadership.  The NMO serves as the single point of contact within the Department for policy, long-range plans, programs and budget, integrated mission advocacy, and management of decision-maker capabilities.  NMO’s objective is to ensure capabilities are in place to provide complete and timely situational awareness and decision tools for senior decision-makers.  Additionally, the NMO assists the DoD CIO as the Executive Agent and primary OSD advocate for the White House Military Office with oversight of a wide range of DoD command, control, and communications (C3) assets and oversees the efforts of the Services and Agencies in the design, integration, and deployment of critical and sensitive C3 capabilities.  Two overall areas of focus include: 1) National Senior Leader C3 Systems, National Security\/Emergency Preparedness (NS\/EP), DoD support to Civil Authorities; Continuity of Government (COG); 2) Cyber Mission Indications and Warnings.\n\nNMO provides guidance, oversight and policy direction support for Senior Leadership communications and Continuity communications which enable the National Security Strategy's \"build a more lethal force\" line of effort.  By coordinating and integrating with the National Security Agency in the development of a security policy that provides guidance to the NMO community on cyber secure connection interfaces and security patterns on a continuous basis to addresses hardware, firmware and software vulnerabilities.  Working with DISA, the Services, and other federal government agencies to ensure the safety of our Nation's critical undersea cable infrastructure.  Provide guidance and oversight to all NMO cryptographic modernization programs, ensure NSA and the appropriate Service delivers their cryptographic capability on time and work with the combatant commanders' staff to ensure they have operationalized any potential risks with potential cryptographic program delays.\n\nCoordinate the DoD's critical time dissemination resiliency plans and initiatives with senior representatives from the precision, navigation and timing (PNT) community.  Work with the Joint Staff, Army, Air Force, Navy, and Marine Corps to ensure their PNT plans include primary and alternate capabilities.  Continue analysis of White House, DoD Services, DoD Agencies and Combatant Command initiatives to ensure the effectiveness of our airborne command, control and communications, commercial and military satellite communications, and their supporting ground infrastructure.  Analysis will ensure our Senior Leadership C3 is operationally effective during all phases of a conflict."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Support to NII"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.042"
                                            },
                                            "Text": {
                                                "val": "Global Positioning System (GPS) User Equipment Synchronization with GPS space and control segments to conduct DoD CIO oversight of Global Positioning System (GPS) management and planning activities required for meeting JCIDs requirements and supporting the National Space-Based Positioning, Navigation and Timing Executive Committee. Funding will support:\n-\tManage the GPS Security Policy (DoDM-O4650.11).\n-\tManage the Information Assurance\/COMSEC elements of DoDM-O4650.11.\n-\tDevelop the NAVWAR manual (DoDM-4650.ed).\n-\tContinue implementation of the GPS Protection Profile matrix from  Navigation Warfare Concept of Operations in conjunction with \nWarfighting Operations Plans (OPLANS) and Contingency Plans (CONPLANS) in coordination with US STRATCOM.\n-\tManage PNT Navigation Warfare Instruction and Annexes to all the Operations Plans (OPLANS) and Contingency Plans (CONPLANS) in coordination with US STRATCOM.\n-\tManage NextGen interfaces with the GPS Wing, Joint Program Development Office (JPDO), and Air Force.  Continue implementation of Red Key Sundown Policy.\n-\tProvide staff support, perform research and conduct studies as directed by DEPSECDEF in his role as co-chair of the National Executive Committee for Space-Based PNT and for DoD CIO in his role as co-chair of the Executive Steering Group.\n-\tPerform annual update of National Five-year Plan for Space-Based Positioning, Navigation and Timing (PNT).\n-\tApply Navigation Warfare Concept of Operations via the Joint Navigation Warfare Center (JNWC) and US STRATCOM to develop Doctrine, Tactics, Techniques and Procedures, Training, Equipment Validation and Material Solutions to Navigation Warfare challenges to the Military Services and Combatant Commanders in the scenarios defined in the CONPLANS and OPLANS.\n-\tManage and implement the DoD PNT investment strategy using the NetCentric Operations CPM portfolio to insure PNT material solutions are developed in a synchronized fashion in JCIDs, DAS, and PPBE.\n-\tImplement additional Instructions (DoDIs) for public affairs and receiver certification, and DoDM for security policy.\n-\tManage inventory of DoD GPS receivers.\n-\tAnalyze and promote alternative PNT delivery means for inclusion in the force structure for force protection.\n-            Biennially task Intelligence Community (IC) to assess threat vectors to GPS and other means of PNT delivery; biennial operational assessments to reveal gaps in PNT delivery against OPLANS and CONPLANS of COCOMS; maintenance of PNT equipment inventories, refreshed biennially.\n-            Develop Directives, Instructions, and Manuals for implementation of the PNT Strategy within the Department.\n-\tContinue special task directed by DCIO to address acceleration of development and fielding of advanced GPS receivers in the Joint Force.\n-\tMaintain and update inventory of existing GPS receiver equipage; expand to include antennae and antennae electronics; expand to include delivery of PNT via other-than-GPS equipment.\n-\tAddress prioritized platforms in fielding plans and guidance to Services.\n-            Develop MGUE “Roadmap” illustrating necessary fielding milestones for Joint Force MGUE equipage.\n-\tAdminister PNT Council within DoD via supporting DoDDs and DoDIs, agendas and minutes for Council meetings, Council task disposition and annual report to Congress.\nContinue IT Enterprise and solution architecture development, analysis, and registration processes.\nContinue NC3 Modeling and Simulation and Analysis – Continue to provide direction and support to the DISA\/JSEIO in developing campaign level modeling and simulation tools for NC3. The research and development of the tools will continue to increase the capabilities of modeling and simulation for strategic communications (MASSC) (conferencing capabilities), NC3-N executable architecture management system (NC3-N ExAMS) (analysis of nodes, metrics and assets associated with a Navy communications system), joint operations visualization environment (JOVE) and NC3 integrated scenario modeler (NISM) (provide extendable, transparent multi-level simulations of scenarios).\n\n- $0.800 million – Continue to perform financial database analysis and use the R-DOCs and P-DOCs to create a new structure for the NLCC Investment Strategy. Continue to build automatic extraction tools for the R=DOCs and P-DOCs. Continue developing program lists using programmatic data in Excel. Continue to develop an XML Parser to move data to into a single database to work on Schedule Views (GANTT) and move to a roadmap format, starting off as a manual process, and leading to an automated process.\nSystem Engineering and Agile Development per MARMS Requirements Definition Package(RDP)-1.  In FY19 MARMS will continue development of CD1 Information Sharing, CD2 Assessments, and CD3 Enhanced Stakeholder Systems to an Initial Operational Capability (IOC).  This will provide the department with a single repository of DCI and AT data to perform analysis and manage risk perf DODD 3020.40.     The development focus in FY19 will be on the development and implementation of the Mission Assurance Workspace and Viewer on SIPRNet and JWICS.   The MA Workspace and Viewer will provide the department’s leadership with a consolidated MA dashboard, and analytical capabilities to perform planning and analysis of Mission Assurance activities per DoDD 3020.40 and 3020.45."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.441"
                                            },
                                            "Text": {
                                                "val": "Global Positioning System (GPS) User Equipment Synchronization with GPS space and control segments to conduct DoD CIO oversight of Global Positioning System (GPS) management and planning activities required for meeting JCIDs requirements and supporting the National Space-Based Positioning, Navigation and Timing Executive Committee. Funding will support:\n-\tManage the GPS Security Policy (DoDM-O4650.11).\n-\tManage the Information Assurance\/COMSEC elements of DoDM-O4650.11.\n-       Develop Precisie Time and Time Interval (PTTI) Manual in DoDD 4650.05 family of PNT Issuances.\n-\tContinue implementation of the GPS Protection Profile matrix from Navigation Warfare Concept of Operations in conjunction with Warfighting Operations Plans (OPLANS) and Contingency Plans (CONPLANS) in coordination with US STRATCOM.\n-\tManage PNT Navigation Warfare Instruction and Annexes to all the Operations Plans (OPLANS) and Contingency Plans (CONPLANS) in coordination with US STRATCOM.\n-\tManage NextGen interfaces with the GPS Wing, Joint Program Development Office (JPDO), and Air Force.  Continue implementation of Red Key Sundown Policy.\n-\tProvide staff support, perform research and conduct studies as directed by DEPSECDEF in his role as co-chair of the National Executive Committee for Space-Based PNT and for DoD CIO in his role as co-chair of the Executive Steering Group.\n-\tPerform annual update of National Five-year Plan for Space-Based Positioning, Navigation and Timing (PNT).\n-\tApply Navigation Warfare Concept of Operations via the Joint Navigation Warfare Center (JNWC) and US STRATCOM to develop Doctrine, Tactics, Techniques and Procedures, Training, Equipment Validation and Material Solutions to Navigation Warfare challenges to the Military Services and Combatant Commanders in the scenarios defined in the CONPLANS and OPLANS.\n-\tManage and implement the DoD PNT investment strategy using the NetCentric Operations CPM portfolio to insure PNT material solutions are developed in a synchronized fashion in JCIDs, DAS, and PPBE.\n-\tImplement additional Instructions (DoDIs) for public affairs and receiver certification, and DoDM for security policy.\n-\tManage inventory of DoD GPS receivers. Complete Roadmap of GPS UE fielding for MGUE. \n-\tAnalyze and promote alternative PNT delivery means for inclusion in the force structure for force protection. Develop Open Systems Architecture Standards for fielding of alternative PNT. Develop M&S tool for alternative PNT analysis. \n-       Biennially task Intelligence Community (IC) to assess threat vectors to GPS and other means of PNT delivery; biennial operational assessments to reveal gaps in PNT delivery against OPLANS and CONPLANS of COCOMS; maintenance of PNT equipment inventories, refreshed biennially.\n-       Develop Directives, Instructions, and Manuals for implementation of the PNT Strategy within the Department.\n-\tContinue special task directed by DCIO to address acceleration of development and fielding of advanced GPS receivers in the Joint Force.\n-\tMaintain and update inventory of existing GPS receiver equipage; expand to include antennae and antennae electronics; expand to include delivery of PNT via other-than-GPS equipment.\n-\tAddress prioritized platforms in fielding plans and guidance to Services.\n-       Develop MGUE “Roadmap” illustrating necessary fielding milestones for Joint Force MGUE equipage.\n-\tAdminister PNT Council within DoD via supporting DoDDs and DoDIs, agendas and minutes for Council meetings, Council task disposition and annual report to Congress. Chair and manage subordinate WGs for PNT Policy and NAVWAR. \n-       Address NATO PNT interoperability via STANAGs, Allied Navigation Plans, and associated documentation in NATO CaP-2 under C3 Board direction. Insure complementarity of allied equipage and planning based on USAF GPS development, open systems architecture development, and foreign PNT systems and capabilities. \n-       Insure cyber security of all elements of the Department PNT ecosystem. Assist civil Departments and Agencies, as required.\n\nIntegrated Planning and Management (NMO):\nContinue NLCC Modeling and Simulation and Analysis – Continue to provide oversight and guidance to the DISA\/JSEIO in developing end-to-end campaign-level modeling and simulation tools for NLCC. The research and development of the tools continued to increase the capabilities of MASSC (conferencing capabilities), NC3-N ExAMS (analysis of nodes, metrics and assets associated with a Navy communications system) and NISM (provide extendable, transparent multi-level simulation of scenarios).  Deliverable will determine COCOM OPLAN risk in denied environments.\n\nProvide oversight and guidance on Maritime Information Systems (MIS) and Submarine Fiber Optic Cables (SFOC) and associated infrastructure.  These activities will encompass overseeing analysis of requirements, identifying communications capability shortfalls and interoperability issues, assessing equipment performance issues and exploring future communications improvements.  This includes technical expertise and systems engineering expertise in support of acquisition, planning, procurement, installation, operations and sustainment of MIS and SFOC capabilities.  \n\nProvide technical expertise and oversight of Senior Leader C3 Systems and platforms including fixed and mobile communications capabilities of the White House, Secretary of Defense, Chairman of the Joint Chiefs of Staff, and other identified Senior Leaders. These activities will encompass consolidating Senior Leader operational mission requirements, identifying communications capability shortfalls and interoperability issues, assessing equipment performance issues and exploring future communications improvements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.582"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.582"
                                            },
                                            "Text": {
                                                "val": "Global Positioning System (GPS) User Equipment Synchronization with GPS space and control segments to conduct DoD CIO oversight of Global Positioning System (GPS) management and planning activities required for meeting JCIDs requirements and supporting the National Space-Based Positioning, Navigation and Timing Executive Committee. Funding will support:\n-\tManage the GPS Security Policy (DoDM-O4650.11).\n-\tManage the Information Assurance\/COMSEC elements of DoDM-O4650.11.\n-       Develop Precisie Time and Time Interval (PTTI) Manual in DoDD 4650.05 family of PNT Issuances.\n-\tContinue implementation of the GPS Protection Profile matrix from Navigation Warfare Concept of Operations in conjunction with Warfighting Operations Plans (OPLANS) and Contingency Plans (CONPLANS) in coordination with US STRATCOM.\n-\tManage PNT Navigation Warfare Instruction and Annexes to all the Operations Plans (OPLANS) and Contingency Plans (CONPLANS) in coordination with US STRATCOM.\n-\tManage NextGen interfaces with the GPS Wing, Joint Program Development Office (JPDO), and Air Force.  Continue implementation of Red Key Sundown Policy.\n-\tProvide staff support, perform research and conduct studies as directed by DEPSECDEF in his role as co-chair of the National Executive Committee for Space-Based PNT and for DoD CIO in his role as co-chair of the Executive Steering Group.\n-\tPerform annual update of National Five-year Plan for Space-Based Positioning, Navigation and Timing (PNT).\n-\tApply Navigation Warfare Concept of Operations via the Joint Navigation Warfare Center (JNWC) and US STRATCOM to develop Doctrine, Tactics, Techniques and Procedures, Training, Equipment Validation and Material Solutions to Navigation Warfare challenges to the Military Services and Combatant Commanders in the scenarios defined in the CONPLANS and OPLANS.\n-\tManage and implement the DoD PNT investment strategy using the NetCentric Operations CPM portfolio to insure PNT material solutions are developed in a synchronized fashion in JCIDs, DAS, and PPBE.\n-\tImplement additional Instructions (DoDIs) for public affairs and receiver certification, and DoDM for security policy.\n-\tManage inventory of DoD GPS receivers. Complete Roadmap of GPS UE fielding for MGUE. \n-\tAnalyze and promote alternative PNT delivery means for inclusion in the force structure for force protection. Develop Open Systems Architecture Standards for fielding of alternative PNT. Develop M&S tool for alternative PNT analysis. \n-       Biennially task Intelligence Community (IC) to assess threat vectors to GPS and other means of PNT delivery; biennial operational assessments to reveal gaps in PNT delivery against OPLANS and CONPLANS of COCOMS; maintenance of PNT equipment inventories, refreshed biennially.\n-       Develop Directives, Instructions, and Manuals for implementation of the PNT Strategy within the Department.\n-\tContinue special task directed by DCIO to address acceleration of development and fielding of advanced GPS receivers in the Joint Force.\n-\tMaintain and update inventory of existing GPS receiver equipage; expand to include antennae and antennae electronics; expand to include delivery of PNT via other-than-GPS equipment.\n-\tAddress prioritized platforms in fielding plans and guidance to Services.\n-       Develop MGUE “Roadmap” illustrating necessary fielding milestones for Joint Force MGUE equipage.\n-\tAdminister PNT Council within DoD via supporting DoDDs and DoDIs, agendas and minutes for Council meetings, Council task disposition and annual report to Congress. Chair and manage subordinate WGs for PNT Policy and NAVWAR. \n-       Address NATO PNT interoperability via STANAGs, Allied Navigation Plans, and associated documentation in NATO CaP-2 under C3 Board direction. Insure complementarity of allied equipage and planning based on USAF GPS development, open systems architecture development, and foreign PNT systems and capabilities. \n-       Insure cyber security of all elements of the Department PNT ecosystem. Assist civil Departments and Agencies, as required.\n\nIntegrated Planning and Management (NMO):\nContinue NLCC Modeling and Simulation and Analysis – Continue to provide oversight and guidance to the DISA\/JSEIO in developing end-to-end campaign-level modeling and simulation tools for NLCC. The research and development of the tools continued to increase the capabilities of MASSC (conferencing capabilities), NC3-N ExAMS (analysis of nodes, metrics and assets associated with a Navy communications system) and NISM (provide extendable, transparent multi-level simulation of scenarios).  Deliverable will determine COCOM OPLAN risk in denied environments.\n\nProvide oversight and guidance on Maritime Information Systems (MIS) and Submarine Fiber Optic Cables (SFOC) and associated infrastructure.  These activities will encompass overseeing analysis of requirements, identifying communications capability shortfalls and interoperability issues, assessing equipment performance issues and exploring future communications improvements.  This includes technical expertise and systems engineering expertise in support of acquisition, planning, procurement, installation, operations and sustainment of MIS and SFOC capabilities.  \n\nProvide technical expertise and oversight of Senior Leader C3 Systems and platforms including fixed and mobile communications capabilities of the White House, Secretary of Defense, Chairman of the Joint Chiefs of Staff, and other identified Senior Leaders. These activities will encompass consolidating Senior Leader operational mission requirements, identifying communications capability shortfalls and interoperability issues, assessing equipment performance issues and exploring future communications improvements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19: BTR +1.746 million\nFY21: Defense-Wide Review increase for IT Modernization (Classified) +0.250 million."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}