{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-14",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602150A"
        },
        "ProgramElementTitle": {
            "val": "Air and Missile Defense Technology"
        },
        "R1LineNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0"
            },
            "CurrentYear": {
                "val": "95.771"
            },
            "BudgetYearOne": {
                "val": "56.298"
            },
            "BudgetYearOneBase": {
                "val": "56.298"
            },
            "BudgetYearTwo": {
                "val": "51.609"
            },
            "BudgetYearThree": {
                "val": "41.272"
            },
            "BudgetYearFour": {
                "val": "41.729"
            },
            "BudgetYearFive": {
                "val": "42.006"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "328.685"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020, this Program Element (PE) was realigned with continuity of effort from the following PEs:\n* 0602120A Sensors and Electronic Survivability\n* 0602303A Missile Technology\n* 0602307A Advanced Weapons Technology\n* 0602705A Electronics and Electronic Devices\n* 0602784A Military Engineering Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "Work in this PE investigates and develops Air and Missile Defense (AMD) technologies to enable defense of ground forces and selected geopolitical assets from aerial attack, missile attack, and surveillance. Major focus areas for AMD Science and Technology include: Missiles, Directed Energy, Gun-Based Air Defense Technologies, and Battlefield Sensors and Supporting AMD Technologies. Missiles Applied Research investigates and develops a broad range of Missile technologies to enhance Army integrated AMD capabilities at extended range.   Directed Energy Applied Research investigates and develops critical High Energy Laser (HEL) technologies to explore performance against Air Defense threats and for other Directed Energy applications across Army Modernization Priorities. Gun-Based Air Defense Technologies Applied Research investigates and develops Combined Arms for Air Defense (CAFAD) technologies and components in a laboratory environment. Sensors and Supporting AMD Technologies Applied Research investigates and develops Battlefield Sensor and radar technologies required for detection, acquisition and tracking of air defense targets as well as supporting technologies that enhance AMD.\n\nWork in this PE complements PE 0603466A (Air and Missile Defense Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the United States Army Futures Command (AFC), the United States Army Space and Missile Defense Command\/Army Strategic Forces Command (SMDC\/ARSTRAT), and the United States Army Rapid Capabilities and Critical Technologies Office (RCCTO)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "50.771"
                },
                "BudgetYearOne": {
                    "val": "58.558"
                },
                "BudgetYearOneBase": {
                    "val": "58.558"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "95.771"
                },
                "BudgetYearOne": {
                    "val": "56.298"
                },
                "BudgetYearOneBase": {
                    "val": "56.298"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "45"
                },
                "BudgetYearOne": {
                    "val": "-2.26"
                },
                "BudgetYearOneBase": {
                    "val": "-2.26"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "45"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.26"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.26"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY20 increase related to FY20 Congressional Adds."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AC9"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser Tactical Vehicle Demonstrator Te"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "11.114"
                        },
                        "BudgetYearOne": {
                            "val": "9.349"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.349"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "20.463"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) PE 0602307A Advanced Weapons Technology\n* Project 042 High Energy Laser Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates component technologies for mobile high energy laser (HEL) weapon systems in solid state lasers (SSL) for use in protecting fixed and semi-fixed sites from Rocket, Artillery, and Mortars (RAM), Unmanned Aerial Systems (UAS) and advanced Air Defense threats. The Project researches advanced technologies for HEL weapon systems to enable more efficient laser systems with significantly greater power output for future HEL weapons to augment current kinetic Air Defense Artillery (ADA) systems and address additional missions with a low cost-per-kill exchange ratio. This includes technologies to support development of alternate laser sources, precision optical pointing and tracking components and adaptive optics to overcome laser degradation due to atmospheric effects to gain great lethality permitting expansion of threats set.  Additionally development of compact and lighter weight energy generation and storage devices, and more efficient thermal management systems to remove excess heat will permit integrating laser weapons on additional combat platforms.\n\nWork in this Project complements PE 0603466A (Air and Missile Defense Advanced Technology) \/ Project AD1 (High Energy Laser Tactical Vehicle Demonstrator Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy and supports the Army's future capability opportunities for leap-ahead technology for directed energy.\n\nWork is performed by the United States (US) Army Rapid Capabilities and Critical Technologies Office (RCCTO)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Energy Laser Tactical Vehicle Demonstrator Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops technologies for robust beam control and SSL subsystems in the HEL Tactical Vehicle Demonstrator (TVD). Technologies developed under this effort will enable lighter, more agile beam control systems for tactical Army platform development and SSL technologies that enhance effectiveness against emerging air defense threats and increase efficiencies, enabling reductions in size, weight and power (SWaP) and improving the ability to integrate SSL systems into multiple Army weapon platforms."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.114"
                                            },
                                            "Text": {
                                                "val": "Will complete development of the gimbal, telescope and main optics bench for the HEL TVD beam control system; Will utilize knowledge\/design from FY19 Adaptive Optics component demonstration and incorporate state-of-the-art optical focal planes to extend effectiveness of laser system in challenging environments to make the HEL TVD beam control system more robust; Will prepare beam control subsystem for integration with other subsystems in the system integration laboratory; Will complete development of the 100 kW laser subsystem for the HEL TVD; Will prepare laser system for integration with beam control, power and thermal subsystems in the system integration laboratory."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.349"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.349"
                                            },
                                            "Text": {
                                                "val": "Will conduct experimentation with prototype HEL TVD surrogate beam control system to characterize the performance of the base design: assess Adaptive Optics (AO) component demonstration and incorporate state-of-the-art optical focal planes to extend effectiveness of laser system in challenging environments to inform the HEL TVD beam control system design; Will prepare beam control subsystem for integration with other subsystems in the system integration laboratory; Will continue investigation, modeling & simulation, assessment, and development of laser subsystems (e.g. laser sources, power and thermal subsystems) necessary for defeat of emerging and advanced air defense threats for the HEL TVD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funds moved within this PE to Project AD2 (High Energy Laser Enabling and Support Technology) in order to further develop the Mobile Beam Control Systems Integration Laboratory (MBC SIL)."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AD2"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser (HEL) Enabling and Support Techn"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "7.963"
                        },
                        "BudgetYearOne": {
                            "val": "10.113"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.113"
                        },
                        "BudgetYearTwo": {
                            "val": "8.278"
                        },
                        "BudgetYearThree": {
                            "val": "8.444"
                        },
                        "BudgetYearFour": {
                            "val": "8.538"
                        },
                        "BudgetYearFive": {
                            "val": "8.539"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "51.875"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) 0602307A Advanced Weapons Technology\n* Project Code 042 High Energy Laser Technology\nPE 0602705A Electronics and Electronic Devices\n* Project EM8 High Power And Energy Component Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts static and dynamic High Energy Laser (HEL) vulnerability and lethality analyses and investigates advanced component technologies to enhance performance of future HEL weapons systems against advanced threats. In addition, this Project includes laboratory efforts for HEL applied research as well as concepts analysis for Army core competencies in directed energy.  This Project also investigates advanced laser technologies based on unconventional solid-state laser concepts, architectures, and thermal\/power management schemes for the development of low size, weight, and power (SWaP) Army directed energy (DE) weapons and tactical laser developers.\n\nWork in this effort compliments other Army Directed Energy efforts conducted under PE 0602150A (Air and Missile Defense Technology) and PE 0603466A (Air and Missile Defense Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Modernization Strategy, and supports the Army's future capability opportunities for leap-ahead technology for directed energy.\n\nWork is performed by the United States Army Space and Missile Defense Command - Technical Center (USASMDC-TC) and the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Energy Laser Enabling and Support Technology"
                                    },
                                    "Description": {
                                        "val": "This effort provides the underlying data for future high energy laser weapons to effectively engage an array of threats. The data includes prioritized aim points on each threat as well as time to defeat the threats for each aim point. This activity includes the full spectrum of target lethality investigations and engagement of flying targets in relevant scenarios. This activity is primarily executed at the Solid State Laser Testbed (SSLT) facility at White Sands Missile Range, New Mexico. This effort also focuses on developing core Army expertise through laser and beam control technology assessments, applied research and other technical core competencies.This effort focuses on developing in-house expertise in Adaptive Optics (AO), Beam Control, laser diodes, target illuminators lasers and beacon illuminator lasers, laser diagnostics and new tracking algorithms.  These technologies can be integrated into the High Energy Laser Tactical Vehicle Demonstrator (HEL TVD), and the Multi Mission High Energy Laser (MMHEL), or future laser systems to locate, identify and engage critical targets. Results of this research may reduce the SWaP requirements, and the efficacy of laser weapons systems on Army platforms in the future."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.774"
                                            },
                                            "Text": {
                                                "val": "Will complete an assessment of rocket, artillery and mortar (RAM) fuzes vulnerability to laser weapons; Will complete vulnerability modules and lethality database inputs for Groups 1, 2, and 3 Unmanned Aerial Systems. Will continue development of lethality data base input for RAM threats supporting HEL TVD and MMHEL. Will begin data collection on vulnerability of manned fixed- and rotary-wing aircraft components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.032"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.032"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments to inform fixed wing threat assessment and develop defeat methodologies; will begin preliminary assessment of high energy laser effectiveness against Anti-Tank Guided Missile threats; will continue development of lethality database for RAM threats supporting the Maneuver - Short Range Air Defense (M-SHORAD) mission.\nContinue to evaluate and conduct experiments with advanced AO algorithms for deep turbulence atmospheric conditions.  Integrate the Enhanced Tracking Sensor for Acquisition Tracking onto the MBC SIL for dynamic experiments.  Complete Candidate Sensor Technology analysis for HEL Fine Tracking and Aimpoint designation in a pulsed illuminator and gated sensor configuration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Resources realigned in FY21 to increase focus on laser defeat techniques against Anti-Tank Guided Missile threats."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Enabling Technologies for Tactical Directed Energy Weapons"
                                    },
                                    "Description": {
                                        "val": "Research novel solid-state laser concepts, architectures, and components in support of the Army?s HEL weapons strategy; exploit breakthroughs in laser technology, develop and employ innovative laser gain material, and utilize photonics to meet the stringent weight\/volume requirements for Army platforms, especially to enhance and improve the generation, transmission, and reception of lasers."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.189"
                                            },
                                            "Text": {
                                                "val": "Will investigate advanced ?crystalline core\/crystalline cladding? designs (a.k.a. CCCC = C4) to enable single transverse mode HEL with single fiber laser power scaling potential 10X over the current state of the art; will explore directly diode-cladding pumped Raman fiber laser architectures enabling power scaling out of a single fiber laser for 10X improvement over the current state of the art; and will conduct feasibility experiments of optical-phased arrays to beam steer and condition the phase of laser emissions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.081"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.081"
                                            },
                                            "Text": {
                                                "val": "Will investigate the potential of true-continuous wave fiber laser power scaling with crystalline core\/crystalline cladding fibers; will investigate power scaling potential of directly diode-cladding pumped Raman fiber laser."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Resources realigned in FY21 to increase and accelerate focus on advanced fiber laser technologies."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AD3"
                    },
                    "ProjectTitle": {
                        "val": "Maneuver Air Defense Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "4.2"
                        },
                        "BudgetYearOne": {
                            "val": "13.227"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.227"
                        },
                        "BudgetYearTwo": {
                            "val": "10.264"
                        },
                        "BudgetYearThree": {
                            "val": "2.304"
                        },
                        "BudgetYearFour": {
                            "val": "3.564"
                        },
                        "BudgetYearFive": {
                            "val": "5.825"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "39.384"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) 0602303A Missile Technology\n* Project 214 Missile Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project directly supports Army Modernization Priority Air and Missile Defense capabilities by investigating and developing critical missile technologies and components necessary for an affordable short range air defense interceptor capability to defeat Cruise Missile (CM), Rotary Wing (RW), Tactical \/ Lethal Unmanned Aerial System (UAS), and Fixed Wing (FW) threats.  This effort also designs and develops technologies to provide reduced size weight and power and cost for Maneuver Short Range Air Defense (MSHORAD), Short Range Air Defense (SHORAD), and Lower Tier essential to maintain overmatch against mid-\/far-term threats.\n\nWork in this Project complements PE 0603466A (Air and Missile Defense Advanced Technology) \/ Project AD4 (Maneuver Air Defense Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Maneuver Air Defense Technology"
                                    },
                                    "Description": {
                                        "val": "Investigates and develops critical missile technologies and components necessary for an affordable short range air defense interceptor capability to defeat RW, Tactical \/ Lethal UAS, and FW threats."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.2"
                                            },
                                            "Text": {
                                                "val": "Will conduct MSHORAD trade studies to develop the system concept and derive system level requirements for interceptor sub-systems; will determine the optimum launcher configuration to maximize magazine depth on a maneuver platform; Investigate and develop critical missile technologies and components that support the development of an interceptor capability for the MSHORAD requirement; and evaluate application of common guidance electronic unit and low cost RF seeker. Characterization of threat signatures and develop Hardware In the Loop (HWIL) techniques to emulate them."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.994"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.994"
                                            },
                                            "Text": {
                                                "val": "Will continue development of critical missile technologies for detection and tracking of hovering RW targets; will develop and investigate an active radar seeker with integrated warhead fuzing capabilities through HWIL techniques for emulating hovering RW targets and other large MSHORAD targets in a laboratory environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in funding required to develop, fabricate, integrate and validate technologies in laboratory and HWIL environments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Future Air Defense Missile Enabling Technology"
                                    },
                                    "Description": {
                                        "val": "Designs and develops reduced cost advanced Air Defense missile critical components essential to maintain overmatch against Mid\/Far term Maneuver-Short Range Air Defense threats."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.233"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.233"
                                            },
                                            "Text": {
                                                "val": "Will perform component level trade studies and explore and develop new technologies to address emerging Maneuver-Short Range Air Defense threats and reduce space, weight, power and cost for future Air Defense missile guidance\/maneuverability\/control, aerostructures, and propulsion technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Efforts realigned from Project AD7 (Missile Fire Control Sensors Technology) in this PE and focused on future air defense missile component technologies that are essential to engage and defeat increasingly stressing threats at extended ranges."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AD5"
                    },
                    "ProjectTitle": {
                        "val": "Next Generation Fires Radar Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "9.256"
                        },
                        "BudgetYearOne": {
                            "val": "5.336"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.336"
                        },
                        "BudgetYearTwo": {
                            "val": "5.421"
                        },
                        "BudgetYearThree": {
                            "val": "3.961"
                        },
                        "BudgetYearFour": {
                            "val": "4.005"
                        },
                        "BudgetYearFive": {
                            "val": "4.005"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "31.984"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602303A Missile Technology:\n* Project 214 Missile Technology\nPE 0602120A Sensors and Electronic Survivability\n* Project H16  S3I Technology\nPE 0602705A Electronics and Electronic Devices \n* Project H94 Elect & Electronic Devices"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project directly supports Army Modernization Priority Air and Missile Defense capabilities by investigating and developing advanced radar technologies for insertion into Multi-Mission Army Radar systems. This Project addresses challenges facing simultaneously achieving high linearity and efficiency at high frequencies, accuracy in the underlying high frequency device and circuit models, integration of new material into Silicon complementary metal-oxide-semiconductor (CMOS) processing flows, and electronics reliability that appear as new semiconductor materials are developed and feature sizes shrink.\n\nWork in this Project complements PE 0603466A (Air and Missile Defense Advanced Technology) \/ Project AD6 (Next Generation Fires Radar Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Fire Control Radar Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort develops advanced radar technologies for insertion into Multi- Mission Army Radar systems"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4"
                                            },
                                            "Text": {
                                                "val": "Will further develop Digital Array Radar technologies; will complete the design and development the full array hardware and begin testing with Radio Frequency (RF) characterization, digital beam forming evaluations, and algorithm and scenario development; begin implementation of Future Fires Radar open systems architecture back-end processing; will refine and increase capabilities for target identification and discrimination algorithms utilizing threat flight dynamics and multiple sensors."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease due to realignment to support higher priority Army Science and Technology (S&T) efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Mode Air Defense Radar"
                                    },
                                    "Description": {
                                        "val": "This research supports the technical challenges associated with air defense radar technology. In particular, this effort will analyze current and emerging RF spoofing, RF jamming, and RF signature management technologies to determine their impact on the performance of air defense radars. Electromagnetic modeling, RF measurements, and experiments will be used to identify mitigation techniques for spoofing and jamming, and to identify useful signature management technologies. This will also include research in electronic devices, sub-assembly design, and laboratory experiments to advance the state-of-the-art of air defense radars operating in contested electronic environments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.51"
                                            },
                                            "Text": {
                                                "val": "Will research techniques and algorithms for the calibration of digital phased array radars and create electromagnetic models of performance; and will assure algorithms are compatible with an existing Army open software architecture in support of air defense radar mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.522"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.522"
                                            },
                                            "Text": {
                                                "val": "Will develop algorithms for digital radar on laboratory hardware and assess compatibility with Army digital radar designs and testbeds; will develop and model techniques and algorithms for survivable, cognitive, and distributed radar and quantify implications for radar device technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding update to reflect project lifecycle status."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Antennas and RF Device Components for Advanced Electronic Systems"
                                    },
                                    "Description": {
                                        "val": "This effort designs, characterizes, and validates high performance antennas, microwave components, and software for multifunction radar, RF sensing, and communication and position\/timing systems. Research areas include scanning techniques, broadbanding, beamforming, polarization, platform integration, and affordability. For microwave components, research areas include software defined radios, analog-to-digital conversion rates, bandwidth resolution, bit accuracy, circuit design and affordability."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.746"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate counter-RF jamming algorithms utilizing digital RF hardware; will characterize meta-ferrite antennas for enhanced RF situational awareness; will design and develop antennas, front end technologies, and enabling devices and integrated circuits operating at millimeter wave frequencies (at\/near 5G frequencies) to support directional communications; will mature RF microelectromechanical systems (MEMS) components to enable frequency agile operation of tactical communication and next generation fires radar using reconfigurable impedance matching between disparate RF components and antenna tuning; and will explore and develop machine learning techniques and algorithms for RF modulation recognition and target classification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.814"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.814"
                                            },
                                            "Text": {
                                                "val": "Will validate additively manufactured RF antenna arrays for scalability; will validate efficient, multi-band, and survivable high power components and research ultra-wide bandgap semiconductor device technology for meeting power efficiency challenges."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding update to reflect project lifecycle status."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AD7"
                    },
                    "ProjectTitle": {
                        "val": "Missile Fire Control Sensors Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "1.608"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.608"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) 0602303  Missile Technology:\n* Project 214 Missile Technology\n\nIn FY21 this Project is realigned to:\nPE 06702150A Air and Missile Defense Technology:\n* Project AD3 Maneuver Air Defense Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project directly supports Army Modernization Priority Air and Missile Defense capabilities by designing and developing technologies for advancements in next generation fire control sensor technology and target signature modeling.\n\nWork in this Project complements PE 0603466A (Air and Missile Defense Advanced Technology) \/ Project AD6 (Next Generation Fires Radar Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Missile Fire Control Sensors Technology"
                                    },
                                    "Description": {
                                        "val": "Design and develop technologies for advancements in next generation fire control sensor technology and target signature modeling."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.608"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop modulated waveforms for next generation radars and seekers in order to improve target resolution and discrimination for challenging air defense scenarios; will develop engagement planning algorithms to include target identification and discrimination based on emerging threat information, advanced capabilities of emerging sensors, and future interceptor capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY21 efforts realigned to PE 0602150A (Air and Missile Defense Technology)\/Project AD3 (Maneuver Air Defense Technology)"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AD9"
                    },
                    "ProjectTitle": {
                        "val": "Close Combat High Energy Laser Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "7.357"
                        },
                        "BudgetYearOne": {
                            "val": "8.696"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.696"
                        },
                        "BudgetYearTwo": {
                            "val": "20.354"
                        },
                        "BudgetYearThree": {
                            "val": "21.009"
                        },
                        "BudgetYearFour": {
                            "val": "21.244"
                        },
                        "BudgetYearFive": {
                            "val": "21.457"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "100.117"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) 0062307A Advanced Weapons Technology\n* Project 042 High Energy Laser Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops technologies for compact, highly efficient lasers, and compact beam control for close-combat platforms. This project investigates\nand develops advanced technologies for High Energy Laser (HEL) weapon systems to enable more efficient laser systems with greater power output, which in-turn\nenables laser weapons on smaller vehicles for additional missions. This includes technologies to support development of alternate laser sources, precision optical\npointing and tracking components, adaptive optics to overcome laser degradation due to atmospheric effects, more compact and lighter weight energy generation and\nstorage devices, and more efficient thermal management systems to remove excess heat.\n\nWork in this Project complements PE 0603466A (Air and Missile Defense Advanced Technology) \/ Project AE1 (Close Combat High Energy Laser Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, and the Army Modernization Strategy, and\nsupports the Army's future capability opportunities for leap-ahead technology for directed energy.\n\nWork is performed by the United States (US) Army Rapid Capabilities and Critical Technologies Office (RCCTO)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Close Combat High Energy Laser Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops laser and beam control technologies with extremely low size, weight, and power (SWaP) requirements enabling high energy lasers in small, agile close combat platforms. Extremely low SWaP laser systems will expand the laser weapons mission set. Reduction in SWaP also provides for higher power systems on the large tactical vehicles that enable countering the current threat set at longer ranges as well as laser-hardened threats."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.117"
                                            },
                                            "Text": {
                                                "val": "Will continue developing and validating laser and beam control technologies with extremely low SWaP to integrate on a risk- reduction platform. Will begin defining risk-reduction system for data collection and validation of technology suitability for Close-Combat Platform risk reduction effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.696"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.696"
                                            },
                                            "Text": {
                                                "val": "Will continue developing and validating laser and beam control technologies with extremely low SWaP to integrate on a risk reduction platform. Will conduct modeling & simulation to inform experimentation and conduct experimentation with instrumented risk-reduction platform for collecting and analyzing data for validation of technology and assessing its suitability for a Close Combat Platform risk reduction effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased cost in FY21 to refine models for CCHEL mission set and completes platform instrumentation and data collection tools that enables the risk reduction demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.24"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AE2"
                    },
                    "ProjectTitle": {
                        "val": "Unconventional Countermeasures-Survivability Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "5.756"
                        },
                        "BudgetYearOne": {
                            "val": "6.588"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.588"
                        },
                        "BudgetYearTwo": {
                            "val": "3.976"
                        },
                        "BudgetYearThree": {
                            "val": "2.16"
                        },
                        "BudgetYearFour": {
                            "val": "2.18"
                        },
                        "BudgetYearFive": {
                            "val": "2.18"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "22.840"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602784A Military Engineering Technology:\n* Project T40 Mob\/Wpns Eff Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops technologies to deter tactical surveillance and targeting by adversarial area denial systems and munitions. The Project investigates methods to increase survivability of critical assets against precision-guided near-peer advanced weapons threats, investigates and develops tonedown methods for signature management, and computationally develops novel countermeasures. This Project also develops a suite of high-fidelity, physics-based modeling and simulation tools for the design and development of unconventional countermeasures and survivability enhancers applicable to a wide range of operating environments.\n\nWork in this Project complements PE 0603466A (Air and Missile Defense Advanced Technology)\/Project AE3 (Unconventional Countermeasures-Survivability Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Engineer Research and Development Center (ERDC) and coordinated with the Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Development of Unconventional Countermeasures for Enhanced Survivability (DeUCES)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops countermeasures to defeat near-peer advanced weapons through computational modeling and enhanced tonedown measures."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.168"
                                            },
                                            "Text": {
                                                "val": "Complete experiments to develop novel tonedown techniques for critical fixed and semi-fixed assets to include novel application of commercial off the shelf materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.23"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.23"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments to investigate techniques and materials for hyperspectral and tone down response and validate their use on critical assets as either integrated systems or temporary coatings for various environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased resources required in FY21 as this Science and Technology (S&T) Project builds toward transition from Applied Research to Advanced Technology Development portion of the effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Model-Based Assessment of Sensors and Countermeasures"
                                    },
                                    "Description": {
                                        "val": "This effort develops a suite of high-fidelity, physics-based modeling and simulation tools for the design and development of unconventional countermeasures with electro-optical\/infrared (EO\/IR) sensors for a wide range of operating environments; develops tools for threat detection and object identification using machine learning tools for EO\/IR sensors; and builds superior target\/threat recognition algorithms."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.515"
                                            },
                                            "Text": {
                                                "val": "Develop sensor models for EO\/IR sensors and generate imagery for machine learning tools; will develop and optimize an initial unconventional countermeasure capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.358"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.358"
                                            },
                                            "Text": {
                                                "val": "Will develop and investigate computational environments for sensor-algorithm performance in a range of simulated environments. These efforts will couple large scale physics based sensor models with high resolution environmental test beds to develop medium-to short-range sensor performance models for guided weapons."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects the planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.073"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AE4"
                    },
                    "ProjectTitle": {
                        "val": "Collaborative ISR Sensors Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "3.517"
                        },
                        "BudgetYearOne": {
                            "val": "2.989"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.989"
                        },
                        "BudgetYearTwo": {
                            "val": "3.316"
                        },
                        "BudgetYearThree": {
                            "val": "3.394"
                        },
                        "BudgetYearFour": {
                            "val": "2.198"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.414"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602270A Electronic Warfare Technology\n* Project 906 Tactical Electronic Warfare Applied Research"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project directly supports Army Modernization Priority Air and Missile Defense capabilities by designing and developing Intelligence, Surveillance, Reconnaissance (ISR) sensors with extended range threat detection and enhanced survivability by cooperative sensing while on-the-move.\n\nWork in this Project complements PE 0603466A Air and Missile Defense Advanced Technology \/ Project AD6 Next Generation Fires Radar Advanced Technology.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Collaborative ISR Sensors Technology"
                                    },
                                    "Description": {
                                        "val": "Design and develop ISR sensors with extended range threat detection and enhanced survivability by cooperative sensing while on-the-move."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.357"
                                            },
                                            "Text": {
                                                "val": "Will investigate techniques and waveforms that enable Multi-Domain Battlefield (Land\/Air) operations between platforms with non-traditional Radar sensing. Will research the best technology enablers that provide a Multi- Domain capability while identifying novel techniques to exploit those enablers. Investigate methods that improve platform and sensor survivability against emerging future threats in a spectrally complex environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.989"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.989"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop techniques and waveforms for clutter suppression and synchronization between platforms with non-traditional Radar sensing; will develop algorithms to  perform data collections to validate test cases; will  research non-traditional Radar sensing; and will continue to research best technology enablers for Multi-Domain Operations capability"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects the planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.16"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BN6"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Weapons Components (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "45"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "45.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional Interest Item funding provided for Advanced Weapons Components."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding provided for Advanced Weapon Components.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Sustainable Energy Materials and Manufacturing"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "12"
                                        },
                                        "Text": {
                                            "val": "Sustainable Energy Materials and Manufacturing"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High-Energy Laser Hardware in the Loop"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "High-Energy Laser Hardware in the Loop"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "COE in High-Energy Laser and Optical Technology"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "COE in High-Energy Laser and Optical Technology"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cybersecurity and Supply Chain Risk Management"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Cybersecurity and Supply Chain Risk Management"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}