{
    "id": "2021-Navy-PB-1319-MJBOOK-0-0-744c7ee94c2cc798fbfd935e35baade9caa8a86b67e6f22ecedd75220314848f-8",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602271N"
        },
        "ProgramElementTitle": {
            "val": "Electromagnetic Systems Applied Research"
        },
        "R1LineNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "74.934"
            },
            "CurrentYear": {
                "val": "88.497"
            },
            "BudgetYearOne": {
                "val": "84.994"
            },
            "BudgetYearOneBase": {
                "val": "84.994"
            },
            "BudgetYearTwo": {
                "val": "88.642"
            },
            "BudgetYearThree": {
                "val": "93.377"
            },
            "BudgetYearFour": {
                "val": "95.111"
            },
            "BudgetYearFive": {
                "val": "97.013"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Freedom of maneuver on a global scale for U.S. naval forces depends upon assured access to the electromagnetic spectrum and the ability to deny adversary exploitation.  Electromagnetic technologies must fluidly deliver communication, surveillance electronic warfare and digital integration to understand, shape and defend the battlespace. The Electromagnetic Systems Applied Research Program addresses technology needs associated with Naval platforms for new capabilities in Electro-Optic and Infrared (EO\/IR) Sensors, Surveillance, Electronic Warfare, Navigation, Solid State Electronics, Vacuum Electronics Power Amplifiers, and Nanoelectronics. The program supports development of technologies to enable capabilities in Missile Defense, Directed Energy, Platform Protection, Time Critical Strike, and Information Distribution. Activities and efforts within this Program have attributes that focus on enhancing the affordability of warfighting systems. \n\nToday's Sailors and Marines are enabled by Naval Science and Technology (S&T). Since 1946, the Office of Naval Research (ONR) has fostered scientific research related to the maintenance of maritime superiority and national defense. ONR manages the Department of the Navy's (DON) portfolio of naval Basic and Applied research, and Advanced Technology Development investments to ensure naval forces can effectively deter conflict, but when called upon, fight, win and come home safe. Current investments hedge against uncertainty, providing solutions to commanders today, and options for the future. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy through research priorities set by the Chief of Naval Research, coordinated across the Naval Research Enterprise (NRE), and outlined in the Naval R&D Framework. \n\nThis Program Element (PE) funds Applied Research, which is the systematic study to understand the means to meet a recognized and specific need. Most of the work in this PE can be classified between Technology Readiness Level (TRL) 2 (technology concept and\/or application formulation) and TRL 4 (component and\/or breadboard validation in laboratory environments).\n\nDue to the number of efforts in this Program Element (PE), the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "76.497"
                },
                "CurrentYear": {
                    "val": "83.497"
                },
                "BudgetYearOne": {
                    "val": "83.259"
                },
                "BudgetYearOneBase": {
                    "val": "83.259"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "74.934"
                },
                "CurrentYear": {
                    "val": "88.497"
                },
                "BudgetYearOne": {
                    "val": "84.994"
                },
                "BudgetYearOneBase": {
                    "val": "84.994"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.563"
                },
                "CurrentYear": {
                    "val": "5.000"
                },
                "BudgetYearOne": {
                    "val": "1.735"
                },
                "BudgetYearOneBase": {
                    "val": "1.735"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "5.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.563"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.735"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.735"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The $1.735 program increase in FY 2021 supports increased investment in specialized signal processing engines to leverage machine learning algorithms for improved Electronic Support (ES) and Electronic Attack (EA) capabilities.\n\nTechnical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Electromagnetic Systems Applied Research"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "74.934"
                        },
                        "CurrentYear": {
                            "val": "83.497"
                        },
                        "BudgetYearOne": {
                            "val": "84.994"
                        },
                        "BudgetYearOneBase": {
                            "val": "84.994"
                        },
                        "BudgetYearTwo": {
                            "val": "88.642"
                        },
                        "BudgetYearThree": {
                            "val": "93.377"
                        },
                        "BudgetYearFour": {
                            "val": "95.111"
                        },
                        "BudgetYearFive": {
                            "val": "97.013"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Freedom of maneuver on a global scale for U.S. naval forces depends upon assured access to the electromagnetic spectrum and the ability to deny adversary exploitation.  Electromagnetic technologies must fluidly deliver communication, surveillance electronic warfare and digital integration to understand, shape and defend the battlespace. This project addresses technology opportunities associated with Naval platforms for new capabilities in Electro-Optic and Infrared (EO\/IR) Sensors, Surveillance, Electronic Warfare, Navigation, Solid State Electronics, Vacuum Electronics Power Amplifiers, and Nanoelectronics. The project supports development of technologies to enable capabilities in Missile Defense, Directed Energy, Platform Protection, Time Critical Strike, and Information Distribution. This project directly supports the Department of Defense Joint Warfighter Plan and the Defense Technology Area Plans. Activities and efforts within this program have attributes that focus on enhancing the affordability of warfighting systems. The program also provides for technology efforts to maintain proactive connectivity and collaboration between Department Of the Navy (DON) Science and Technology (S&T) and Joint, Navy, and Marine Corps commands worldwide. Due to the number of efforts in this Program Element (PE), the programs described herein are representative of the work included in this PE."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Electronic Warfare Technology"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop technologies that enable the development of affordable, effective and robust Electronic Warfare (EW) systems across the entire Electromagnetic Spectrum (EMS) that will increase the operational effectiveness and survivability of U.S. Naval units. Technology development is focused on Distributed Electronic Warfare in support of Distributed Maritime Operations. Emphasis is placed on passive sensors and active and passive Countermeasure (CM) systems that exploit and counter a broad range of electromagnetic threats. The focus is on maintaining near perfect, real-time knowledge of the enemy; countering the threat of missiles against deployed Naval forces; precision identification and location of threat emitters; and development of technologies that have broad application across multiple disciplines within the EW mission area. This activity also includes developments to protect these technologies from external interference, and modeling and simulation required to support the development of these technologies. \n\nThe current objectives are:\n- Electronic Warfare (EW) Radio Frequency (RF) Technology: Develop and demonstrate technologies in the RF spectrum (covering frequencies from kilohertz to terahertz) that include developments in detection, signal processing and passive\/active techniques for wideband Electronic Attack (EA), Electronic Protection (EP) and the Electronic Support (ES) mission areas.\n- EW Electro-Optic\/Infrared (EO\/IR) Technology: Develop and demonstrate counter EO\/IR technologies extending from the ultraviolet to the far infrared spectral bands. This includes advances in multispectral sensors, multiband sources, beam forming\/steering, and signal processing and transmission.\n- EW Integrated and Networked Technology: Develop and demonstrate technologies that will enable an increased situational awareness and response across the electromagnetic spectrum (EMS) with broad spatial coverage using all available EW assets to provide coordinated, adaptive and networked EW sensing, protection and attack.\n- Advanced EW Enabling Technologies: Develop classified advanced electronic warfare technology in support of current and predicted capability requirements emphasizing distributive effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "37.706"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "43.534"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Reinvigorate investments in fundamental component technologies that drive performance of electronic warfare system across the range of functions from sensor, signal processing, decision and collaboration software and response. Develop advanced antenna solutions to enable Simultaneous Transmit And Receive (STAR) with high directivity. Innovate new Radio-Frequency (RF) amplifier technology to deliver high power, broadband devices that extend into the millimeter-Wave in small form factors. Leverage emerging compute architectures and advanced algorithms to provide signal processing solutions for operating coherent, distributed arrays in complex electromagnetic environments. Develop deep learning methods for improved electronic warfare functions in the signal processing chain. Apply machine learning techniques to surface self-defense systems. Develop counter-measure solutions to optical sensors including non-mechanical beam steering and laser technologies to increase the effectiveness of Electro-Optic\/Infrared (EO\/IR) countermeasures in addition to passive obscurant technology. Improve modeling of sensor systems to provide integrated capability across optical and RF domain. Develop test technology for affordable fielding of cognitive, collaborative Electronic Warfare (EW) effector systems.\n\nElectromagnetic Warfare: \nThe RF domain research includes discovery of communications networks and mechanisms for their disruption and defeat.  Selected examples of research include discovery of parameters to identify functional characteristics of emerging radar system, advanced algorithms to specifically identify modern radar sources, using micro-jammers in a phased array configuration, exploiting optical emission characteristics, and development of a novel deep reinforcement learning and Q-network software framework to develop and refine control policies for participating offensive and defensive agents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.634"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.634"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronic Warfare (EW): \n- Extend research for federated, coordinated, and integrated EW systems in the areas of Electronic Surveillance (ES); decoys and countermeasures\nagainst weapon tracking and guidance systems; electronic attack (EA) against adversary command, control,\ncommunications, computers, intelligence, surveillance, reconnaissance and targeting (C4ISRT); electronic protection (EP) of our own weapons and C4ISR from intentional and unintentional interference; and force-level kinetic\/non-kinetic\ncoordination and resource optimization. \n- Complete component fabrication, assembly, testing & demonstration of compact broadband & high power RF transmitter\narrays and compact IR-UV laser sources for size, weight, and power (SWaP) constrained unmanned systems that began\nin FY19. Additionally, these plans include completing fabrication, testing & demonstration of new compute processing\narchitectures specifically designed to leverage algorithms & deep learning techniques for Electronic Surveillance (ES)\napplications.\n- RF domain research will initiate development and implementation of algorithms and techniques into the new processing\narchitectures previously developed for EW applications.\n- Develop tactics against modern and emerging radar sources for improving Naval mission effectiveness. This research\ndomain will initiate development and techniques coordination between RF and EO\/IR transmitters and receivers for single\nand distributed platforms utilizing compact broadband & high power RF transmit arrays and compact IR-UV laser sources\ndeveloped previously.\n \nElectromagnetic Warfare:\nThe research being conducted by 22 projects is very diverse and includes efforts across a broad spectrum of Radio Frequency (RF) and Electro-Optic\/Infrared (EO\/IR) technologies that cover the detection of energy in the environment to the formulation of active and passive engagement techniques. The primary objectives in FY 2021 include researched focused on Detection, Detection and Engagement, and Engagement.\n\nCurrent plans are to focus efforts on:\n- Electromagnetic Warfare Detection focus on: Near-real-time geolocation of stationary (or slowly moving) RF emitters, and in particular, emerging threat radars employing unusual waveforms resulting in accurate geolocation; novel real-time signal processing techniques to dramatically increase the useful information content reported in receiver measurements of radar-band signals providing the warfighter with a low-ambiguity warning of detected; improving the effectiveness of emitter classification of modern radars for several functions including AIS validation increasing Maritime Domain Awareness; and applying recently developed machine learning methods to the problem of functional classification of radar emissions and demonstrate the ability to perform the functional classification in real time to overcome the inadequacy conventional emitter classification methods.  \n- Electromagnetic Warfare Detection and Engagement focuses on: discovering and defeating unknown and adaptive radios by developing algorithms to observe their behavior, analyze their networking protocols, and optimize engagement techniques to interfere with their objectives.\n- Electromagnetic Warfare Engagement include: developing and demonstrating high gain distributed aperture technologies compatible with micro-jammer glide vehicles to increase the effective radiated power of a ground-based micro-jammer constellation to provide sufficient power to radars. Developing and demonstrating an evolvable Electronic Warfare (EW) transceiver design that optimizes cuing receiver processing to increase situational awareness and enable adaptive electronic attack response in complex electromagnetic environments to provide effective processing of emergent complex radar modes."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2020 to FY 2021 reflects the realignment of funds from the Electronic Warfare Technology R2 activity to the Navigation R2 activity for increased investment in Quantum S&T Precision, Navigation, and Timing (PNT) programs in order to meet higher Navy priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EO\/IR Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "The overarching objective is to develop technologies that enable affordable, wide area, persistent surveillance optical architectures. Included are modeling and simulation required to support the development of these technologies. Efforts will also include the development of optical Radio-Frequency (RF) components, infrared technologies including lasers and focal plane arrays using narrow bandgap semiconductors. The current specific objectives are:\n\n- Optically Based Terahertz (THz) and Millimeter Wave (MMW) Distributed Aperture Systems: Develop optically based terahertz (THz) and millimeter wave distributed aperture systems for imaging through clouds, fog, haze and dust on air platforms.\n- Wide Area Optical Architectures: Develop wide area optical architectures for persistent surveillance for severely size constrained airborne applications.\n- Hyperspectral sensors and processing: Develop visible, shortwave Infrared (IR), mid-wave IR, and long-wave IR hyperspectral sensors, along with processing algorithms to detect anomalies and targets.\n- Coherent Laser Radar (LADAR): Develop and improve components for LADAR applications including fiber lasers, coherent focal planes, and advanced processing.\n- Autonomous and Networked sensing: Develop algorithms and processing that supports autonomous sensing for Unmanned Autonomous Vehicles (UAV) platforms and that supports networked sensing over multiple sensors and\/or sensor platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.102"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.141"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied research in optical components, infrared technologies and signal processing for the purpose of affordable, wide area, persistent surveillance and targeting applications in all weather conditions. Specific areas of research include: novel optical architectures for affordable persistent surveillance to support search, detection, classification, identification and targeting functions; development of laser and passive mmW detectors for imaging through degraded visual environments (e.g., clouds, fog, haze and dust); low size, weight, and power hyper-spectral sensors for severely size and power constrained airborne applications; development of automatic algorithms for autonomously detecting and recognizing anomalies and targets using networked sensors and\/or sensor platforms; novel techniques for Electro-Optic\/Infrared (EO\/IR) countermeasures to detect, track and\/or jam sensors.\n\nElectronics: \nCreate and explore new concepts, components, techniques, and subsystems for the generation, and transmission of Ultra-Violet (UV), visible, and infrared radiation to support current and future Navy and DoD needs.\n\nElectromagnetic Warfare: \nWork is ongoing to address the critical deficiency with respect to operations in brownout conditions. Infrared (IR) and terahertz technologies are being modified and integrated with the expectations that combining these two technologies an effective solution can be obtained.  Bistatic radar and imaging technology is being developed to extend surveillance capabilities and passively engage targets. A unique approach permitting rapid active scanning of a battlefield in the IR domain using a non-mechanically scanned mechanism is under development. This technology if successful will eliminate the multiple laser ball systems currently required to accomplish this same requirement at lower Size, Weight and Power (SWAP). Active work is also being focused on developing capabilities for high resolution, wide field of view sensors on modest sized Unmanned Autonomous Systems (UAS) platforms. \n\nMaterials and Chemistry: \nAdvanced fabrication methods to develop micro-retro-reflectors operating in short wavelength Maritime Infrared (IR) systems. This study is directed to develop unique spectral bar codes. Major accomplishments include development of high refractive index glass composition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.559"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.559"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EO\/IR Sensor Technologies:\n-Complete studies of novel optical architectures to support affordable persistent surveillance systems.\n-Complete development of sensitive passive mmW detectors for detection of targets in degraded visual environments (e.g.,\nclouds, fog, haze and dust).\n-Continue work on active imaging laser systems to significantly extend operational range and imaging capabilities in\ndegraded conditions (e.g., dense maritime fog).\n-Continue development of a room-temperature mid-wave infrared (MWIR) detector array that will significantly decrease\nSize, Weight, Power and Cost (SWaP-C) of MWIR imaging devices.\n-Continue to develop novel techniques for Electro-Optic\/Infrared (EO\/IR) countermeasures to detect, track and\/or jam\nsensors.\n-Initiate efforts to develop and test optical architectures to demonstrate simultaneous wide field of view and high resolution\nimaging for search, detection, classification, identification and targeting functions.\n-Initiate development of real-time combat ID algorithms for detecting and tracking simultaneous targets from networked,\nhigh-resolution, wide field of view, and persistent surveillance systems.\n\nElectronics:\nTo develop and explore new concepts, components, techniques, and subsystems for the generation, and transmission of UV, visible, and infrared radiation to support current and future Navy and DoD needs.\n\nCurrent plans are to focus efforts on: \n- Advanced p-type Gallium-Free Superlattice Long Wave Infrared (LWIR) Sensors.\n- Night and Day Maritime Infrared (IR).\n\nElectromagnetic Warfare:\nResearch being conducted by six projects in this area are developing EO\/IR technologies to improve imaging, target identification, threat detection, and engagement capabilities for the war fighter.\n\nCurrent examples of efforts include:\n- New system design and data processing algorithms for small, low-power, high resolution extremely wide FOV IR systems.\n- Ability to detect, track and defeat an imaging threat sensor over a wide field of view using optical phase conjugation to overcome the existing field of view limitations imposed by current spatial light modulator technology.\n- Improvement in resolution without changing the imaging optics by projecting patterns onto the scene then using knowledge of the patterns computationally recover a higher resolution image resulting in improved resolution enabling better intelligence, surveillance, reconnaissance, and targeting."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navigation Technology"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop technologies that enable the development of affordable, effective and robust Position, Navigation and Timing (PNT) capabilities using non-Global Positioning System (GPS) navigation devices, and atomic clocks. This project will increase the operational effectiveness of U.S. Naval units. Emphasis is placed on GPS Anti-Jam (AJ) Technology; Precision Time and Time Transfer Technology; and Non- GPS Navigation Technology (Inertial aviation system, bathymetry, gravity and magnetic navigation). The focus is on the mitigation of GPS electronic threats, the development of atomic clocks that possess unique long-term stability and precision, and the development of compact, low-cost Inertial Navigation Systems (INS).\n\nThe following are non-inclusive examples of plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.110"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.827"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied research in position, navigation and timing. This research aims to develop techniques and technology to provide assured, cost-effective, and mission relevant PNT to the warfighter. Areas of investment included robust GPS, non-GPS navigation aids, and assured timekeeping. Specifically, GPS Anti-Jam Antennas and Receivers for Navy platforms for the purpose of providing precision navigation capabilities in the presence of electronic threats and anti-spoofer\/anti-jam processors for the purpose of providing precision navigation capabilities in the presence of emergent threats; Tactical grade atomic clocks that possess unique long-term stability and precision for the purpose of providing GPS-independent precision time and transferring Coordinated Universal Time (UTC) as maintained at the United States Naval Observatory (USNO) time via alternative electromagnetic links for the purpose of providing GPS-independent precision time; and Inertial navigation systems for the purpose of providing an alternative means of providing precision navigation, a correlation navigation technique using earth maps of high precision, for those Naval platforms which may not have GPS navigation capabilities and\/or loss of GPS signals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.218"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.218"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Navigation Technology:\n-Complete research into radar based shoreline navigation \n-Complete research on ocean current compensation techniques for improved inertial navigation.\n-Continue research on automated celestial navigation for submarine platforms.\n-Continue research on thermal atomic beam inertial capability.\n-Initiate research on next generation atomic clocks.\n-Initiate development of earth magnetic anomaly maps for improved magnetic navigation."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2020 to FY 2021 is due to the realignment of funds from the Electronic Warfare Technology R2 activity to the Navigation R2 activity for increased investment in Quantum S&T Precision, Navigation, and Timing (PNT) programs in order to meet higher Navy priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Solid State Electronics"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop higher performance components and subsystems for all classes of military Radio-Frequency (RF) systems that are based on solid state physics phenomena and are enabled by improved understanding of these phenomena, new circuit design concepts and devices, and improvements in the properties of electronic materials. An important subclass are the Very High Frequency (VHF), Ultra-High Frequency (UHF), Microwave (MW), and Millimeter Wave (MMW) power amplifiers for Navy all-weather radar, surveillance, reconnaissance, electronic attack, communications, and smart weapon systems. Another subclass are the analog and high speed, mixed signal components that connect the electromagnetic signal environment into and out of digitally realized, specific function systems. These improved components are based on both Silicon (Si) and compound semiconductors (especially the wide bandgap materials and narrow bandgap materials), low and high temperature superconductors, novel nanometer scale structures and materials. Components addressed by this activity emphasize the MMW and Submillimeter Wave (SMMW) regions with an increasing emphasis on devices capable of operating in the range from 50 Gigahertz (GHz) to 10 Terahertz (THz). The functionality of the technology developed cannot be obtained through Commercial-Off- The-Shelf (COTS) as a result of the simultaneous requirements placed on power, frequency, linearity, operational and instantaneous bandwidth, weight, and size. Effort will involve understanding the properties of engineered semiconductors as they apply to quantum information science and technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.620"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.520"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronics: \nOngoing development of electronic materials, devices, components, and circuits in the frequency range of ~ 1 Megahertz to ~ 10 Terahertz that provide system performance edge compared to current state of the art solid state electronics to ensure supremacy of future radar, Electronic Warfare (EW), communications, sensor, and intelligence systems. Continue ongoing research efforts in the areas of solid state transistors and devices for high frequency analog and digital operation; high efficiency, highly linear amplifiers for microwave, millimeter-wave, low-noise, and power applications; superconducting and other technologies which are designed to deliver software defined, wide band, many simultaneous signal functionality over a wide range of frequencies, in increasingly field-ready packaging and demonstrate the ability of these components to deliver superior functionality in conventional system contexts, including, but not limited to, Satellite Communications (SATCOM), Surveillance EW, Signal Intelligence (SIGINT), and communications; electronics and photonics technology that provides for the control, reception, transmission and processing of signals. Explore and develop new materials, devices, components, and circuits that apply quantum phenomena of entanglement, superposition and\/or wave function correlation for performance not achievable by classical methods."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.841"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.841"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Solid State Electronics:\n- Continue ongoing development of electronic materials, devices, components, and circuits in the frequency range of\n~ 1 Megahertz to ~ 10 Terahertz that provide system performance edge compared to current state of the art solid state\nelectronics to ensure supremacy of future radar, Electronic Warfare (EW), communications, sensor, and intelligence\nsystems.\n- Continue ongoing research efforts in the areas of solid state transistors and devices for high frequency analog and digital\noperation; high efficiency, highly linear amplifiers for microwave, millimeter-wave, low-noise, and power applications;\nsuperconducting and other technologies which are prototyped to demonstrate the ability of these components to deliver\nsuperior functionality in conventional system contexts, including, but not limited to, Satellite Communications (SATCOM),\nSurveillance Electronic Warfare (EW), Signal Intelligence (SIGINT), and communications; electronics and photonics\ntechnology that provides for the control, reception, transmission and processing of signals.\n- Leading efforts will include the development and transition of nitrogen-polar based HEMT technology for advanced\nhighly linear receivers and efficient transmitters.\n- Explore and develop new materials, devices, components, and circuits that apply quantum phenomena of entanglement,\nsuperposition and\/or wave function correlation for performance not achievable by classical methods.\n- Investigate integrated circuit technologies in conventional superconductors and Gallium Nitride as platforms for quantum-based functional components.\n\nElectronics:\nCurrent plans are to focus efforts on:\n- AlN Tunneling Hot Electron Transfer Amplifier for MMW Power; Phase Change Material RF Components.\n- Autonomous-Reconfigurable RF and mm-Wave Components.\n- Memristive Neuromorphic Computing Elements.\n- Rapid RF IC Prototyping and Manufacture via Micro-assembly.\n- Neural Red-Out Integrated Circuits.\n- ScAlN Based High Power Density MM Wave Transistors."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2020 to FY 2021 is due to a realignment of funds from the Solid State Electronics R2 activity to the Surveillance Technology R2 activity for an increased investment in Electromagnetic Maneuver Warfare (EMW) and the balancing of Naval priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Surveillance Technology"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop advanced sensor and sensor processing systems for continuous, high volume, theater-wide air and surface surveillance, battle group surveillance, real time reconnaissance and ship defense. Major technology goals include long-range target detection and discrimination, Target Identification (ID) and fire control quality target tracking in adverse weather, background clutter and electronic countermeasure environments and includes modeling and simulation required to support the development of these technologies. \n\nThe current specific objectives are:\n- Radar Architectures, Sensors, and Software which Address Ballistic Missile and Littoral Requirement Shortfalls: Develop radar architectures, sensors, and software which address Ballistic Missile and Littoral requirement shortfalls including: sensitivity; clutter rejection; and flexible energy management. \n- Algorithms, Sensor Hardware, and Signal Processing Techniques for Automated Radar Based Contact Mensuration and Feature Extraction: Develop algorithms, sensor hardware, and signal processing techniques for automated radar based contact mensuration and feature extraction in support of asymmetric threat classification and persistent surveillance and to address naval radar performance shortfalls caused by: man-made jamming and Electronic Counter Measures (ECM), unfavorable maritime conditions, and atmospheric and ionosphere propagation effects. \n- Software and Hardware for a Multi-Platform, Multi-Sensor Surveillance System: Develop software, and hardware for a multi-platform, multi-sensor surveillance system for extended situational awareness of the battlespace. \n- Small Unmanned Autonomous Vehicles (UAV) Collision Avoidance\/Autonomy Technology: Develop small UAV collision avoidance\/autonomy technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.030"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.085"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare: \nEfforts in this area are expanding the surveillance of adversary platforms by developing advanced signal processing techniques to bistatically detect surface vessels by sensing reflected ubiquitous transmissions and for the detection and discrimination of small Unmanned Autonomous Systems (UAS) in a clutter filled environment. Additionally, technology development to enable full spectrum battlespace awareness through an ultra-wideband aperture for simultaneously 360 degree beamforming and low-profile ultra-low cross-polarization ultra-wide-band apertures to provide resilient electronic protection for Naval platforms. Conduct applied research in sensors, networking and communication connectivity for the purpose of developing an affordable and fully automated network of time-coordinated mono-static, bi-static and passive surveillance sensors providing real-time tracking, identification, and engagement information with persistent wide area awareness. Specifics Surveillance Technology research objectives include: Radar - research into antenna apertures, electronics, and signal processing continue to provide enhanced capability to detect, track, and automatically identify targets and threats; Signal Intelligence - the use of interferometric and sophisticated signal processing algorithms enable the detection, geolocation, tracking, and identification of targets; Network Sensing - research areas include sensor data fusion, multi-hypothesis decision making, multi-target tracking, and methods for handling and fusing disparate and intermittent data sources; and Electronic Protection - develop methods to mitigate Electronic Attack (EA) and Electromagnetic Interference (EMI) to RF sensors and networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.770"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.770"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Surveillance Technology:\n- Continue technology development to enable full spectrum battlespace awareness through an ultra-wideband aperture for\nsimultaneously 360-degree beamforming and low-profile ultra-low cross-polarization ultra-wide-band apertures to provide\nresilient electronic protection for Naval platforms.\n- Continue research in sensors, networking and communication connectivity for the purpose of developing an affordable and fully automated network of collaborative time-coordinated mono-static and Multi-Input Multi-Output (MIMO), surveillance sensors providing real-time tracking, identification, targeting and engagement information with persistent wide area awareness.\n- Continue efforts to develop affordable and scalable advanced antenna apertures\n- Continue efforts to develop electronics and signal processing to enable Radio Frequency (RF) agility and waveform diversity to provide enhanced capability to find, fix, track, target, and assess targets and threats as well as provide automatic target identification.\n- Continue research in the use of interferometric, polarimetric, RF agility, and sophisticated signal processing algorithms\nto enable the detection, geolocation, tracking, and identification of targets in harsh natural and man-made clutter and\ninterference.\n- Continue research to enable sensor RF convergence, surveillance allocations, data fusion, multi-hypothesis decision\nmaking, multi-target tracking, and methods for handling and fusing disparate and intermittent data sources.\nContinue efforts to develop methods to mitigate Electronic Attack (EA) and Electromagnetic Interference (EMI) to RF\nsensors and networks.\n- Initiate experimentation with fixed and mobile digital array radars to test and validate MIMO capabilities to provide\nimproved detection, tracking, targeting, electronic protection and survivability.\n\nElectromagnetic Warfare:\nEight projects are conducting research efforts in this area to expand the surveillance and detection of adversary and own force platforms in the environment by developing advanced sensor and sensor processing technologies to increase Maritime Domain Awareness.\n\nCurrent plans are to focus efforts on:\n- Radar techniques for detection and identification of small Unmanned Autonomous Vehicles (UAV) and to develop classification and identification techniques for addressing evolving DHS\/USMC requirements for assessing this type of threat in tactical environments.\n- Validate algorithms using innovative concepts from discrete mathematics to accurately predict ship radar cross section (RCS) so as better assess platform vulnerability.\n- Innovative target detection and clutter suppression algorithms for ultra-high frequency SAR that exploits fluctuation and motion within the scene to provide wide-area, automated detection of small targets at long ranges."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2020 to FY 2021 reflects an alignment of funds from the Solid State Electronics R2 activity to the Surveillance Technology R2 activity for an increased investment in Electromagnetic Maneuver Warfare (EMW) to meet Naval priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vacuum Electronics Power Amplifiers"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop Millimeter Wave (MMW) and sub-MMW power amplifiers for use in Naval all-weather radar, surveillance, reconnaissance, electronic attack, and communications systems. The technology developed cannot, for the most part, be obtained through Commercial Off The Shelf (COTS) as a result of the simultaneous requirements placed on power, frequency, bandwidth, weight, and size. Responding to strong interests from the various user communities, efforts are focused on the development of technologies for high-data-rate communications, electronic warfare and high-power radar applications at Millimeter Wave (MMW) and upper-MMW regime. The emphasis is placed on achieving high power at high frequency in a compact form factor. Technologies include utilization of spatially distributed electron beams in amplifiers, such as sheet electron beams and multiple-beams, and creation of simulation based design methodologies based on physics-based and geometry driven design codes.\n\nThe current specific objectives are:\n- High Power Millimeter and Upper Millimeter Wave Amplifiers: Develop science and technology for high power millimeter and upper millimeter wave amplifiers including high current density diamond cathodes, sheet and multiple electron beam formation and mode suppression techniques in overmoded structures.\n- Lithographic Fabrication Techniques: Develop lithographic fabrication techniques for upper-millimeter wave amplifiers.\n- Accurate and Computationally Effective Device-Specific Multi-Dimensional Models for Electron Beams: Develop accurate and computationally effective device-specific multi-dimensional models for electron beam generation, large-signal and stability analysis to simulate device performance and improve the device characteristics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.366"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.390"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronics:  \nExploratory and develop electron beam physics, beam-wave interaction structures, microfabrication techniques, RF materials, and physics-based modeling to produce designs and prototypes of compact, efficient, broadband, linear, high power devices operating at mmW & sub-mmW frequencies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.972"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.972"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronics:\nThe overarching objective of this activity is to develop Millimeter Wave (MMW) and sub-MMW power amplifiers for use in Naval all-weather radar, surveillance, reconnaissance, electronic attack, and communications systems. The technology developed cannot, for the most part, be obtained through Commercial Off The Shelf (COTS) as a result of the simultaneous requirements placed on power, frequency, bandwidth, weight, and size.  Responding to strong interests from the various user communities, efforts are focused on the development of technologies for high-data-rate communications, electronic warfare and high-power radar applications at MMW and upper-MMW regime. Specifically, this area explores and develops electron beam physics, beam-wave interaction structures, microfabrication techniques, Radio Frequency (RF) materials, and physics-based modeling to produce designs and prototypes of compact, efficient, broadband, linear, high power devices operating at Millimeter Wave (MMW) & sub-MMW frequencies.  The emphasis is placed on achieving high power at high frequency in a compact form factor. Technologies include utilization of spatially distributed electron beams in amplifiers, such as sheet electron beams and multiple-beams, and creation of simulation based design methodologies based on physics-based and geometry driven design codes.\n\nCurrent plans are to focus efforts on:\n- Monolithic, Microfabricated Traveling Wave Amplifier Arrays.\n- Electron Focusing Heterostructures for Compact High-Power MM Wave Amplifiers.\n- Multiple Electron Beam Architecture for Upper-MMW Power Amplifiers."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "5.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Electromagnetic systems applied research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Electromagnetic systems applied research"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}