{
    "id": "2021-Navy-PB-1319-JBOOK-29075b3c2af92ab5fcca1096cf65ecac9cc771240d227e79d45bc59626cdea42-9",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602435N"
        },
        "ProgramElementTitle": {
            "val": "Ocean Wrfghtg Env Applied Res"
        },
        "R1LineNumber": {
            "val": "10"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "87.715"
            },
            "CurrentYear": {
                "val": "82.582"
            },
            "BudgetYearOne": {
                "val": "63.392"
            },
            "BudgetYearOneBase": {
                "val": "63.392"
            },
            "BudgetYearTwo": {
                "val": "69.358"
            },
            "BudgetYearThree": {
                "val": "75.374"
            },
            "BudgetYearFour": {
                "val": "76.389"
            },
            "BudgetYearFive": {
                "val": "77.917"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Assuring access to the global maritime domain is ensured by technologies that reliably and accurately sense and predict the ocean environment. Coordinated distributed maritime operations is only possible when timely, actionable information is delivered to commanders. This program element (PE) addresses applied research to develop and exploit tactical understanding of the ocean environment to maintain U.S. maritime superiority and ensure national security. Research performed in this PE transforms basic oceanographic, geologic, acoustic, optical and chemical research into predictive models and technologies that provide new or enhanced warfare capabilities for the Battlespace Environment (BSE). The objectives of this program are met through direct observation of the ocean environment by shipboard, unmanned vehicle, drifting, profiling and remote sensing modalities, among others; assimilation of these observations into predictive environmental models; and provision of critical environmental knowledge to tactical decision aids.\n\nToday's Sailors and Marines are enabled by naval Science and Technology (S&T). Since 1946, the Office of Naval Research (ONR) has fostered scientific research related to the maintenance of maritime superiority and national defense.  ONR manages the Department of the Navy's (DON) portfolio of naval Basic and Applied research, and Advanced Technology Development investments to ensure naval forces can effectively deter conflict, but when called upon, fight, win and come home safe. Current investments hedge against uncertainty, providing solutions to commanders today, and options for the future. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy through research priorities set by the Chief of Naval Research, coordinated across the Naval Research Enterprise (NRE), and outlined in the Naval R&D Framework.   \n\nThis Program Element (PE) funds Applied Research, which is the systematic study to understand the means to meet a recognized and specific need. Most of the work in this PE can be classified between Technology Readiness Level (TRL) 2 (technology concept and\/or application formulation) and TRL 4 (component and\/or breadboard validation in laboratory environments)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "89.998"
                },
                "CurrentYear": {
                    "val": "63.894"
                },
                "BudgetYearOne": {
                    "val": "64.143"
                },
                "BudgetYearOneBase": {
                    "val": "64.143"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "87.715"
                },
                "CurrentYear": {
                    "val": "82.582"
                },
                "BudgetYearOne": {
                    "val": "63.392"
                },
                "BudgetYearOneBase": {
                    "val": "63.392"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.283"
                },
                "CurrentYear": {
                    "val": "18.688"
                },
                "BudgetYearOne": {
                    "val": "-0.751"
                },
                "BudgetYearOneBase": {
                    "val": "-0.751"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-3.812"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "22.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.283"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.751"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.751"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Schedule:  Not applicable.\n\nTechnical: Not applicable.\n\nFunding:  The reduction in FY21 is due to the realignment of resources to higher Navy priority requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Ocean Wrfghtg Env Applied Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "42.342"
                        },
                        "CurrentYear": {
                            "val": "60.082"
                        },
                        "BudgetYearOne": {
                            "val": "63.392"
                        },
                        "BudgetYearOneBase": {
                            "val": "63.392"
                        },
                        "BudgetYearTwo": {
                            "val": "69.358"
                        },
                        "BudgetYearThree": {
                            "val": "75.374"
                        },
                        "BudgetYearFour": {
                            "val": "76.389"
                        },
                        "BudgetYearFive": {
                            "val": "77.917"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides the foundational environmental knowledge for undersea, surface and air-based warfighting technologies and effective operations anywhere on the globe, as well as the operation of unattended sensors and unmanned air, surface and underwater vehicles. This project includes the National Oceanographic Partnership Program (NOPP) and efforts aimed at understanding and predicting the impacts of underwater sound on marine mammals. Major efforts of this project are devoted to: gaining real-time knowledge of the Battlespace Environment (BSE), understanding the variability between processes in the world's ocean, providing the on-scene commander with the capability to exploit the environment to tactical advantage. Research results are transitioned to the Fleet Numerical Meteorology and Oceanography Center and to the Naval Oceanographic Office where they are used to provide timely information about the natural environment for all fleet operations. Efforts include ocean and atmospheric analysis and prediction for real-time description of the operational environment from space to sub-seafloor, shallow water acoustics, sensors for undersea surveillance and weapon systems, and influences of the natural environment on Mine Countermeasures, Naval Mining,  Anti-Submarine Warfare (ASW) and Naval Special Warfare systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Coastal Geosciences\/Optics"
                                    },
                                    "Description": {
                                        "val": "The Coastal Geosciences\/Optics activity develops knowledge of the littoral, nearshore and riverine environments in which physical, acoustical and optical processes are dominated by the presence of the sea or river bed and air-water interface. Predictive environmental models, custom climatological databases, adaptive sampling schemes, technologies for nearshore observations and advanced remote sensing capabilities provide critical foundational information for Naval Special Warfare, Mine and Expeditionary Warfare and Amphibious operations. This Program emphasizes field research in navally relevant environments, including many that require research outside the U.S."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.862"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.552"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Applied research investments in this activity support the development and testing of littoral models, sensors, platforms (air, surface, undersea or space) and remote sensing algorithm development to enable prediction of coastal battlespace environments anywhere on the globe. Efforts include development of new sensors and ocean remote sensing to quantify littoral geophysical variables, e.g., bathymetry, shallow-water bottom types, waves, currents, temperature, salinity, vector winds, optical properties.  \n\nBattlespace Environments:  Conceptualize and perform laboratory, field, and numerical modeling studies to understand and exploit various geoscience and optical environmental phenomena in areas that are scientifically challenging, require innovation, and are of interest to the Navy\/Marine Corps. Encompasses the design, performance, analysis and underlying theory of field and laboratory experiments designed to understand geological\/geophysical, biological, and optical phenomena (including bioluminescence), in the oceans and littoral zones, and to validate that understanding. To develop models that can predict bottom boundary physical, geological, geochemical, geo-acoustic and geotechnical properties in shallow-water operating areas requires:  a) an improved understanding of processes that generate and modify the shape, structure and physical properties of the seafloor and sub-seafloor, and its topography\/morphology.  Includes efforts to develop new or enhance existing shipboard, in-situ, airborne, and space-borne sensors and appropriate inversion and though-the-sensor techniques to obtain, store, utilize, merge and\/or exploit data and create operationally and tactically useful environmental information of the littorals and bottom. This includes specification and development of sensors, signal processing, inversion, and other analysis tools when needed. Surveillance of coastal land areas and waters is important to support Navy operations.  The Navy\/Marine Corps needs include an improved use rapid, airborne characterization of littoral environments including time-varying coastal topography, littoral bathymetry, sea-level height, land and seafloor sedimentary structures as well as quantification of the influence of turbulence generated at the seafloor boundary layer on vertical mixing and stratification in shallow water outside the surf zone. \n\nUndersea Warfare:   Conceptualize and perform laboratory and field studies to understand and exploit energy storage and retrieval from the benthic interface and the potential to balance small scale and large scale intermittent power generation with power demand for persistent operation of marine sensors presently powered by batteries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.030"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.030"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Inner Shelf Modeling: Conclude modeling of the inner shelf field experiment region. \n\n- GuST turbulence probe: Maintain development of the GuST turbulence probe. \n\n- Satellite Based Sensing: Pursue improving the world's global bathymetry map from satellite data. Specific new efforts will utilize ICESAT for shoreline digital elevation models and connect with new investigations and methods extending altimetry-based seabed models up onto the continental shelves. Maintain efforts focused on determining bathymetry from satellite based-remote sensing for shallow muddy and turbid waters. \n\n- Inner Shelf Processes: Initiate studies of non-hydrostatic modeling of inner shelf processes, including internal waves and fronts. Initiate a systematic study of biases introduced into the inner shelf sea-surface-temperature field by the global ocean model. \n\n- Remote Sensors: Initiate optimization studies of adaptive sampling in the littorals using a small unmanned aerial vehicle that is also capable of maneuver underwater. \n\n- Sonar: Initiate technology development to observe and map bottom currents and bathymetry from drifting, bottom-following sensors."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2020 to FY 2021 is due to reduced investment in the level of support needed for optical phenomena in the ocean and littoral zones as the program shifts focus to more development of atmosphere and space environmental technologies that interest the Navy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Marine Mammals and Biology"
                                    },
                                    "Description": {
                                        "val": "The goal of the Marine Mammals and Biology activity focus is to better understand and characterize the effects of underwater sounds produced by Navy acoustic sources on marine mammals. Studies address characterizing marine mammal and their ecosystems, quantifying effects of sound exposure on marine mammals, and improving the ability to monitoring and detect marine mammals in the open ocean. Research results supports Navy environmental compliance information needs and facilitates acquiring Letter of Authorizations from regulators that enable all Navy training and testing operations, and the development of appropriate state-of-the-art mitigation measures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.482"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.482"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extramural Marine Mammals and Biology - Areas of research include monitoring and detection, integrated ecosystem, and\neffects of sound on marine mammals.\n\nIntegrated Ecosystem Research: Further research using animal tagging and passive acoustic monitoring to study behaviors,\nmovement and distribution of marine mammals relative to key environmental properties (biotic and abiotic).\n\nEffects of Sound: Conduct research on behavioral effects to potentially population-level consequences of sound exposure on marine life. Initiate research to characterize the gas management and kinetics (stores and use) in marine mammals. Conduct research into the mechanisms that enable marine mammals to dive to deep depths for long durations while mitigating, if not avoiding, health threats. Conduct research to advance our understanding of sound reception mechanisms in mysticetes (large whales) will require a thorough exploration of the anatomy surrounding the ear and the whole head combined with modeling sound propagation through various tissues of whale heads and\/or bodies. Conduct research to develop an understanding of the natural variation of stress markers, better understand and characterize acute and chronic effects of the stress response on individuals and populations of marine mammals. Conduct research on potential effects of Navy sources on marine mammal behavior, life functions (e.g. feeding, breeding, migrating), vital rates (e.g. adult survival, reproduction), and population level effects. Understanding the effects of naval activities on species or stocks of marine mammals, including effects on annual rates of recruitment and survival.\n\nMonitoring and Detection: Conduct research and development of technology for detection, classification, and localization of marine mammals.\n\nModels & Databases: Conduct research to provide tools to support environmental compliance efforts and decision making\nrelated to how marine mammals are affected by anthropogenic sounds. Initiate research using increase in funds to\ncharacterize and quantify the cumulative effects of multiple stressors on marine mammal populations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.484"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.484"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This focus area conducts applied research in areas including monitoring and detection, integrated ecosystem, and effects of sound on marine mammals. \n\n- Passive Acoustics: Further research efforts on passive acoustics and other technology, including the development and testing of new autonomous hardware platforms and signal processing algorithms for detection, classification, and localization of marine mammals. Maintain research using animal tagging and passive acoustic monitoring to quantify behaviors, movement and distribution of marine mammals relative to key biotic and abiotic environmental properties. \n\n- Sound Effects Modeling: On going research to quantify the behavioral effects to potentially population-level consequences of sound exposure on marine life. \n\n- Marine Mammals: Conduct research to design equipment and capability to quantify the gas management and kinetics in marine mammals to elucidate the mechanisms that enable marine mammals to dive to deep depths. \n\n- Sound Reception Mechanisms in whales: Pursue research to advance our understanding of sound reception mechanisms in large whales including the anatomy surrounding the ear and the whole head. \n\n- Sonar Exposure: Maintain research into the stress response of marine mammals to sonar exposure with an emphasis on quantifying the effects of prolonged exposure effects on immune system suppression, reproductive failure, accelerated aging, and slowed growth. \n\n- Marine Mammal Behavior: Pursue research on potential effects of Navy sources on marine mammal behavior, life functions, vital rates and population level effects. \n\n- Environmental Compliance: On going research to provide tools to support environmental compliance efforts and decision making related to how marine mammals can be affected by anthropogenic sounds."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Marine Meteorology"
                                    },
                                    "Description": {
                                        "val": "The Marine Meteorology activity develops observing technologies, predictive models, Numerical Weather Prediction (NWP) systems and Tactical Decision Aids (TDA) that describe the atmospheric environment and its impacts on naval sensors and operations. This activity focuses on uniquely marine aspects of atmospheric science such as air-sea interaction, coupled ocean-atmosphere modeling, Electromagnetic (EM) and electro-optical (EO) propagation, coastal meteorology, tropical cyclone (TC) prediction, and the use of remote sensing to obtain quantitative observations of atmospheric properties. Aspects of the atmospheric environment of particular interest include near-surface phenomena that affect refractivity, marine boundary layer dynamics that affect clouds, rain, visibility and fog, and processes that control TC structure, track, and intensity. Objectives of this activity are improved NWP systems and TDAs that provide nowcast and forecast skill at global, regional, and tactical scales for operational support, sensor and system development, and performance prediction."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.417"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.908"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform field measurements; theoretical analyses; development of data assimilation and modeling technologies; increasing knowledge content of data from remote sensing and through-the-sensor systems; improve the representation of dynamical and physical processes, coupled atmosphere\/ocean\/wave\/ice\/land processes, atmospheric predictability, and methodologies for probabilistic forecasting and characterization of uncertainty. These studies include efforts to develop appropriate techniques to obtain atmospheric environmental data from airborne and spaceborne sensors.  \n\nAdditional effort is focused on parameters that affect Electric Optical (EO) and Electric Magnetic (EM) propagation in the marine environment. Develop and improve\/optimize the Navy's regional Numerical Weather Prediction (NWP) prediction system (COAMPS) by increasing resolution and incorporating new physics and numerical methods to provide much more accurate forecasts, particularly for poorly predicted phenomena like Arctic storms, and coupling with ocean and ice forecast models. Develop and improve tropical cyclone forecast models through improved physics, coupling to the ocean and upper atmosphere, assimilation of new observations, data assimilation methods and novel ensemble methods that quantify forecast uncertainty.\n\nConduct research on a next-generation global NWP model that incorporates efficient numerical methods, variable-resolution grids, improved representation of physics, and that can operate efficiently on future computation systems.  The goal is to potentially replace the rectangular nested-grid systems currently in use, and combine global and regional modeling into a unified and more efficient system.\n\nEncompasses the design, performance, analysis and underlying theory of field and laboratory experiments and telescoping, global-to-tactical scale numerical simulations specifically designed to understand atmospheric environmental processes and phenomena. Includes efforts to develop appropriate inversion and other techniques to obtain atmospheric environmental data from airborne and space-borne sensors.  Includes empirical and numerical model development techniques and associated efforts designed to improve atmospheric prediction, diagnose problems and increase the efficiency and accuracy of those models and model systems in a variety of computational environments. Includes efforts to fuse, merge and exploit atmospheric data and create operationally useful information. The research is coordinated with operational customers to enable rapid transition of research into operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.545"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.545"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Data Assimilation and Modeling: Further collection of field observations; theoretical analyses; and development of data assimilation and modeling technologies \n\n- Through the Sensor systems: Maintain applied research and studies aimed at increasing knowledge content of data from remote sensing and through-the-sensor systems as well as improving the representation of dynamical and physical processes, coupled atmosphere\/ocean\/wave\/ice\/land processes, atmospheric predictability, and methodologies for probabilistic forecasting and characterization of uncertainty. These studies include efforts to develop appropriate techniques to obtain atmospheric environmental data from airborne and space-borne sensors. \n\n- Tactical Decision Aids: Conduct efforts focused on parameters that affect EO and EM propagation in the marine environment with the goal of representing the real current and forecast atmosphere in tactical decision aids. \n\n- Numerical Weather Prediction: Maintain applied research to improve and optimize COAMPS, the Navy's regional numerical weather prediction system by increasing resolution and incorporating new physics and numerical methods to provide much more accurate forecasts for poorly predicted Arctic storms. Conduct applied research on a next-generation global model that incorporates efficient numerical methods, variable resolution grids, improved representation of physics, and that can operate efficiently on future computation systems. \n \n- Tropical Forecast Prediction Models: Pursue to develop and improve tropical cyclone forecast models to more accurately predict the rapid intensification of strong tropical cyclones. \n\n- Atmospheric Prediction: Maintain efforts on the design, performance, analysis and underlying theory of global-to-tactical scale numerical simulations specifically designed to represent atmospheric environmental processes and phenomena. Includes efforts to develop appropriate inversion and other techniques to obtain atmospheric environmental data from airborne and space-borne sensors; empirical and numerical model development techniques and associated efforts designed to increase the efficiency and accuracy of model systems in a variety of computational environments. Research is coordinated with operational customers to enable rapid transition of research into advanced development efforts and eventually operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2020 to FY 2021 is due to the shift of advancement and ability to predict and validate model forecast in Ocean Battlespace Environment using a mix of science, modeling and engineering."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "National Oceanographic Partnership Program (NOPP)"
                                    },
                                    "Description": {
                                        "val": "This activity focuses on Navy investments in the National Oceanographic Partnership Program (NOPP). NOPP, established by the US Congress (Public Law 104-201) in FY97, is a unique collaboration among U.S. federal agencies involved in conducting, funding, or utilizing results of ocean research. NOPP's value to the Navy derives from the capacity of the partnership to enable and ensure multi-agency efforts where such collaboration enhances efficiency or effectiveness, reduces costs, or both. NOPP topics address scientific problems that cross agency missions, fall in gaps between agencies or are too large for any single agency to fund."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.781"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.742"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The focus remains on topics that cross agency missions and\/or are too large for one agency to address alone; this includes ocean\/coastal dynamical process studies, observation and modeling systems, development of sensors, communications and data acquisition, storage and processing tools required to affect it, modernization of ocean research and observation infrastructure, and marine mammal-related research.  Conduct of studies focused on model verification, constraint of boundary conditions and fluxes of mass, heat and momentum across them (air-sea, deep ocean-seabed, land-sea), and responses to storm and\/or persistent forcing are anticipated.  Expand the development and utilization of small space-based sensors for oceanographic and atmospheric dynamics research; and miniaturized, low-power, next generation sensors for ocean measurements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.742"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.742"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- National Oceanographic Partnership Program (NOPP): NOPP focus areas include topics of interest to multiple federal agencies that share ocean-related missions and are effectively investigated via partnerships. Topics include ocean, atmosphere, and coastal dynamical process studies; development of sensors, communications, and data acquisition approaches and methodologies for ocean research; modernization of ocean research and observation infrastructure; and studies of soundscapes in the ocean related to marine mammal research. \n\n- Oceanographic Observations and Modeling: Maintain oceanographic studies focused on model verification, constraint of boundary conditions and fluxes of mass, heat and momentum across them (air-sea, deep ocean-seabed, land-sea), and responses to storm and\/or persistent forcing. \n\n- Space Based Sensors: Further the development and utilization of small space-based sensors for oceanographic and atmospheric dynamics research. - Next Generation Oceanographic sensors:  Continue development of miniaturized, low-power, next generation sensors for ocean measurements including soft materials."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ocean Acoustics"
                                    },
                                    "Description": {
                                        "val": "The Ocean Acoustics activity focuses on the impact of the natural ocean environment on acoustic wave phenomena in support of undersea warfare and underwater force protection operations. This activity studies underwater acoustic propagation, scattering from ocean boundaries, and ambient noise issues that impact the development and employment of acoustic systems. The littoral zone has been the ocean environment of greatest interest. Aspects of this environment, that greatly impact underwater acoustic systems, are the shallow water, the consequent closeness and physical significance of the ocean bottom, and the complexities inherent to rapid changes of the ocean structure. The objectives of this program are met through measuring, analyzing, modeling and simulating, and exploiting ocean acoustic factors to gain advantage over potential adversaries using undersea acoustic systems. Results of this activity support acoustic sensor and system development, performance prediction, and tactical decision aids. This activity will also focuses on efforts addressing research needs identified by Task Force Ocean that will enable tactical maneuver for the future submarine force. The efforts funded by this Program Element (PE) fall generally into two topic areas: Analysis and understanding of the impact of environmental conditions on sonar data, and the development of reduced order ocean-acoustic models to enable environmental awareness and prediction on forward platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.074"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.240"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research efforts to enable environmental awareness and tactical exploitation of the environment by forward naval platforms. Activities will include the development of technologies and algorithms to incorporate in situ environmental sensing into an on-scene environmental characterization capability, inversion of sensor data to infer the local environment, and the development of capabilities to exploit the ocean environment for tactical advantage. Research efforts are informed by the outcome of the Tactical Oceanography Symposia series conducted by the Office of Naval Research, which involve academic researchers, industry partners, and the operational Navy.\n\nConduct applied research to provide the Warfighter with improved Anti-Submarine Warfare (ASW) performance\nassessment models and tactical decision aids to plan ASW operations, evaluate effectiveness of ASW systems, and\nenable environmental adaptive system control. The capability to provide ASW sensor and system performance models,\nrealistic simulations, and measures of effectiveness that incorporate and exploit critical environmental knowledge requires coupling ocean dynamics and acoustics, ambient noise characterization in the littorals, acoustic and optical scattering and propagation characterization, through-the-sensor measurement techniques for in situ environmental parameters,measurement and prediction of uncertainty, and development of tactical decision tools. Efforts include continuation of applied research to enhance passive sonar performance capability in the Arctic environment by developing a better passive sonar performance prediction model and new acoustic ice-characterization methods."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.545"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.545"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Anti-Submarine Warfare: Conduct applied research to develop improved Anti-Submarine Warfare (ASW) performance assessment models and tactical decision aids to plan ASW operations, evaluate effectiveness of ASW systems, and enable environmental adaptive system control. \n\n- Sensors: Maintain to provide Anti-Submarine Warfare (ASW) sensor and system performance models, realistic simulations, and measures of effectiveness. This includes incorporating and exploiting critical environmental knowledge and requires coupling ocean dynamics and acoustics, ambient noise characterization in the littorals. It also includes applied research in acoustic and optical scattering and propagation characterization, through-the-sensor measurement techniques for in situ environmental parameters, measurement and prediction of uncertainty, and development of tactical decision tools. Conduct research efforts to enable environmental awareness and tactical exploitation of the environment by forward naval platforms. Activities will include the development of technologies and algorithms to incorporate in situ environmental sensing into an on-scene environmental characterization capability, inversion of sensor data to infer the local environment, and the development of capabilities to exploit the ocean environment for tactical advantage. Research efforts are informed by activities conducted by Task Force Ocean, which involve academic researchers, industry partners, and the operational Navy. \n\n- Passive Sonar: Further applied research to enhance passive sonar performance capability in the Arctic environment by developing a better passive sonar performance prediction model and new acoustic ice-characterization methods. \n\n- Environmental Acoustics: Initiate development of ensemble prediction products that exploit improved computational speeds for both underwater and atmospheric acoustics. - Sensors: Initiate development of improved performance prediction products that exploit emerging space based sensing\/characterization for rough bubbly surface boundaries."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2020 to FY 2021 is due to the acceleration of the Task Force Ocean project to gain a better understanding on the oceans, especially in the Artic, with respect to global prediction based on the outcome of the Chief Naval Operations Task Force Ocean working groups and recommended courses of action."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physical Oceanography"
                                    },
                                    "Description": {
                                        "val": "The Physical Oceanography activity develops knowledge of the physics of the ocean to enable tactical naval use and exploitation of the battlespace. This is achieved through the development of predictive models of the water mass structure, waves, currents, and air-sea interactions and developing measurement\/observation technology. Other applications utilize knowledge of the interaction of the water column hydrodynamics and the acoustics to predict the undersea transmission characteristics and sources of uncertainty in these statistics. Utilizing knowledge of the ocean surface physics, the physical oceanography program seeks to exploit the combination of remotely sensed data, in-situ data, and adaptively sampled data to optimize predictions of ocean currents and water column structure. These predictions, custom databases, adaptive sampling schemes and data programs serve Surface Warfare, Anti-Submarine Warfare, Naval Special Warfare, and Mine and Expeditionary Warfare operations. Oceanographic field research that uses active acoustic transmissions requires modeling of the acoustic effects of sound on marine life in order to meet Navy environmental requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.726"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.158"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied oceanographic research including field campaigns to study ocean processes and dynamics, ocean model development, and data assimilation from the open ocean to the nearshore environments. Data assimilation development extends use of coupled modeling approaches to include air-ice-wave-ocean-land models. Studies develop new or enhance existing shipboard, in-situ, airborne, and space borne sensors and appropriate inversion and \"through the sensor\" techniques to obtain physical oceanographic environmental data, and to fuse and exploit oceanographic data to create operationally useful information. \n \nThe testing of the Remote Ocean Sampling System for air-sea surface flux sampling will be completed following the deployments in the North Atlantic.  Efforts to develop advanced autonomy for the operations of gliders in extreme environments is also completed. Testing of gliders with turbulence sensors, Unmanned Underwater Vehicles (UUVs) with turbulence sensors will continue. Additional efforts develop ocean drifters with stable salinity sensors and high resolution turbulence sensors will continue.\n\nContinue the effort to develop a capability to estimate global ocean forecast uncertainty from ensembles which will enable risk assessment with skill out to 30 days, providing the real-time assessment of environmental uncertainty anywhere on demand and risk analysis products that can be used as inputs to existing decision support tools such as risk quantification and mission planning. Continue the effort to develop a new capability for accurate and rapid characterization of the local ocean battlespace utilizing the ability of gliders to work in coordinated teams and 4-dimensional variation assimilation to maximize impact of the glider data in a high-resolution local forecast model for more accurate ocean predictions.\n\nTesting of ocean instrumentation that features energy harvesting will be initiated.  The TOPSIDE software of the data server module will be tested with ocean data sets that are publically available and cloud computing and serving will be evaluated and tested.\n\nBattlespace Environments: A program including field research on ocean processes and dynamics, ocean model development, and data assimilation from the open ocean to the nearshore and riverine environments is directed towards model system development and analysis. Model and data assimilation development is extending to the field of coupled models including air-ice-wave-ocean-land models. Encompasses the design, analysis and underlying theory of field and laboratory experiments designed to understand ocean environmental processes and phenomena. It includes model development to improve ocean environmental predictive capabilities, through improved physical characterization, diagnosis, efficiency and accuracy of these models in a variety of computational environments. Also includes efforts to develop new or enhance existing shipboard, in-situ, airborne, and spaceborne sensors and appropriate inversion and \"through the sensor\" techniques to obtain physical oceanographic environmental data. Includes effort to fuse and exploit oceanographic data to create operationally useful information.  The research is coordinated with operational customers to enable its rapid transition into operational systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.046"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.046"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Sensors: Conduct testing and integration of turbulence sensors and other ocean oceanographic sensors into unmanned platforms to expand ocean sampling capabilities. Maintain development of autonomous sensors and platforms for use in the Arctic ocean environment. Further field campaigns to study ocean processes and dynamics, ocean model development, and data assimilation from the open ocean to the nearshore environments. Conduct studies to develop new or enhance existing shipboard, in-situ, airborne, and space borne sensors and appropriate inversion and through the sensor techniques to obtain physical oceanographic environmental data. \n\n- Data Assimilation: On going data assimilation development to coupled modeling approaches including air-ice-wave-ocean-land models. \n\n- Earth System Prediction Models: Pursue to develop the capability to utilize Earth System Prediction Models to forecast the global ocean using ensemble prediction methods to enable risk assessment with skill to 30 days. \n\n- Ocean Battlespace: Maintain the effort to develop a new capability for accurate and rapid characterization of the local ocean battlespace utilizing the ability of gliders to work in coordinated teams and 4-dimensional variation assimilation to maximize impact of the glider data in a high-resolution local forecast model for more accurate ocean predictions. \n\n- Remote Sensing and Sampling: Accomplished testing of the Remote Ocean Sampling System for air-sea surface flux sampling in the North Atlantic. \n\n- Riverine input to the coastal ocean: Conclude research to couple an overland flow hydrology model to a coastal ocean model to capture rainfall-runoff events.\n\n- Task Force Ocean: Initiate research coordinated with Task Force Ocean including efforts to develop new and enhance existing shipboard, in-situ, airborne, and space-borne sensors, appropriate inversion methods, and through the sensor techniques to obtain physical oceanographic environmental data in conjunction with acoustical observations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "45.373"
                        },
                        "CurrentYear": {
                            "val": "22.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "67.873"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Naval Special Warfare"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.654"
                                        },
                                        "Text": {
                                            "val": "Funds support applied oceanographic research to exploit ocean currents, water surface and seafloor roughness, and ocean opto-acoustical properties, among other phenomena, to enhance underwater vehicle and diver operations."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied oceanographic research to exploit ocean currents, water surface and seafloor roughness, and ocean opto-acoustical properties, among other phenomena, to enhance underwater vehicle and diver operations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Task Force Ocean"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.654"
                                        },
                                        "Text": {
                                            "val": "Funds support development and use of artificial intelligence and machine learning techniques for large ocean and acoustic data sets; through-the-sensor environmental characterization, including assimilation into nested local environmental prediction models; exploration and development of advanced signal processing techniques that incorporate local ocean structure, including ambient noise characterization; and exploration of analytic techniques linking physical oceanographic variability with acoustic propagation, including field efforts to collect relevant data sets."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Continued exploration of analytic techniques linking physical oceanographic variability with acoustic propagation, including field efforts to collect relevant data sets. The development and use of artificial intelligence and machine learning techniques for large ocean and acoustic data sets.  Through-the-sensor environmental characterization, including assimilation into nested local environmental prediction models.  Exploration and development of advanced signal processing techniques that incorporate local ocean structure, including ambient noise characterization"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Acoustics Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "1.931"
                                        },
                                        "Text": {
                                            "val": "Funds support research in applied acoustics, advanced sensor capabilities and better undersea environment data to directly characterizing the physical environment and provide information to monitor ecosystem health, impacts, and change. These investments will improve performance of U.S. Navy sonar systems for surveillance and reconnaissance."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Modal Detection Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.654"
                                        },
                                        "Text": {
                                            "val": "Funds support research in non-acoustic detection, tracking, localization, and identification of underwater threats."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Maritime Surveillance"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "14.480"
                                        },
                                        "Text": {
                                            "val": "Funds support research to enable long-duration observations of oceanographic, acoustic, and geophysical characteristics, among others, in the maritime environment."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Arctic geospatial information"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2.500"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research to Artic geospatial information."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}