{
    "id": "2021-AirForce-PB-3600-JBOOK-52117659cde5b66f9481fd2e0957295e8c3577bb57ee19c9d86f2af599cd13cd-59",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V3A-U_RDTE_JustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0208097F"
        },
        "ProgramElementTitle": {
            "val": "Joint Cyber Command and Control (JCC2)"
        },
        "R1LineNumber": {
            "val": "223"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "12.553"
            },
            "CurrentYear": {
                "val": "11.603"
            },
            "BudgetYearOne": {
                "val": "38.480"
            },
            "BudgetYearOneBase": {
                "val": "38.480"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "51.486"
            },
            "BudgetYearThree": {
                "val": "65.601"
            },
            "BudgetYearFour": {
                "val": "67.727"
            },
            "BudgetYearFive": {
                "val": "61.994"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY20, PE 0306250F, Cyber Operations Technology Development efforts were transferred to PE 0208097F, Joint Cyber Command and Control (JCC2) efforts in order to enable Executive Agent oversight and management and to provide adequate oversight and Service stakeholder transparency."
        },
        "ProgramElementMissionDescription": {
            "val": "Joint Cyber Command and Control (JCC2) provides Combatant Commanders, Joint Force Commanders and Service Component Commanders with enhanced situational awareness and battle management for cyberspace operations missions and forces. JCC2 establishes congressionally directed focal point to provide integrated JCC2 solutions to all echelons for execution of cyberspace operations to enable and accelerate planning\/collaboration between Cyber Mission Forces and Combatant Commands (CCMD).\n\nIt will integrate Cyber C2 with Joint, Coalition and inter-agency C2 to enhance multi-domain operations, reduce planning time, improve decision quality and speed resulting in a shorter kill chain. Capabilities will be developed to address the Cyber Mission Forces used to conduct cyber operations.  Additionally, it will leverage and utilize the Continuous Infrastructure\/Continuous Development (CI\/CD) Framework (a cyber factory) to pace development with warfighter need. JCC2 development activities include, but are not limited to: rapid prototyping, development of software\/hardware systems; integration and transition of lab developed cyber capabilities to the warfighter; testing and evaluation; program management administration, studies, analysis, pilots, demonstrations; risk reduction for emerging technologies; and development and assessment of operational systems for inclusion into JCC2 to meet capability requirements.  The increase in funds will enable greater capacity to react to emerging requirements.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver JCC2 capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605831F.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.000"
                },
                "CurrentYear": {
                    "val": "11.603"
                },
                "BudgetYearOne": {
                    "val": "11.602"
                },
                "BudgetYearOneBase": {
                    "val": "11.602"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "12.553"
                },
                "CurrentYear": {
                    "val": "11.603"
                },
                "BudgetYearOne": {
                    "val": "38.480"
                },
                "BudgetYearOneBase": {
                    "val": "38.480"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.447"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "26.878"
                },
                "BudgetYearOneBase": {
                    "val": "26.878"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.447"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "26.878"
                                },
                                "BudgetYearOneBase": {
                                    "val": "26.878"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "676045"
                    },
                    "ProjectTitle": {
                        "val": "Foundational Efforts"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.553"
                        },
                        "CurrentYear": {
                            "val": "11.603"
                        },
                        "BudgetYearOne": {
                            "val": "38.480"
                        },
                        "BudgetYearOneBase": {
                            "val": "38.480"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "51.486"
                        },
                        "BudgetYearThree": {
                            "val": "65.601"
                        },
                        "BudgetYearFour": {
                            "val": "67.727"
                        },
                        "BudgetYearFive": {
                            "val": "61.994"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY20, PE 0306250F, Cyber Operations Technology Development efforts were transferred to PE 0208097F, Joint Cyber Command and Control (JCC2) efforts in order to enable Executive Agent oversight and management, and to provide adequate oversight and Service stakeholder transparency."
                        },
                        "ProjectMissionDescription": {
                            "val": "Joint Cyber Command and Control (JCC2) provides Combatant Commanders, Joint Force Commanders and Service Component Commanders with enhanced situational awareness and battle management for cyberspace operations missions and forces. JCC2 establishes congressionally directed focal point to provide integrated JCC2 solutions to all echelons for execution of cyberspace operations to enable and accelerate planning\/collaboration between Cyber Mission Forces and Combatant Commands (CCMD).\n\nIt will integrate Cyber C2 with Joint, Coalition and inter-agency C2 to enhance multi-domain operations, reduce planning time, improve decision quality and speed resulting in a shorter kill chain. Capabilities will be developed to address the Cyber Mission Forces used to conduct cyber operations.  Additionally, it will leverage and utilize the Continuous Infrastructure\/Continuous Development (CI\/CD) Framework (a cyber factory) to pace development with warfighter need. JCC2 development activities include, but are not limited to: rapid prototyping, development of software\/hardware systems; integration and transition of lab developed cyber capabilities to the warfighter; testing and evaluation; program management administration, studies, analysis, pilots, demonstrations; risk reduction for emerging technologies; and development and assessment of operational systems for inclusion into JCC2 to meet capability requirements.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver JCC2 capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Foundational Efforts"
                                    },
                                    "Description": {
                                        "val": "Foundational Efforts are program activities, at multiple operating locations, supporting development and evaluations activities and JCC2 baseline efforts to retain capability. Actions include system and software engineering, risk management, developmental framework management, and the execution of acquisition activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.553"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.603"
                                            },
                                            "Text": {
                                                "val": "- Develop capabilities and initiate the Cyber Tasking Order used in CMF to conduct cyber operations\n- Expand program office to support JCC2 requirements development packages\n- Build-up DevSecOps teams for continued piloting at CCMDs\n- Stand up development environment, i.e., hosting services, infrastructure\n- Integrate optimal Situational Awareness (SA) capabilities to integrate automated threat information sharing and collaboration"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.480"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.480"
                                            },
                                            "Text": {
                                                "val": "- Will incrementally develop JCC2 capabilities using the DevSecOps approach. \n- Will continue to integrate existing situational awareness and battle management capabilities to the JCC2 solution\n- Will continue to build the backlog of requirements through Joint Working Groups and the JCC2 Governance Process"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased due to decision to develop JCC2 capabilities from FY20 to FY21."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "JCC2 is pre-Material Development Decision (MDD). JCC2 will apply agile acquisition tenets to the programmatic, design\/engineering, test and delivery aspects to provide an ability to deliver Situational Awareness\/C2 capabilities to the warfighter in a rapid manner. JCC2 will transition from a collection of distinct, special-purpose tools to an integrated joint capability to reduce overall lifecycle costs, improve interoperability, and increase information sharing across the CCMDs. JCC2 PMO will seek the new Software Acquisition Pathway as a long-term acquisition strategy. The IT-Box approach instills rigor for capability deployments and documentation for JCC2 while utilizing multiple middle tier acquisition designations allow the program to proceed with the DevSecOps pace. The JCC2 program office will utilize new and existing contract vehicles and concept, development, risk management, production, or deployment plans as part of a streamlined approach. The JCC2 program office will establish continuous integration\/continuous development pipeline to facilitate the rapid development, integration, and fielding of capabilities to remain responsive to evolving warfighter requirements. The JCC2 program will execute the agile development requirements provided by the Army, Navy, Marine Corps, Air Force, and USCYBERCOM stakeholders in accordance with the prioritization provided by the multi-Service JCC2 governance structure. The initial JCC2 capability will deliver a minimum viable product (MVP) for immediate deployment and operational use. Subsequent build iterations will continue to deliver enhanced capabilities incrementally building the JCC2 capability to match warfighter needs. The JCC2 baseline capability relies on extensive development and evaluation efforts to analyze integration constraints and opportunities of Service-specific cyber capabilities. The decision to develop joint capabilities moved from FY22 to FY21."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "CI\/CD - Continuous Integration\/Continuous Development\n\nTransition USCC pilot systems to USAF references that the USAF was designated the lead service via being named the Executive Agent.  The pilot systems transferred currently have operational users and are being evaluated for best of breed features and architecture to be further developed into the overarching JCC2 capability requirements."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "JCC2 CI\/CD Infrastructure"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.153"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.079"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.079"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JCC2 Agile Capability Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.715"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "28.780"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "28.780"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "JCC2 Acquisition Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.900"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.888"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.621"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.621"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Foundational Events"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Transition USCC pilot systems to USAF"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JCC2 CI\/CD Infrastructure"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JCC2 Agile Capability Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JCC2 Acquisition Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Transition USCC pilot systems to USAF references that the USAF was designated the lead service via being named the Executive Agent.  The pilot systems transferred currently have operational users and are being evaluated for best of breed features and architecture to be further developed into the overarching JCC2 capability requirements."
                        }
                    }
                }
            ]
        }
    }
}