{
    "id": "2021-Army-PB-2040-JBOOK-38817b19843ccf99356f5d9ba89c5f3ce0667d7b832b6ff0b583beb9488c2c99-38",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA4-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1206120A"
        },
        "ProgramElementTitle": {
            "val": "Assured Positioning, Navigation and Timing (PNT)"
        },
        "R1LineNumber": {
            "val": "116"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "123.364"
            },
            "CurrentYear": {
                "val": "139.110"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "262.474"
            }
        },
        "ProgramElementNote": {
            "val": "Program Element (PE) 1206120A transitions to PE 0604120A beginning in FY21."
        },
        "ProgramElementMissionDescription": {
            "val": "Assured Positioning, Navigation and Timing (A-PNT) provides Army ground maneuver forces access to assured PNT information under conditions where space-based PNT Global Positioning System (GPS) may be limited or denied (jammed and spoofed). A-PNT products are ruggedized tactical systems that enable Army forces at echelon the ability to shoot, move, communicate, and protect their forces to penetrate and dis-integrate enemy anti-access systems, thereby allowing them to maneuver from operational and strategic distances to close with, destroy, and exploit the enemy in close and deep maneuver areas with sufficient combat bower, tempo, and momentum. A-PNT addresses two critical capability gaps: Access and Integrity. Access is the ability to retrieve accurate PNT information in a contested Electronic Warfare\/Cyber environment. Integrity is the ability to trust the PNT information. PNT is a critical enabler of many Army Maneuver, Fires, and Command and Control systems that are dependent on accurate Position and Timing, and a foundational Multi-Domain Battle capability to support: calibrated force posture (position and maneuver across strategic distances); multi-domain formations (operate in contested spaces against near-peer adversaries); convergence (continuous integration of capabilities in all domains). The current Global Positioning System (GPS) capability is a fixed frequency system susceptible to electronic warfare and field environments (e.g. urban, dense vegetation).\n\nJoint Requirements Oversight Council Memo (JROCM) 049-10, dated 05 April 2010, approved the PNT Assurance Initial Capabilities Document and designated the Army as the Lead Component for Assured PNT. Army Futures Command approved the Mounted A-PNT System (MAPS) Directed Requirement (DR) on 13 January 2019. The Dismounted A-PNT System (DAPS) Directed Requirement was approved 05 April 2019. The Alternative Navigation (ALTNAV) Directed Requirement was approved in November 2019. MAPS transitions to a Capability Development Document (CDD) in June 2020 and DAPS transitions in FY 2021.\n\nAssured Positioning, Navigation and Timing (A-PNT) consists of:\n(FJ8) - The Assured PNT project funding line is for: PNT System of Systems Architecture (SOSA) Testing to validate performance of end-to-end system performance; Resiliency and Software Assurance Measures (RSAM) upgrades to legacy GPS systems.  In addition, this line supports the development of complementary and adjacent A-PNT technologies as well as Enterprise Enablers including the Alternative Navigation (ALT NAV) signal Enterprise Build-out.  These technologies will be integrated into future products, strategies, concepts of operation, architectures, and platforms to assure PNT.\n\n(FJ9) - Dismounted Assured PNT (A-PNT) System (DAPS) will provide the Soldiers equipped with Nett Warrior and other Soldier architecture compliant systems (e.g.Integrated Visual Augmentation System (IVAS)) conducting operations outside of vehicles, unhindered access the critical timing and position data to effectively engage targets, share data across the network and conduct mission command functions.\n\n(FK1)  - The Pseudolite project was terminated by the Army on 12 February 2019. \n\n(FK2) - The Mounted Assured Positioning, Navigation, and Timing (PNT) System (MAPS) is a platform-mounted, ruggedized tactical PNT system which provides electronic protection capabilities that enable combatant commanders the ability to move, shoot, and communicate in a Global Positioning System (GPS) challenged or denied environments.\n\n(FK3) - The Anti-Jam Antenna Systems (AJAS) provides GPS signal point protection and PNT Assurance in challenged environments through Anti-Jam technologies. AJAS enables tactical capabilities through assured signal acquisition in challenged environments. The AJAS will assist in delivering distributed assured PNT capabilities to mounted platforms over time in an iterative, affordable manner that allows for future modernization."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "128.64"
                },
                "CurrentYear": {
                    "val": "192.562"
                },
                "BudgetYearOne": {
                    "val": "221.875"
                },
                "BudgetYearOneBase": {
                    "val": "221.875"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "123.364"
                },
                "CurrentYear": {
                    "val": "139.11"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.276"
                },
                "CurrentYear": {
                    "val": "-53.452"
                },
                "BudgetYearOne": {
                    "val": "-221.875"
                },
                "BudgetYearOneBase": {
                    "val": "-221.875"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-53.452"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-5.276"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-221.875"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-221.875"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Program Element (PE) 1206120A transitions to PE 0604120A beginning in FY21."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "FJ8"
                    },
                    "ProjectTitle": {
                        "val": "Assured Positioning, Navigation and Timing (PNT)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "62.628"
                        },
                        "CurrentYear": {
                            "val": "42.379"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "105.007"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Program Element (PE) 1206120A project FJ8, planned program title Assured Positioning, Navigation and Timing Enterprise Enablers transitions to PE 0604120A project BV4 beginning in FY21. \n\nProgram Element (PE) 1206120A project FJ8, planned program title PNT System of System (SOSA) Testing and Resiliency and Software Assurance Measures (RSAM) transitions to PE 0604120A project ED5 beginning in FY21."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Assured Positioning, Navigation and Timing (PNT) project funds the Resiliency and Software Assurance Measures (RSAM) which provides increased capability and situational awareness for 500,000+ fielded legacy military Global Positioning System (GPS) receivers supporting systems and soldiers through at least 2035. Legacy GPS receivers targeted for RSAM enhancements, include but are not limited to, 226,000 Defense Advanced GPS Receiver (DAGR) and 200,000+ embedded Ground Based-GPS Receiver Applications Module (GB-GRAM). RSAM mitigates risks in a GPS-challenged operational environment until future Positioning, Navigation and Timing (PNT) solutions are fully deployed.  This line also funds the Assured PNT enablers which includes prototype development and testing to demonstrate and prove emerging capabilities for legacy and future PNT resilient solutions. Assured PNT enablers also includes the Alternative Navigation signal enterprise build-out, providing PNT data in a denied or degraded environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PNT System of System (SOSA) Testing and Resiliency and Software Assurance Measures (RSAM)"
                                    },
                                    "Description": {
                                        "val": "The effort supports SOSA testing, RSAM and other Army PNT capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "31.642"
                                            },
                                            "Text": {
                                                "val": "FY 2019 base funds support testing and RSAM software development for legacy military GPS receivers and continued infrastructure build-out for ALT NAV.\n\nProgram Manager Positioning, Navigation and Timing developed, tested and evaluated software RSAM Update 1 prototypes for two legacy military GPS receivers:  Defense Advanced GPS Receiver (DAGR) and for Ground Based GPS Receiver Application Module (GB-GRAM).  In addition, DAGR RSAM integration testing efforts were performed on relevant military vehicles and systems.\n\nRSAM software development was initiated for NavStrike 3.3 software to improve performance of Long Range Precision Fires (LRPF) as a top Army Modernization Priority."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.03"
                                            },
                                            "Text": {
                                                "val": "FY 2020 base funds support continued Update 2 software development against emerging threats for Defense Advanced GPS Receiver (DAGR) and Ground Based GPS Receiver Application Module (GB-GRAM\/MicroGRAM).\n\nPNT Systems of Systems (SOSA) testing and Resiliency and Software Assurance Measures (RSAM) will complete software development Update 1 for GB-GRAM and continue software development for MicroGRAM, to include engineering build testing, formal qualification testing, and risk mitigation efforts for platforms utilizing Defense Advanced GPS Receiver (DAGR) and GB-GRAM. In addition, DAGR RSAM and GB-GRAM RSAM integration testing efforts will be performed in association with relevant platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "RDT&E funding decreased from $21.992 million in FY 2020 to $0.0 million in FY 2021 due to transitioning to PE 0604120A project ED5."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assured Positioning, Navigation and Timing (PNT) Enterprise Enablers and Build-out"
                                    },
                                    "Description": {
                                        "val": "Enterprise Enablers provide enhanced PNT capability across an operational enterprise.  These materiel solutions may augment or replace GPS by providing complementary PNT information.  As complementary PNT providers, Enterprise Enablers build resiliency and robustness by diversifying PNT sources to ensure Soldiers have the right PNT information to drive mission success."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.955"
                                            },
                                            "Text": {
                                                "val": "FY 2019 Base funds will provide an Enterprise Build-out that enables Alternative Navigation (ALT NAV) capabilities which provide positioning, navigation and timing data in a denied or degraded environment.  Activities to support this effort include: network integration, installation and testing of the assured timing\/location modular enterprise capability for ALT NAV."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.425"
                                            },
                                            "Text": {
                                                "val": "FY 2020 Base funds will continue through market research, prototyping, experimentation, and technical demonstrations of ALT NAV, emerging situational awareness capabilities and net-enabled GPS solutions. These solutions will leverage commercial capabilities, existing contracts, industry, academia, and the warfighter in an iterative process, that will be integrated into future products, strategies, concepts of operation, architectures, and platforms to assure PNT.  Other efforts include the continuation of Situational Awareness development, spectrum modification for PNT solutions (Alternative PNT Banding) and modeling and simulation support for Radio Frequency (RF) signals of opportunity for PNT."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "RDT&E funding decreased from $20.387 million in FY 2020 to $0.0 million in FY 2021 due to transitioning to PE 0604120A project BV4."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.118"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 Rescission"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.913"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.924"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "K49010"
                                    },
                                    "Title": {
                                        "val": "Mounted\/Dismounted Receivers"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "1.724"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.894"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.894"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.193"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.075"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.37"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.394"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "K49010:  Mounted\/Dismounted Receivers is an OPA subset of Line Item Number 9897K49000 \/ Assured Positioning, Navigation and Timing."
                        },
                        "AcquisitionStrategy": {
                            "val": "The planned acquisition strategy for Positioning, Navigation and Timing (PNT) System of Systems Architecture (SOSA) testing and Resiliency and Software Assurance Measures (RSAM) implementation is to award sole source contracts to the original equipment manufacturers and leverage the Communications Electronics Research Development Engineering Center (CERDEC) to develop and evaluate solutions to enhance the resiliency of Global Positioning System (GPS)-dependent systems operating in evolving contested environments. PNT SOSA testing and RSAM implementation will complete software development for Defense Advanced GPS Receiver (DAGR), Ground Based GPS Receiver Applications Module (GB-GRAM), and MicroGRAM to include engineering build testing and formal qualification testing, as well as integration and integration testing, for platforms utilizing DAGR, GB-GRAM and MicroGRAM engineering builds.\n\nThe Assured PNT Enterprise Enablers project will conduct market research, prototyping, experimentation, and technical demonstrations of Alternative Navigation (ALT NAV), emerging situational awareness capabilities and net-enabled GPS solutions. These solutions will leverage commercial capabilities, existing contracts, industry, academia, and the warfighter in an iterative process, that will be integrated into future products, strategies, concepts of operation, architectures, and platforms to assure PNT.\n\nThe Assured PNT Enterprise Build-out will conduct network integration, installation and testing of the assured timing\/location modular enterprise capability for ALT NAV.  ALT NAV provides positioning, navigation and timing data in a denied or degraded environment.  Enterprise Buildout will be completed to enable ALT NAV capabilities."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM PNT"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.056"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.314"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.370"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.118"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.118"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.924"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.924"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "RSAM - DAGR Software Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Rockwell Collins"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cedar Rapids, IA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.102"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.709"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.811"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RSAM - GB-GRAM Software Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Rockwell Collins"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cedar Rapids, IA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.272"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.084"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.356"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Assured PNT Enterprise Enablers"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "20.194"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "20.194"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Assured PNT Enterprise Buildout"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "27.955"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "27.955"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Army Modernization Priorities"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Rockwell Collins"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cedar Rapids, IA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.034"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.034"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 Pending Rescission"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.913"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.913"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Contracting Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCS Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "9.11"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.785"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.895"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Government Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C4ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.833"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.033"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.866"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Assured PNT Enterprise Enablers Contractor Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCS Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.328"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.328"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SOSA Testing\/RSAM - Government Eng Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.826"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.477"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.303"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SOSA Testing\/RSAM - Contractor Eng Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.276"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.672"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.948"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Platform Integration Testing"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.7"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.086"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.786"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SOSA Testing\/RSAM Test Equipment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.191"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.101"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.292"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Assured PNT Enterprise Buildout Test Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.914"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.914"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "4_FJ8_0.png"
                                }
                            }
                        ],
                        "ScheduleProfileNote": {
                            "val": "Program Element (PE) 1206120A project FJ8, planned program title Assured Positioning, Navigation and Timing Enterprise Enablers transitions to PE 0604120A project BV4 beginning in FY21.\n\nProgram Element (PE) 1206120A project FJ8, planned program title PNT System of System (SOSA) Testing and Resiliency and Software Assurance Measures (RSAM) transitions to PE 0604120A project ED5 beginning in FY21."
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "PNT System of Sytems Architecture (SOSA) Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSAM - DAGR Software Development and Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSAM DAGR Update 1 Software Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSAM - GB-GRAM\/MicroGRAM Software Development and Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSAM GB-GRAM Update 1 Software Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSAM MicroGRAM Update 1 Software Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Platform Integration Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Army Enterprise Enablers"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FJ9"
                    },
                    "ProjectTitle": {
                        "val": "Dismounted A-PNT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.384"
                        },
                        "CurrentYear": {
                            "val": "28.758"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "44.142"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Program Element (PE) 1206120A project FJ9 transitions to PE 0604120A project EH8 beginning in FY 2021."
                        },
                        "ProjectMissionDescription": {
                            "val": "Dismounted Assured PNT (A-PNT) System (DAPS) implements congressional and OSD guidance to develop and field Military Code (M-Code) Ground User Equipment  (MGUE) receivers and provides the Soldiers equipped with Nett Warrior (NW) and other Soldier architecture compliant systems (e.g. Integrated Visual Augmentation System (IVAS)) the critical timing and position data to effectively engage targets, share data across the network, and conduct mission command functions. DAPS is planned to be a size, weight and power (SWaP) optimized form-factor that paces the threats and includes development and integration of Global Positioning System (GPS) and non-GPS sensors. DAPS integrates with the NW system and other Soldier architecture compliant systems, and distributes PNT information to the End-User Device (EUD). DAPS includes receiver software capable of fusing sensors and Global Navigation Satellite Systems (GNSS) signals resulting in additional integrity for military GPS in denied environments and includes a M-Code receiver solution, or a Selective Availability Anti-Spoofing Module (SAASM) system with growth path to M-Code.\n\nThrough an iterative approach, DAPS will continue to fuse M-Code, GNSS, and non-GPS sensors, as well as fuse Alternate Navigation (ALTNAV) and other complementary PNT sources in a SWaP constrained system in order to pace\/overmatch the threat and continue to deliver critical timing and position data to effectively\nengage targets, share data across the network, and conduct mission command functions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Dismounted A-PNT System (DAPS)"
                                    },
                                    "Description": {
                                        "val": "This effort supports the development and delivery of DAPS prototypes for integration, evaluation and performance testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.384"
                                            },
                                            "Text": {
                                                "val": "FY 2019 Base funds supported hardware and software prototype evaluations to include design reviews, test planning and Nett Warrior hardware and software integration.  In addition, funding supported the development of the Dismounted system with the size, weight, and power optimized for a multi-sensor navigation prototype."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.452"
                                            },
                                            "Text": {
                                                "val": "FY 2020 Base funds will deliver Dismounted A-PNT prototypes, conduct laboratory, performance and reliability tests.  Safety Release and New Equipment Training will be completed.  Nett Warrior Hardware and Software integration will be completed followed by final testing in FY 2021.  Other efforts include: requirement\/design trade studies and early prototyping for user demonstrations of a stand-alone Handheld variant.  Integration of IVAS and HUD 3.0 architecture efforts will continue."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "RDT&E funding decreased from $32.360 million in FY 2020 to $0.0 million in FY 2021 due to transitions to PE 0604120A project EH8."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.306"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "K49020"
                                    },
                                    "Title": {
                                        "val": "Dismounted Hub"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "48.449"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "48.449"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "49.57"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.458"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.063"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.96"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "K49020 \/ Dismounted Hub is an OPA subset of Line Item Number  9897K49000 \/ Assured Positioning, Navigation and Timing."
                        },
                        "AcquisitionStrategy": {
                            "val": "Dismounted A-PNT program will provide the Soldier conducting operations outside of vehicles the means to maintain accurate position, velocity, and time information in Global Positioning System (GPS) challenged or degraded\/denied environments where space based PNT may be limited or denied. The Dismounted A-PNT capability will provide improved performance over the currently fielded Defense Advanced GPS Receiver.\n\nThe first iteration of capabilities will employ tailored processes to identify and close key technology gaps. Technologies available from Industry today will be evaluated for performance and operational suitability and equipped to select critical units. This will be implemented by utilizing Other Transaction Authority (OTA)'s to competitively obtain prototypes. The Government will conduct laboratory and performance testing. The findings from these efforts will provide technology viability and allow for the transition to limited production. Providing initial equipment to specified units will result in an assessment to determine production and fielding readiness of the capability."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management Support - Contractor"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.435"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.399"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.834"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.306"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.306"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Dismounted A-PNT Prototyping & Development Vendor 1"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Integrated Solutions for Systems, Inc. (IS4S)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Auburn, AL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.112"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.196"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.308"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dismounted A-PNT Prototyping & Development Vendor 2"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mayflower Communications Company, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.206"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.193"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.399"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dismounted A-PNT Protoyping & Delivery"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.928"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.928"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Development of a Dismounted M-Code capable prototype"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L3 Technologies Interstate Electronics Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Anaheim, CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.3"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.727"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.027"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Development of a small SWAP-C multi sensor navigation prototype"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC Command Power and Integration Directorate"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.896"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.896"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.06"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.247"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.307"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Nett Warrior Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.783"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.567"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.350"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services - Government"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.372"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.725"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.097"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services - Contractor"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCS Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.12"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.793"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.913"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.677"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.777"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "4_FJ9_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Dismounted A-PNT M-Code \/ SWAP-C Prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Dismounted A-PNT Prototype Acquisition Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Dismounted A-PNT Prototyping & Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Dismounted A-PNT Prototype Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Dismounted A-PNT Nett Warrior Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Program Element (PE) 1206120A project FJ9 transitions to PE 0604120A project EH8 beginning in FY 2021."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FK1"
                    },
                    "ProjectTitle": {
                        "val": "Pseudolites"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.953"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.953"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Pseudolite project was terminated by the Army on 12 February 2019."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pseudolites close out"
                                    },
                                    "Description": {
                                        "val": "Pseudolites transitioning to Area Protection and Alternative Navigation Technology Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.953"
                                            },
                                            "Text": {
                                                "val": "FY 2019 Base funds will complete smart shutdown of the Pseudolite program and refocus a material solution approach for requirements associated with Alternative PNT & Area Protection.  A new project line is requested to support this transition."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Pseudolite project was terminated by the Army on 12 February 2019."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services - Government"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.953"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.953"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "4_FK1_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Pseudolite (PL) Prototype Smart Shutdown and Transition"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FK2"
                    },
                    "ProjectTitle": {
                        "val": "Mounted A-PNT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "35.775"
                        },
                        "CurrentYear": {
                            "val": "59.073"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "94.848"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Program Element (PE) 1206120A project FK2 transitions to PE 0604120A project EJ2 beginning in FY 2021."
                        },
                        "ProjectMissionDescription": {
                            "val": "Mission Command Network Modernization Implementation Plan - Line of Effort 1, 17 April 2018.\n\nMounted Assured Positioning, Navigation and Timing System (MAPS) will provide the Army's ground maneuver forces access to assured PNT information under conditions where space-based PNT Global Positioning System (GPS) may be limited or denied. A-PNT products are ruggedized tactical systems which provides electronic protection capabilities that enable combatant commanders the ability to move, shoot, and communicate in a Global Positioning System (GPS) challenged or denied environments. MAPS addresses two critical capability gaps: Access and Integrity. Access is the ability to retrieve accurate PNT information in a contested Electronic Warfare\/Cyber environment. Integrity is the ability to trust the PNT data. PNT is a critical enabler of many Army Maneuver, Fire and Command and Control systems that are dependent on accurate Position and Timing.\n\nMounted Hub A-PNT: The Mounted Assured Positioning, Navigation, and Timing (PNT) System (MAPS) is a platform-mounted, ruggedized tactical PNT system which provides electronic protection capabilities that enable combatant commanders the ability to move, shoot, and communicate in a Global Positioning System (GPS) challenged or denied environments. Included in the MAPS is the Anti-Jam Antenna System (AJAS) which provides GPS signal point protection and PNT Assurance in challenged environments through Anti-Jam technologies. AJAS enables tactical capabilities through assured signal acquisition in challenged environments. The AJAS will assist in delivering distributed assured PNT capabilities to mounted platforms over time in an iterative, affordable manner that allows for future modernization."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mounted A-PNT System (MAPS)"
                                    },
                                    "Description": {
                                        "val": "This effort supports the delivery of MAPS prototypes for platform integration, performance and reliability testing, technical evaluation, and operational assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.055"
                                            },
                                            "Text": {
                                                "val": "FY 2019 Base funds were used to initiate the MAPS GEN II Other Transaction Authority (OTA) to prove out state of the art PNT technologies.  Three vendors were selected and delivered 51 prototypes in 90 days to support testing, integration, and upward invitation.  Through the OTA, MAPS successfully integrated M-code, demonstrated anti-spoof technology, executed client system integration, and proved out other non-GPS PNT capabilities such as wheel speed sensors, inertials, timing augmentation.  MAPS also integrated GEN I onto four Stryker variants (62 total Strykers) in support of the USEURA Operational Needs Statement.  MAPS opened the PNT Systems Integration Lab (SIL) to enable rapid prototyping for the GEN II OTA and future PNT systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "56.39"
                                            },
                                            "Text": {
                                                "val": "FY 2020 Base funds will support integration, installation, training and Soldier assessment of MAPS on selected combat vehicles and command, control and communication systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "RDT&E funding decreased from $66.471 million in FY 2020 to $0.0 million in FY 2021 as it transitions to PE 0604120A project EJ2 beginning in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY19 Rescission"
                                    },
                                    "Description": {
                                        "val": "FY 2019 pending rescission"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.72"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.683"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "K49030"
                                    },
                                    "Title": {
                                        "val": "Mounted Hub A-PNT"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "41.728"
                                        },
                                        "BudgetYearOne": {
                                            "val": "93.151"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "80.585"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "12.566"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "81.623"
                                        },
                                        "BudgetYearThree": {
                                            "val": "153.841"
                                        },
                                        "BudgetYearFour": {
                                            "val": "94.775"
                                        },
                                        "BudgetYearFive": {
                                            "val": "97.866"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "K49030 \/ Mounted Hub A-PNT is an OPA subset of Line Item Number  9897K49000 \/ Assured Positioning, Navigation and Timing"
                        },
                        "AcquisitionStrategy": {
                            "val": "The goal of the Mounted Assured Positioning, Navigation and Timing (PNT) System (MAPS) program is to deliver distributed assured PNT capabilities to mounted platforms over time in an iterative, affordable manner that allows for future modernization.  The first iteration of capabilities will employ tailored processes to identify and close key technology gaps.  Technologies available from Industry today will be evaluated for performance and operational suitability and equipped to select critical units.  This will be implemented by utilizing a competitive Other Transaction Agreement (OTA) to obtain prototypes.  The Government will conduct Electromagnetic Interference and Environmental Testing, as well as performance testing in the System Integration Lab (SIL), anechoic chamber testing and a Military Feasibility Assessment (MFA).  The findings from these tests and assessment efforts will determine whether or not to begin platform integration. Providing initial equipment to specified units will result in an assessment to determine production and fielding readiness of the capability."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Program Element (PE) 1206120A project FK2 transitions to PE 0604120A project EJ2 beginning in FY 2021. Program schedule continues on PE 0604120A project EJ2."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management Support - Contractor"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.381"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.886"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.267"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.683"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.683"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Client and Platform Integration is required for 81 Platforms and 27 Client PMs."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Mounted\/AJAS Prototype Development Contract"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.045"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.247"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "15.292"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.361"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.842"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.203"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Client and Platform Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO CS&CSS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.975"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "29.293"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "30.268"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Client Software Development (JBCP)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMRDEC\/S3I"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.544"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.544"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technical Manuals & Support Equipment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.753"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.753"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 Pending Rescission"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "14.72"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.720"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services - Government"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.639"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.794"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.433"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services - Contractor"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.498"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.485"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.983"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Performance Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.294"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.111"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.405"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Reliability Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.327"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.327"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Field Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test and Evaluation Command (ATEC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "White Sands Missile Range (WSMR)"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.415"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.415"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Military Feasibility Assessment (MFA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.111"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.111"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering and Integration Testing & Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC Command Power and Integration Directorate"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.903"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.541"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.444"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "4_FK2_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Mounted A-PNT Risk Reduction Activities"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Mounted A-PNT Prototyping and Testing - Phase I"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Mounted A-PNT Prototyping and Testing - Phase II"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MAPS Technology Insertion - Alt Nav"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Client and Platform Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Operational Technical Demonstration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Direct Requirement Decision Preferred Material Solution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Program schedule continues on PE 0604120A project EJ2."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FK3"
                    },
                    "ProjectTitle": {
                        "val": "Anti-Jam Antenna"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.624"
                        },
                        "CurrentYear": {
                            "val": "8.9"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "17.524"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Program Element (PE) 1206120A project FK3 transitions to PE 0604120A project EJ2 beginning in FY 2021."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Anti-Jam Antenna System (AJAS) provides point protection by steering electronic nulls at interference sources or beams at valid signal sources. This enables continuous Global Positioning System (GPS) signal acquisition and tracking in a navigation warfare (jamming) environment. The AJAS is tightly coupled with the Mounted Assured Positioning, Navigation and Timing System (MAPS) to provide GPS signal protection and assured PNT in challenged environments on Army tactical and combat vehicles.  The AJAS integration with the MAPS will achieve performance requirements in the highest threat level conditions.  These two products each provide a degree of A-PNT protection.  Integrated together, however, these two products will close the capability gap and achieve the desired performance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Anti-Jam Antenna System"
                                    },
                                    "Description": {
                                        "val": "This effort supports the delivery of MAPS prototypes for platform integration, performance and reliability testing, technical evaluation, and operational assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.259"
                                            },
                                            "Text": {
                                                "val": "FY 2019 Base funds were used to initiate the MAPS GEN II Other Transaction Authority to prove out state of the art AJAS technologies.  Three vendors were selected and delivered 51 prototypes in 90 days to support testing, integration, and upward invitation.  The AJAS antennas received under the OTA exceeded the performance of current AJAS antennas in the Army and demonstrated advanced anti-spoofing technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.496"
                                            },
                                            "Text": {
                                                "val": "FY 2020 Base funds will support integration, installation, training and Soldier Assessment of AJAS fielded with MAPS, on selected combat vehicles and command, control and communication systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "RDT&E funding decreased from $8.9 million in FY 2020 to $0.0 million in FY 2021 as it transitions to PE 0604120A project EJ2 beginning in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY19 Rescission"
                                    },
                                    "Description": {
                                        "val": "FY 2019 Pending Rescission"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.365"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.404"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The goal of the Anti-Jam Antenna System (AJAS) program is to deliver distributed A-PNT capabilities to mounted platforms over time in an iterative, affordable manner that allows for future modernization. The first iteration of capabilities will employ tailored processes to identify and close key technology gaps. Technologies available from Industry today will be evaluated for performance and operational suitability and equipped to select critical units. This will be implemented by utilizing a competitive Other Transaction Agreement (OTA) to obtain prototypes.  The Government will conduct partial Electromagnetic Interference and Environmental Testing, as well as performance testing in the System Integration Lab (SIL), anechoic chamber testing and a Military Feasibility Assessment. The findings from these test and assessment efforts will determine whether or not to proceed to platform integration. Providing initial equipment to specified units will result in an assessment to determine production and fielding readiness of the capability."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Program Element (PE) 1206120A project FK3 transitions to PE 0604120A project EJ2 beginning in FY 2021. Program schedule continues on PE 0604120A project EJ2."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management Support - Contractor"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.338"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.218"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.556"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.404"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.404"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development of the Systems Engineering and Integration Lab"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC Command Power and Integration Lab"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.209"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.209"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG,MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.97"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.970"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Mounted and AJAS Prototype Development Contract"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.231"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.231"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Client Software Development (JBCP)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMERDEC\/S3I Directorate"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG,MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.263"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.263"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technical Manuals & Support Equipment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG,MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.925"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.925"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 Pending Rescission"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.365"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.365"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services - Government"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.034"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.063"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.097"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services - Contractor"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.076"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.818"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.894"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Live Sky Demo and Antenna Anechoic Chamber Test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC - Command Power and Integration Directorate"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.384"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.384"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Anti-Jam Antenna Integrity\/Performance Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC STCD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG,MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.098"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.098"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TNT Prototype testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC STCD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.128"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.128"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "4_FK3_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Anti-Jam Antenna Risk Reduction Activities"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Anti-Jam Antenna Prototyping and Testing - Phase I"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Phase I OTA Prototype Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Antenna Anechoic Chamber Test Integrity\/Performance Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Directed Requirement Decision Preferred Material Solution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Live Sky Demo"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Anti-Jam Antenna Prototyping and Testing - Phase II"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MAPS\/AJAS Technology Insertion - Alt Nav"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Program schedule continues on PE 0604120A project EJ2."
                        }
                    }
                }
            ]
        }
    }
}