{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-8",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602143A"
        },
        "ProgramElementTitle": {
            "val": "Soldier Lethality Technology"
        },
        "R1LineNumber": {
            "val": "14"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0"
            },
            "CurrentYear": {
                "val": "145.900"
            },
            "BudgetYearOne": {
                "val": "125.435"
            },
            "BudgetYearOneBase": {
                "val": "125.435"
            },
            "BudgetYearTwo": {
                "val": "130.599"
            },
            "BudgetYearThree": {
                "val": "129.536"
            },
            "BudgetYearFour": {
                "val": "127.716"
            },
            "BudgetYearFive": {
                "val": "126.940"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "786.126"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020, this Program Element (PE) is realigned with continuity of effort from the following PEs:\n* 0602105A Materials Technology\n* 0602308A Advanced Concepts and Simulation\n* 0602618A Ballistics Technology\n* 0602623A Joint Service Small Arms Program\n* 0602624A Weapons and Munitions Technology\n* 0602705A Electronics and Electronic Devices\n* 0602709A Night Vision Technology\n* 0602712A Countermine Systems\n* 0602716A Human Factors Engineering Technology\n* 0602786A Warfighter Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE conducts fundamental research on Soldier Lethality technologies to develop an integrated Soldier and Squad architecture of equipment and systems that improve Soldier and Small Combat Unit survivability, sustainability, mobility, combat effectiveness, and individual cognitive and physical readiness. To address the challenges of integrating multiple technologies and sub-systems, research conducted in this PE, significant Science and Technology applied research investments in all areas of Soldier Lethality, focus on how to improve the effectiveness of the technologies a Soldier utilizes and apply systems-level practices to mitigate constraints from size and weight of the equipment. Research areas encompass individual and crew-served weapon designs and technologies as well as applied research in lightweight and transparent armor materials to mitigate effects from blast and ballistic threats, counter explosive hazard detection, counter-sensor capabilities, and signature management of weapons, equipment, personnel and high value targets. This PE investigates, develops and designs materials, technologies, methodologies and system models required to experiment and optimize Soldier lethality and survivability through investments in mobility, human-agent teaming, and improved situational awareness interfaces and display technologies as well as to provide Soldier-borne power and energy materials and components that support multiple Soldier-borne systems. This PE also investigates Warfighter training technologies and develops the underpinning technologies to establish architecture standards and interfaces necessary for creating realistic synthetic environments to create a single, interconnected synthetic training system to enable Army units and leaders to conduct realistic multi-echelon \/ multi-domain combined arms maneuver and mission command training, increasing proficiency through repetition. Human Factors Engineering projects conduct applied research to design weapon systems standards, guidelines, handbooks, and Soldier training curriculum and tools. \n\nResults of these efforts are transitioned within the Army Futures Command, the Program Executive Offices, Army Training and Doctrine Command (TRADOC), Army Medical Command (MEDCOM), Human Systems Integration (HSI) Directorate (Army G1), and the Army Test and Evaluation Command (ATEC).\n\nWork in this PE complements PE 0603118A (Soldier Lethality Advanced Technology).\n\nAll FY21 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this PE is performed by the United States Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "115.274"
                },
                "BudgetYearOne": {
                    "val": "126.345"
                },
                "BudgetYearOneBase": {
                    "val": "126.345"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "145.9"
                },
                "BudgetYearOne": {
                    "val": "125.435"
                },
                "BudgetYearOneBase": {
                    "val": "125.435"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "30.626"
                },
                "BudgetYearOne": {
                    "val": "-0.91"
                },
                "BudgetYearOneBase": {
                    "val": "-0.91"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "30.626"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.91"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.91"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AN1"
                    },
                    "ProjectTitle": {
                        "val": "Narrowband SATCOM Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "4"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from: \nProgram Element (PE) 0602782A Command, Control, Communications Technology:\n* Project H92 Communications Technology\n\nIn FY21 this Project is being realigned to:\nPE 0602146A Network C3I Technology\n* Project BZ6 Narrowband SATCOM Technology\nPE 0603463A (Network C3I Advanced Technology) \n* Project AN2 Narrowband SATCOM Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops technologies to enable gateway communications across disparate Narrowband Satellite Communications (SATCOM) networks, enabling resiliency in contested environments.  The Narrowband SATCOM network is the largest tactical network operated by the Army to provide situational understanding across all echelons.  This Project investigates technologies and protocols to enable risk mitigation solution sets and awareness through adaptive learning capabilities. FY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project complements PE 0603463A (Network C3I Advanced Technology) \/ Project AN2 (Narrowband SATCOM Advanced Technology).  \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Narrowband Satellite Communication Technology"
                                    },
                                    "Description": {
                                        "val": "This research effort designs and develops technologies to enable gateway communications across disparate Narrowband SATCOM networks, enabling resiliency in contested environments.  The Narrowband SATCOM network is the largest tactical network operated by the Army to provide situational understanding across all echelons. This project investigates technologies and protocols to enable risk mitigation solution sets and awareness through adaptive learning capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.819"
                                            },
                                            "Text": {
                                                "val": "Design and develop an agile, network-defined architecture to enable core network transport capabilities that can interface with, and control traditional and non-traditional Narrowband networks; and develop and mature functional components required to integrate assured, resilient network transport operations in a mobile, congested and contested environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to support the Network CFT in PE 0602146A (Network C3I Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.181"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AY6"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Squad Small Arms Armaments Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "18.345"
                        },
                        "BudgetYearOne": {
                            "val": "13.122"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.122"
                        },
                        "BudgetYearTwo": {
                            "val": "12.404"
                        },
                        "BudgetYearThree": {
                            "val": "15.901"
                        },
                        "BudgetYearFour": {
                            "val": "15.131"
                        },
                        "BudgetYearFive": {
                            "val": "15.132"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "90.035"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nPE 0602623A Joint Service Small Arms Program\n* Project H21 Joint Service Small Arms Program (JSSAP)\nPE 0602618A Ballistics Technology\n* Project H80 Soldier Protection Technology - Vulnerability \nPE 0602716A Human Factors Engineering Technology\n* Project H70 Human Factors Engineering System Development"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates individual and crew-served weapon designs and technologies that enhance the fighting capabilities and survivability of the dismounted Warfighter in support of all of the Services. In addition, it conceives and advances weapon concepts based on innovative ballistic and advanced incapacitation technologies that will enhance the defeat of hard and soft infantry targets at extended ranges based upon the Joint Service Small Arms Technology Development Strategy (JSATDS). The Project will continue to support technology needs from the all Services to include the Next Generation Family of Weapons. In addition, this Project will develop the technology\/weapons concepts that will upgrade medium and heavy support weapons at echelons. Finally, this Project will perform research directed toward non-kinetic modalities to incapacitate combatants.\n\nWork in this Project supports key Army needs and leverages the technical research of several PEs to include PE 0601102A (Defense Science Research) \/ Project AA7 (Mechanics and Ballistics), PE 0603118A (Soldier Lethality Advanced Technology), and PE 0602141A (Lethality Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier\/Squad Lethality Technology"
                                    },
                                    "Description": {
                                        "val": "This effort conceives and investigates advanced weapons concepts based on innovative ballistic technologies that will enhance the defeat of hard and soft infantry targets at extended ranges to ensure overmatch in Soldier and Squad lethality. This effort will also perform research directed toward non-ballistic modalities to incapacitate combatants."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.072"
                                            },
                                            "Text": {
                                                "val": "Identify novel lethal mechanisms for future weapons concepts and technical approaches to for increased lethality at reduced energy for behind armor\/barrier threats; identify and characterize technology concepts to enable a 50% reduction in dispersion for complex design projectiles; identify and demonstrate mechanisms for incapacitation through synthetic motor control in animal models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.103"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.103"
                                            },
                                            "Text": {
                                                "val": "Will continue to identify novel lethal mechanisms for future weapons concepts and technical approaches for increased lethality at reduced energy for behind armor\/barrier threats; utilize state of the art instrumentation to further characterize technology concepts to enable a reduction in dispersion for complex projectiles; determine benefits in capability for novel weapons systems for increased performance of heavy small caliber weapons as well as precision systems; and assess biological effects and incapacitation potential of advanced high powered microwave and acoustic directed energy technologies in small and large animal models."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned from PE 0602141A (Lethality Technology) \/ AH5 (Projectile and Multi-Function Warhead Technologies) for additional research into weapon systems mechanisms."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human-Agent Interactions for Intelligent Squad Weapons"
                                    },
                                    "Description": {
                                        "val": "This effort investigates enhanced target acquisition, situational awareness, and shooting performance through Soldier-centered integration of intelligent technologies and distributed information in augmented squad weapons. Enhances operational performance of individuals and teams of Soldiers through novel weapon and human-agent interaction technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.408"
                                            },
                                            "Text": {
                                                "val": "develop techniques to improve the Automated Target Recognition (ATR) training algorithms based on Soldier feedback to mitigate the severe size, weight and power (SWAP) constraints inherent in Soldier-carried weapons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.713"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.713"
                                            },
                                            "Text": {
                                                "val": "Will develop and document knowledge products, including data analysis documentation and guidelines for Soldier\/Advanced Target Recognition (ATR) interaction methods, contributing to a framework for bidirectional ATR display and interaction techniques, aimed at maximizing Soldier-intelligent fire control teamed target acquisition performance and situational awareness within the usable field of view."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Carbine Technology (NGCT)"
                                    },
                                    "Description": {
                                        "val": "This effort develops next generation squad weapon systems and ammunition by providing tech insertions to augment capabilities and mitigate risks. Mature small arms weapon system components and validate them through experimentation in support of the Joint Warfighter?s capability needs. Mature weapon system technology readiness levels and validate confidence of functionality in advanced operating scenarios."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.333"
                                            },
                                            "Text": {
                                                "val": "Validate recoil and shock pressures and determine metrics to compensate for increased muzzle velocity; conduct experiments on Next Generation Carbine Technology systems to ascertain probability of incapacitation effects."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort completes in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Family of Ammo (NGFoA)"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops a family of ammunition for automatic rifles and carbine weapons with the objective of decreasing weight, increasing lethality and hit performance over current fielded systems; develops capabilities to defeat threat targets at extended ranges."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.334"
                                            },
                                            "Text": {
                                                "val": "Conduct propulsion research and experiments to determine pressure, time and velocity of weapon systems; develop the Next Generation Family of Ammunition Combat Tracer; mature component technologies for projectile design, soft\/hard target and launch optimization, and modeling and simulation support for validation of capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.677"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.677"
                                            },
                                            "Text": {
                                                "val": "Will finalize maturation of component technologies for the next generation of small arms training rounds, training tracer projectiles, and ammunition training aides; conduct experiments with mature tracer component technologies to validate tracer design performance characteristics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreased to support PE 06030118A (Soldier Lethality Adv Technology) \/ AY5 (Soldier Squad Small Arms Armaments Advanced Tech) to support demonstration of next generation ammunition technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Enabling Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops small arms weapon systems, enablers, and ammunition technologies that will maintain decisive lethal overmatch capabilities to the Joint Warfighter. This effort matures small arms weapon system designs through experimentation in support of Joint Warfighter's capability needs."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.365"
                                            },
                                            "Text": {
                                                "val": "Investigate the advanced weapon operating technologies (recoil, accuracy, signature, materials, controllability, maintainability, materials, and coatings); conduct experiments on Small Arms Remote Weapon Stations to include component technology in the areas of advanced target recognition, next generation weapon system and lightweight stabilized mounts to enable an increase in the probability of hit on a target."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.629"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.629"
                                            },
                                            "Text": {
                                                "val": "Will investigate emerging small arms technologies to develop remote powered armament systems, advanced target recognition and aim augmentation, alternate barrel materials and coatings, signature reduction technologies, etc.; continue investigation of small arms remote armament component technologies for increasing the overall probability of hit."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.833"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AY8"
                    },
                    "ProjectTitle": {
                        "val": "Small Arms Fire Control Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.898"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.898"
                        },
                        "BudgetYearTwo": {
                            "val": "4.224"
                        },
                        "BudgetYearThree": {
                            "val": "2.12"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.242"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2021 (FY21), this Project is realigned from:\nProgram Element (PE) 0602143A Soldier Lethality Technology\n* Project BB4 Dismounted Soldier Survivability Materials\nPE 0603118A Soldier Lethality Advanced Technology:\n* Project AZ8 Soldier Squad Small Arms Armaments Adv Tech\n* Project BB3 Dismounted Soldier Survivability Equip\/Tech Integ\n* Project BB6 Physical Augmentation: Adv Tech for Field Demo"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops enabling technology for advanced small arms fire control in order to achieve lethality overmatch by supporting target prioritization, enhancing processing of information from multiple sources, and investigating aim assistance tools which remove Soldier aim error. This Project specifically supports the Army Science and Technology Soldier Lethality modernization priority.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Modernization Strategy, and the Soldier Lethality Cross Functional Team (CFT) efforts. All FY21 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThis Project complements work done in PE 0603118A (Soldier Lethality Advanced Technology) \/ AY7 (Small Arms Fire Control Advanced Technology).\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adv. Fire Control Tech"
                                    },
                                    "Description": {
                                        "val": "This Project investigates software and hardware mechanisms to enable enhanced kill chain processes on small arms platforms. This includes investigating artificial intelligence and neural network hardware, conducting experiments on both Commercial and Government Off-The-Shelf (COTS and GOTS) artificial intelligence and machine learning algorithms, and validating Soldier accuracy performance models. It also includes investigation of lightweight optical components and determines viability of weight reduction and balancing approaches."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.898"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.898"
                                            },
                                            "Text": {
                                                "val": "Will refine technical requirements based on capability needs; investigate existing artificial intelligence and machine learning algorithms on COTS & GOTS; determine implementation and validation approaches as well as research of human-system integration and pairing; and mature components of polymer lens and housing technologies, and three-dimensional printing solutions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased from PE 0603118A (Soldier Lethality Advanced Technology) \/ BB6 (Physical Augmentation: Adv Tech for Field Demo), AZ8 (Soldier Squad Small Arms Armaments Adv Tech), BB3 (Dismounted Soldier Survivability Equip\/Tech Integ), and PE 0602143A (Soldier Lethality Technology) \/ BB4 (Dismounted Soldier Survivability Materials) to address fire control acceleration in support of Army Modernization Priorities in this area."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AZ2"
                    },
                    "ProjectTitle": {
                        "val": "Body Armor & Integrated Headborne Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "8.427"
                        },
                        "BudgetYearOne": {
                            "val": "6.575"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.575"
                        },
                        "BudgetYearTwo": {
                            "val": "6.747"
                        },
                        "BudgetYearThree": {
                            "val": "6.922"
                        },
                        "BudgetYearFour": {
                            "val": "7.021"
                        },
                        "BudgetYearFive": {
                            "val": "6.022"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "41.714"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project H98 Clothing & Equipment Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops materials for Soldier-borne protective equipment, such as body armor and combat helmets, to increase protection from ballistic, blast, and blunt impact threats. This Project also investigates and executes systematic studies to mature and develop materials, devices, systems and methods that enable the identification of protective solutions against ballistic, blast and directed energy threats. Included are investigations of emerging technologies, novel materials, and test methods and integration of personnel armor, combat helmets, hearing protection, eyewear, and other personal protective equipment items.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Body Armor & Integrated Headborne Technology"
                                    },
                                    "Description": {
                                        "val": "This research effort supports the investigation of novel materials, component designs, and material modeling to design and develop technologies that protect Soldiers against ballistic, blast, and directed energy threats. This effort utilizes a cross-disciplinary, human-focused approach to develop technologies which optimize tradeoffs in ballistic and blast protective component design. This effort addresses the Army challenge of easing overburdened Soldiers in small units and aligns to Soldier protection modernization priorities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.044"
                                            },
                                            "Text": {
                                                "val": "Advance research toward material and technology development in support of an integrated single lens substrate for use in a Soldier vision protection systems that improves variable light transmission lenses with laser flash and dazzle protection, investigate high hardness coatings, as well as experiments on alternative technologies to mitigate lens deterioration and extend operational life; will mature the performance envelope of a repeatable laboratory test method that is capable of evaluating the performance of head-borne equipment in a simulated near free-field blast overpressure environment; develop modeling and analysis tools to quantify the terminal ballistic loading of small arms threats to the combat helmet and head to assist the scaling of head injury criteria to inform future helmet performance and injury biomechanics; systematically investigate material composite pre-stress processing methods to increase ballistic material mechanical properties during composite laminate processing to enhance ballistic performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.575"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.575"
                                            },
                                            "Text": {
                                                "val": "Will mature components of an integrated single lens substrate for use in Soldier vision protection system that includes anti-fog, variable light transmission, and lenses with laser flash and dazzle protection capabilities; conduct analytical and laboratory studies to physically validate the performance of high hardness and anti-fog coatings to protect and extend the operational life of various Soldier-borne display technologies; validate the operating performance capability of the advanced blast simulator and its correlation to free field blast overpressure conditions from artillery and antipersonnel threats as a means to systematically study headborne equipment in a controlled blast environment; validate material composite pre-stress processing methods and investigate its use with multiple material substrates as a means to enhance the ballistic performance of multiple end-items."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding in this effort was realigned to PE 0603118A (Soldier Lethality Advanced Technology) \/ AY9 (Body Armor & Integrated Headborne Adv Tech) to support the acceleration of next generation headborne protection system demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.383"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AZ5"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Protection Technology - Vulnerability"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "8.104"
                        },
                        "BudgetYearOne": {
                            "val": "12.248"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.248"
                        },
                        "BudgetYearTwo": {
                            "val": "12.659"
                        },
                        "BudgetYearThree": {
                            "val": "14.149"
                        },
                        "BudgetYearFour": {
                            "val": "14.317"
                        },
                        "BudgetYearFive": {
                            "val": "14.318"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "75.795"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602105A Materials Technology\n* Project H84 Materials\nPE 0602618A Ballistics Technology\n* Project H80 Survivability and Lethality Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops materials, methods, and models that enable design and integration of emerging material technologies into lightweight, flexible and modular Soldier equipment to protect against the range of existing and emerging threats for head, torso, and extremity protection. Specific research thrusts include the development of materials and mechanisms to enhance ballistic protection; computational models and associated experiments to provide a fundamental understanding of material properties and failure mechanisms, as well as correlation to ballistic\/blast\/blunt impact performance of Soldier personal protective equipment (PPE) and improved fibers, composite, and ceramic materials. Specific technologies include experimental helmets that reduce impact and blast loading to the head, Soldier torso protection systems to increase protection from ballistic and blunt impacts, and novel fibers and fabrics that provide additional survivability mechanisms.   \n\nWork in this Project supports key Army needs and is fully coordinated with several PEs to include PE 0602143A (Soldier Lethality Technology) and 0603118A (Soldier Lethality Advanced Technology); and leverages the technical research of several PEs to include PE 0601102A (Defense Research Sciences) \/ Project AA7 (Mechanics and Ballistics) and 0602144A (Ground Technology) \/ Project BL1 (Materials and Manufacturing Research Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort develops integrated lightweight, flexible, and modular protection equipment that is tailored to support the 'Soldier as a system' approach for defeat of emerging threats. Research areas encompass high fidelity ballistic impact injury models for hard and soft tissues, novel ceramic architectures to include graded and hierarchically structured ceramics, and novel fiber solutions for backing materials to deliver Soldier protection systems to meet emerging ballistic and signature management threats. This effort supports small caliber lethal mechanisms research in PE 0602143A (Soldier Lethality Technology) \/ Project AY6 (Soldier Squad Small Arms Armaments Technology)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.009"
                                            },
                                            "Text": {
                                                "val": "Perform computational\/experimental analysis of disruption mechanisms against legacy bullet technologies; simulate helmet\/pad\/head interaction for various loading scenarios; investigate soft tissue and hard tissue injury mechanisms; explore new concepts in limb protection from blast events; develop armor model to explore behind armor blunt trauma metrics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.211"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.211"
                                            },
                                            "Text": {
                                                "val": "Will design and develop armor mechanisms to protect dismounted Soldiers from emerging ballistic threats through experimental and computational analysis; increase head protection through determination of advanced mitigation techniques; investigate thoracic soft tissue and hard tissue injury mechanisms; continue to explore new concepts in limb protection from blast events; validate armor model for behind armor blunt trauma metrics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier-Borne Composite Materials"
                                    },
                                    "Description": {
                                        "val": "Utilizing understanding of fibers, fabrics, and composite materials, conduct applied research of emerging lightweight materials and structures to enable affordable designs for head, torso, and extremity protection systems. Provide quantitative scientific basis for modeling and simulation that result in materials that utilize new schemes to enhance Warfighter survivability. This effort supports Soldier Protection Technologies bullet."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.556"
                                            },
                                            "Text": {
                                                "val": "Demonstrate efficient and complete synthesis of novel fibers and films for soft body armor and head protection solutions; demonstrate computational framework of multi-physics-based helmet process models that simulate the thermoforming of compound curvature geometries providing process-induced microstructure and process histories that serve as critical input into ballistic impact simulations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.31"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.31"
                                            },
                                            "Text": {
                                                "val": "Will explore the processing and layout of novel fibers and films as a composite for potential soft body\/torso armor and head protection (helmets); and investigate computational methodology processes and the resulting structure-performance relationships of composites for helmets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier-Borne Advanced Protection Materials"
                                    },
                                    "Description": {
                                        "val": "Utilizing understanding of protection materials such as armor ceramics and associated failure mechanisms, conduct applied research of emerging armor materials to enable affordable design of lightweight ballistic protective systems for the future Soldier. Provide quantitative scientific basis for modeling and simulation that result in materials that utilize new lethal mechanisms\/protection schemes for the individual Warfighter. This effort supports Soldier Protection Technologies bullet and small caliber lethal mechanisms research in PE 0602143A (Soldier Lethality Technology) \/ Project AY6 (Soldier Squad Small Arms Armaments Technology),"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.171"
                                            },
                                            "Text": {
                                                "val": "Develop processing pathways to fabricate armor ceramic with novel multiscale heterogeneity and characterize ballistic performance; create experimental technique to characterize ceramic blends and ceramic failure to include the fragment size distribution and the subsequent flow of damaged material under tri-axial states of stress."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.73"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.73"
                                            },
                                            "Text": {
                                                "val": "Will explore novel ceramics and ceramic structures for ballistic applications; develop processing pathways for multiscale architectures and assess their ballistic performance; research experimental techniques to assess failure mechanisms for multiscale architectures under ballistically-relevant states of stress."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multifunctional Soldier Materials - Soldier Augmentation"
                                    },
                                    "Description": {
                                        "val": "This effort researches novel multifunctional Soldier protection materials and associated processing science aimed at enabling critical Army applications in survivability via Soldier augmentation technologies. Research efforts include: multifunctional fibers, films, and coatings; adaptive and responsive materials for passive biomechanical assistance; materials for sensing body forces and kinematics; materials for high power and high speed actuation; actuator fibers and textiles; functionally graded materials; and color-changing materials."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.997"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.997"
                                            },
                                            "Text": {
                                                "val": "Will explore the development of new materials and structures, both passive and active that can be integrated with the human body to modify human biomechanics, and \/or change color on demand; determine metamaterial structures that can be reconfigured rapidly and with spatial complexity to re-direct load paths or enhance energy absorption in real time."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.368"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AZ9"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Protection Advanced Tech - Detectability"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "4.5"
                        },
                        "BudgetYearOne": {
                            "val": "3.391"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.391"
                        },
                        "BudgetYearTwo": {
                            "val": "5.472"
                        },
                        "BudgetYearThree": {
                            "val": "5.498"
                        },
                        "BudgetYearFour": {
                            "val": "5.559"
                        },
                        "BudgetYearFive": {
                            "val": "5.559"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "29.979"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A  Warfighter Technology\n* Project H98  Clothing and Equipm Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and designs novel materials, technologies, techniques and applications increasing the capabilities of camouflage and concealment against known and emerging sensor threats. The results of this project enable effective deception capabilities, combinations of physical and electronic signature decoy components, and determination of analytical processes for modeling signature management technologies during multi-domain operations. These technologies will provide subsystems and concepts that shall decrease the probability of detection and targeting by peer and near-peer adversaries, enabling freedom of movement of semi-independent and dispersed formations and increased protection of high-valued assets. Components designed under this project will transition to Advanced Technology Development efforts in Soldier Lethality protection\/survivability Projects to provide disruptive Camouflage, Concealment and Deception technologies to the Operational Army to support expeditionary maneuver in the Multi-Domain Battle Environment and retain windows of advantage.\n\nWork in this Project supports key Army needs and leverages\/complements the technical research of several PEs to include PE 0601102A (Defense Research Sciences), PE 0602143A (Soldier Lethality Technology) \/ Project BB4 (Dismounted Soldier Survivability Materials), Project AZ5 (Soldier Protection Technology - Vulnerability), Project BE1 (Support Technology to Mission Command), PE 0603118A (Soldier Lethality Advanced Technology) \/ Project AZ8, (Soldier - Small Unit Detectability Adv Technology), and PE 0602712A (Countermine Systems) \/ Project H35 (Camouflage and Counter-Recon Tech).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Camouflage, Concealment and Decoys Technologies for Soldier and High-Value Assets"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs materials, processes, and concepts for innovative camouflage, concealment and deception technologies for Soldier and High-Value assets to defeat advanced current and emerging adversary Intelligence, Surveillance and Reconnaissance (ISR) threats including multispectral, hyperspectral and Light Detection and Ranging (LiDAR) sensors, and to reduce the probability of detection in multi-domain operations. Investigates analytical processes to model material and system performance and predict probability of detection in the multi-domain operational environment, assisting in closing the capability gap between current camouflage, concealment, and deception technologies and defeating enemy sensorial capabilities in future operating environments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.296"
                                            },
                                            "Text": {
                                                "val": "Validate preliminary performance effectiveness of camouflage technologies under development; determine design metrics to discern performance of candidate camouflage system solutions in support of future hyperspectral and LiDAR sensor defeat; investigate analytical models for predicting performance; determine the effectiveness of candidate decoy systems in deceiving peer and near-peer adversaries; mature versatile optical film technology for standoff-based signature concealment in visual and near infrared spectral ranges to camouflage to conceal Soldiers and small ground assets; conduct experiments to assess dismounted Soldier vulnerability against enemy ground surveillance radar; investigate flexible Soldier worn materials to reduce Soldier radar cross section; explore active color changing materials for potential Soldier clothing and individual equipment; investigate near infrared, identification of friend versus foe capability for the individual Soldier."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.391"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.391"
                                            },
                                            "Text": {
                                                "val": "Will leverage performance effectiveness of camouflage materiel technologies to mature components of most promising solutions; determine design metrics that will be relevant for defeating known emerging sensor threats; leverage data showing vulnerability against ground surveillance radar for experimenting with flexible Soldier worn materials to reduce Soldier radar cross section; investigate technologies to alert Soldiers if detected by ground surveillance radar; design and mature components of active color changing materials for future integration into Soldier clothing and individual equipment; research alternative active and passive identification of friend versus foe capabilities for the individual Soldier to provide tailorable mission-dependent capability; validate performance effectiveness of new camouflage technologies against continuously emerging and changing threats based on previous results; evaluate camouflage system solutions in support of new\/emerging hyperspectral and LiDAR sensor defeat; interrogate candidate deception solutions; continue to investigate color and optical property changing materials for high value asset concealment, utilizing varying environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding in this effort was realigned to PE 0602146A (Network C3I Technology) \/ AQ9 (Expeditionary Data to Decisions Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.204"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BB4"
                    },
                    "ProjectTitle": {
                        "val": "Dismounted Soldier Survivability Materials"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "4.946"
                        },
                        "BudgetYearOne": {
                            "val": "3.093"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.093"
                        },
                        "BudgetYearTwo": {
                            "val": "3.863"
                        },
                        "BudgetYearThree": {
                            "val": "3.955"
                        },
                        "BudgetYearFour": {
                            "val": "4.013"
                        },
                        "BudgetYearFive": {
                            "val": "4.013"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "23.883"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A  Warfighter Technology\n* Project H98 Clothing and Equipment Technologies"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates fibers, textiles, components, and materials focused on enhancing Soldier survivability from combat threats (flame and thermal, blast and ballistic, multispectral sensor, and laser threats) and environmental threats (e.g., cold, heat, wet, vector, antimicrobial, etc.) to increase operational effectiveness while decreasing the Soldier's physical and cognitive burden. The results from this Project will transition knowledge, materials, subcomponents and methods to Advanced Technology Development efforts in support of enhancing Soldier Lethality by providing protective material solutions focused on the aspects of dismounted movement and maneuver operations of the Army. This Project develops and applies validation methods that enable systematic studies of human systems integration principles and practices to protective equipment materials and designs to advance the understanding of trade-offs between protection, lethality, and mobility.\n\nWork in this Project supports key Army needs and leverages\/complements the technical research of several PEs to include PE 0601102A (Defense Research Sciences), PE 0602143A (Soldier Lethality Technology) \/ Project AZ5 (Soldier Protection Technology - Vulnerability), Project BB4 (Dismounted Soldier Survivability Materials), and PE 0603118A Soldier Lethality Advanced Technology \/ Project BB3 (Dismounted Soldier Survivability Equip\/Tech Integ).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Dismounted Soldier Survivability Materials"
                                    },
                                    "Description": {
                                        "val": "This effort investigates materials, devices and methods that aid in the design and development of multifunctional materials for Soldier protective clothing and individual equipment. This effort conducts research to investigate and identify multi-functional material properties at the micron and sub-micron level to mitigate Soldiers susceptibility and vulnerability to operational threat, i.e., flame, thermal, environmental, and multispectral sensors. Efforts also investigate and develop devices and systems that enable extended dismounted mission duration by reducing the demand for water resupply and enabling Squad organic water filtration systems"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.722"
                                            },
                                            "Text": {
                                                "val": "Develop and conduct experiments on novel textile architectures and weaves to provide protection against microwave frequency threats through reflection and scattering of directed energy; determine the efficacy of novel sensors that systematically measure heat flux during system and component flame resistance testing to quantify body region burn injuries; and explore materials and processes that enable individual Soldiers to desalinate contaminated water for hydration during emergency and extended semi-independent operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.093"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.093"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments on novel multi-component fiber architectures and fabric treatments to incorporate functionalities for improved durability over the life of the garment, providing more effective protection against operational threats for a longer period; design fibers and fabrics that can transmit power supporting integration of wearable electronics for situational awareness and decreased load; continue to investigate and validate materials and processes that enable individual Soldiers to desalinate contaminated water such that proper hydration levels can be maintained from any indigenous water source."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding in this effort decreased to support higher priority modernization areas of PE 0603118A (Soldier Lethality Advanced Technology) \/ BB3 (Dismounted Soldier Survivability Equip\/Tech Integ)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.224"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BB5"
                    },
                    "ProjectTitle": {
                        "val": "Physical Augmentation: Tech for Human Interactions"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "1.5"
                        },
                        "BudgetYearOne": {
                            "val": "1.499"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.499"
                        },
                        "BudgetYearTwo": {
                            "val": "1.499"
                        },
                        "BudgetYearThree": {
                            "val": "1.499"
                        },
                        "BudgetYearFour": {
                            "val": "1.516"
                        },
                        "BudgetYearFive": {
                            "val": "1.531"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.044"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project H98 Clothing and Equipm Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project advances the understanding of human augmentation and interaction for enhanced operational performance with a focus on adaptation, training, human variability, metrics\/methodologies for assessment, and task quantification. Research encompasses conducting applied research to develop metrics, measures, tools, and techniques to quantify and understand the relationships that enable maximum effectiveness of integrated Soldier-augmentation technologies. The resulting data are the basis for physical augmentation systems and equipment design standards, guidelines, and intelligent agent requirements to improve equipment operation and Soldier-system synergy. Application of this research will yield reduced workload, reduced Soldier training requirements, enhanced Soldier lethality\/survivability, user acceptance, and allow Soldiers to achieve maximum performance. Major efforts explore novel techniques for Soldier assessment, characterization of individual variability effects on performance, development of evidence based design guidance for the application of augmentation technologies, exploration of the relationship of exoskeleton and physical assist device adaptation and baseline Soldier parameters such as gait, neuromuscular motor control and proprioception. This Project will also explore novel training paradigms for reduced Soldier-augmentation technology adaptation times to address current and future warrior performance issues. Individual efforts exploit wearable sensor technologies, translate surrogate task performance to operational outcomes, develop approaches to distinguish tasks and individual state and intent of movement, establish database of human movement variability to inform intelligent system design, and identify high impact applications of augmentation.\n\nWork in this Project supports key Army needs and leverages the technical research of several PEs to include PE 0602143A (Soldier Lethality Technology) \/ Project BC2 (Next Gen Mobility & Lethality Tech for Warfighters), Project BB9 (Human Performance Tech for Mobility & Lethality), Project BC6 (Human Perf - Tech for Warfighter Enhancement), and Project BB7 (Exoskeleton: Technology for Man-Machine Interface); and supports PE 0603118A (Soldier Lethality Advanced Technology) \/ Project BC1 (Human Performance AdvTech for Mobility & Lethality), Project BB6 (Physical Augmentation: Adv Tech for Field Demo), and Project BB8 (Soldier Centric Advanced Technology). Additionally, work in this Project complements and is fully coordinated with the Medical Research and Development Command under the Military Operational Medicine Research Program within PE 0602787A (Medical Technology) \/ Project 869 (Warfighter Health Prot & Perf Stnds), and the Veteran Administration's exoskeleton research area. This Project also complements and is fully coordinated with work performed across Army, Navy, and Air Force under the Reliance 21 Human Systems Community of Interest: Protection, Sustainment, and Warfighter Performance and with our international partners through The Technical Cooperation Program \/ Human Resources and Performance Group \/ Panel JP1 (TTCP HUM JP1).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Training Adaptation and Movement Science"
                                    },
                                    "Description": {
                                        "val": "This effort investigates the science behind movement for physical augmentation to maximize mobility capacity and training adaptation to decrease learning curve with physical augmentation systems (e.g. physical assist devices, exoskeletons). This work will enable the Army to make informed decisions on the ultimate effectiveness of human augmentation technologies before significant resources are expended."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.432"
                                            },
                                            "Text": {
                                                "val": "Conduct experiments to understand how Soldiers adapt to using physical augmentation\/exoskeleton type devices; investigate factors that predict slow vs fast adaptation to design training interventions so physical augmentation systems are utilized optimally for the greatest performance benefit; investigate bio-signals that predict change in human movement to develop design criteria for augmentation systems that are capable of anticipating changes in movement states (e.g. walk to sprint) and adjusting in real time."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.499"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.499"
                                            },
                                            "Text": {
                                                "val": "Will mature design criteria and develop training interventions to optimize physical augmentation systems for the greatest performance benefit; validate design criteria for smart controls of augmentation systems that are capable of anticipating changes in movement states (e.g. walk to sprint) and adjusting in real time based on previously categorized Soldier movement characteristics; conduct experiments that manipulate control parameters of augmentation systems to determine optimal control settings for various tasks and individuals."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.068"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BB7"
                    },
                    "ProjectTitle": {
                        "val": "Exoskeleton: Technology for Man-Machine Interface"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "1.6"
                        },
                        "BudgetYearOne": {
                            "val": "1.599"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.599"
                        },
                        "BudgetYearTwo": {
                            "val": "1.631"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.830"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602716A Human Factors Engineering Technology\n* Project H70 Human Fact Eng Sys Dev"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied research on metrics, measures, tools, and techniques to understand the relationships which enable maximum effectiveness of integrated Soldier-augmentation technologies. The resulting data are the basis for physical augmentation systems and equipment design standards, guidelines, and intelligent agent requirements to improve equipment operation and Soldier-system synergy. Application of this research will yield reduced workload, reduced Soldier training requirements, enhanced Soldier lethality\/survivability, user acceptance, and allows the Soldier and systems to jointly achieve maximum performance. Major efforts explore novel techniques for Soldier assessment, characterization of individual variability effects on performance, and development of evidence based design guidance for the application of augmentation technologies to address current and future warrior performance issues. Individual efforts exploit wearable sensor technologies, translate surrogate task performance to operational outcomes, develop approaches to distinguish tasks and individual state, establish database of human movement variability to inform intelligent system design, and identify high impact applications of augmentation.\n\nResults of these efforts supports key Army needs and leverages the technical research of PEs 0602143A (Soldier Lethality Technology) and 0603118A (Soldier Lethality Advanced Technology). Additionally, this work complements and supports the Medical Research and Development Command under PE 0602787A (Medical Technology), Army Training and Doctrine Command (TRADOC), Human Systems Integration (HSI) Directorate (Army G1), and the Army Test and Evaluation Command (ATEC).  \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Exoskeleton"
                                    },
                                    "Description": {
                                        "val": "This effort will accelerate Soldier lifting and mobility capabilities through applied research on exoskeleton systems with improved safety and reduced training requirements."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.527"
                                            },
                                            "Text": {
                                                "val": "Refine surrogate tasks and associated performance metrics for dismounted operations scenario and begin developing consolidated assessment approach; investigate relationships between human movement variability and performance outcomes for quasi-operational dismounted Soldier tasks; investigate trade-offs between physical task requirements and performance outcomes, and develop approaches to classify and discriminate between tasks to support optimization of intelligent system design and control parameters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.599"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.599"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments with integrated operational scenario and performance metrics for assessment of dismounted Soldier performance; expand models of human movement variability and performance outcomes to inform development of adaptive system designs and control approaches."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.073"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BB9"
                    },
                    "ProjectTitle": {
                        "val": "Human Performance Tech for Mobility & Lethality"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "2.5"
                        },
                        "BudgetYearOne": {
                            "val": "2.997"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.997"
                        },
                        "BudgetYearTwo": {
                            "val": "2.997"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.494"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project H98 Clothing and Equipm Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates human performance based information portrayal system design parameters that integrate mobility & lethality considerations (such as cognitive workload, target discrimination and engagement, and fatigue) into training\/education tools, mission command platforms, and technologies that help Soldiers more rapidly and efficiently acquire complex skills and make decisions quickly from training through mission planning and execution.\n\nWork in this Project directly supports integration of design guidance for multiple PE\/Projects including PE 0603118A (Soldier Lethality Advanced Technology) \/ Project BD7 (Soldier Sys Interfaces\/ Integration-Sensor Adv Tech), Project AY9 (Body Armor & Integrated Headborne Advanced Tech), and Project BC9 (Adv Soldier Sensors\/ Displays AdvTech for Dismounts).\n\nWork in this Project complements and is fully coordinated with the Medical Research and Development Command under the Military Operational Medicine Research Program as well as Defense Medical Research and Development Program under Military Operational Medicine (JPC-5) to include Projects in PE 0602787A (Medical Technology). This Project also complements and is fully coordinated with work performed across Army, Navy, and Air Force under the Reliance 21 Human Systems Community of Interest: Systems Interfaces & Cognitive Processes. Work in this Project supports key Army needs and leverages the technical research efforts at the Simulation and Training Technology Center to support synthetic training environments.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Modernization Strategy and the Soldier Lethality Cross Functional Team (CFT), as well as the Office of the Secretary of Defense's Close Combat Lethality Task Force.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy. \n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Interaction for Situational Understanding"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs, and develops design guidance for information portrayal systems and sub-systems in augmented\/virtual reality that enable Soldiers to make better, faster decisions for close combat operations at the small unit level. This effort also conducts experiments to populate performance models that have application across materiel and non-materiel solutions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.386"
                                            },
                                            "Text": {
                                                "val": "Investigate impact of multimodal cuing (e.g. audio, visual, haptic) in augmented and virtual reality on decision making with navigation and target engagement in simulated operational environments; measure Soldiers response time, cognitive burden, behavioral, physiological and neurophysiological responses to inform what and how information should be portrayed to a Soldier in order for it to be meaningful and actionable."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.997"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.997"
                                            },
                                            "Text": {
                                                "val": "Will investigate the impact of virtual reality and augmented reality design parameters (e.g. graphical level of detail, uncertainty, degraded network conditions, focal depth) on decision-making, situational awareness, and navigation; continue to investigate Soldiers? response time, cognitive burden, and behavioral measures of performance to inform what and how information should be portrayed to a Soldier in order for it to be meaningful and actionable."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase to support increased testing of human situational understanding."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.114"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BC2"
                    },
                    "ProjectTitle": {
                        "val": "Next Gen Mobility & Lethality Tech for Warfighters"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "5.678"
                        },
                        "BudgetYearOne": {
                            "val": "7.514"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.514"
                        },
                        "BudgetYearTwo": {
                            "val": "7.82"
                        },
                        "BudgetYearThree": {
                            "val": "2.594"
                        },
                        "BudgetYearFour": {
                            "val": "2.623"
                        },
                        "BudgetYearFive": {
                            "val": "2.649"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "28.878"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project H98 Clothing and Equipm Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates the means to monitor, assess and predict Soldier and squad shoot and move performance to provide design guidance for individual and mission specific equipment (e.g. individual protection, small arms, load carriage, etc.). Research conducted focuses on translating mission tasks to measures of human performance. These measures of human performance will inform predictive algorithms and human based modeling and simulation that enable Soldier performance trade space analysis for acquisition, training, and operations. These data and algorithms will allow us to determine the impact of new capabilities on Soldier and Squad performance and effectiveness.This Project supports the Measuring and Advancing Soldier Tactical Readiness and Effectiveness (MASTR-E) joint Science and Technology program supported by the Office of the Secretary of Defense Close Combat Lethality Task Force.\n\nWork in this Project supports key Army needs and leverages the technical research of several PE\/Projects to include PE 0602143A (Soldier Lethality Technology) \/ Project BB9 (Human Performance Technology for Mobility & Lethality), and Project BC6 (Human Perf - Tech for Warfighter Enhancement). This Project supports multiple Projects within PE 0603118A (Soldier Lethality Advanced Technology) including Project BB8 (Soldier Centric Advanced Technology), Project BC1 (Human Performance AdvTech for Mobility & Lethality), Project AY9 (Body Armor & Integrated Headborne Advanced Tech), Project AY5 (Soldier Squad Small Arms Armaments Advanced Technology), Project BD7 (Soldier Sys Interfaces\/Integration-Sensor AdvTech), and Project BB6 (Physical Augmentation: Adv Tech for Field Demo).\n\nWork in this Project complements and is fully coordinated with the Medical Research and Development Command under the Military Operational Medicine Research Program as well as Defense Medical Research and Development Program under Military Operational Medicine (JPC-5) to include Projects in PE 0602787A (Medical Technology). This Project also complements and is fully coordinated with work performed across Army, Navy, and Air Force under the Reliance 21 Human Systems Community of Interest: Protection, Sustainment, and Warfighter Performance.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Modernization Strategy, and the Soldier Lethality Cross Functional Team (CFT), as well as the Office of the Secretary of Defense Close Combat Lethality Task Force.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Interaction for Mobility & Lethality"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops human performance based design guidance for protection and weapon systems and sub systems to improve the mobility and lethality of individuals and small units. The applied research translates traditional means for measuring and understanding human performance to the means to conduct assessment for Warfighter and small unit readiness and\/or new capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.421"
                                            },
                                            "Text": {
                                                "val": "Investigate physical and cognitive tolerances and fatigue on task performance with head borne systems with varying weight distribution properties (e.g. moment of inertia, center of gravity, etc.) to inform protective equipment designs; conduct experiments to populate movement & maneuver performance models that integrate with Nett Warrior and other programmed situational awareness systems; investigate, validate, and mature wearable sensor components that are surrogates for tactical tasks of shoot and move in order to provide the means for Soldier and Squad assessment for both training and test & evaluation purposes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.514"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.514"
                                            },
                                            "Text": {
                                                "val": "Will identify, validate, and mature components of innovative wearable sensors and algorithms for monitoring and assessment of situational awareness, cognitive state, and decision-making during critical Soldier tasks to provide the means for Soldier and Squad assessment for both training and test & evaluation purposes; identify predictive measures for Soldier shoot, move, communicate, navigate, and decide tasks during conditions of physical and cognitive stress in future operating scenarios; determine quantitative data and algorithms to populate commander decision aids, a predictive squad performance model, and the Synthetic Training Environment (STE)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned from PE 0602143A (Soldier Lethality Technology) \/ BC3 (Soldier Decision Making & Comms Performance Tech)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.257"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BC3"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Decision Making & Comms Performance Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "10.759"
                        },
                        "BudgetYearOne": {
                            "val": "4.408"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.408"
                        },
                        "BudgetYearTwo": {
                            "val": "4.517"
                        },
                        "BudgetYearThree": {
                            "val": "4.627"
                        },
                        "BudgetYearFour": {
                            "val": "4.712"
                        },
                        "BudgetYearFive": {
                            "val": "4.762"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "33.785"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602716A  Human Factors Engineering Technology\n* Project H70 Human Fact Eng Sys Dev\nPE 0602308A Advanced Concepts and Simulation\n* Project C90 Advanced Distributed Simulation"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied research to create analytical and empirical capabilities to characterize, model, and forecast human behavior related to cyber electromagnetic events through experimentation and field data collection. The result is increased mission effectiveness that enables strong mission command, intelligence operations, and cyber defenses, which lead to high information sharing, situational awareness, and collaboration. Major efforts focus on applied research to understand the conduct of effective cyber electromagnetic operations in that knowledge is required to create and effectively deploy cyber work systems that optimize human-machine interactions and account for operator and adversary behavior to achieve maximum effects. This Project also investigates technologies to quantify, predict, and enhance Squad-level shared Soldiers' situational awareness (SA) and understanding (SU) across volatile, uncertain, complex, and ambitious operating environments leading to demonstrated increases in mission effectiveness. The result of this effort will be systems that use real-time opportunistic measures of Soldier SA to adapt autonomous assets (routes, surveillance targets, etc.) based on dynamic needs of the Soldier\/Squad due to changing mission environment. In addition, this Project will develop novel technologies and approaches to represent uncertain and dynamically changing information in a manner that is effective and quickly understood with reduced Soldier\/Squad burden and minimal training requirements.\n\nResults of these efforts are provided to Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) Program Managers, Human Systems Integration (HSI) Directorate (Army G1), and the Army Test and Evaluation Command (ATEC).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Performance in Sociotechnical Environments"
                                    },
                                    "Description": {
                                        "val": "This research provides human cyber operations assessment and advanced human decision-support capabilities to deploy cyber work systems that optimize human-machine interactions and account for operator and adversary behavior. Without these capabilities, future cyber work systems will be too complex and burdensome for operator use and training resulting in critical bottlenecks as operators have to ?catch-up? with the speed of cyber activity. This research also supports technologies for Squad-level SA assessment (information visualization) that provide command-level decision support with communication and intervention capabilities. Research focuses on algorithms for the quantification and visualization of collective uncertainty at the squad level for mission command decision making. This effort also supports the monitoring and assessing of Soldier tactical readiness and effectiveness through technologies and approaches for opportunistic human sensing."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.27"
                                            },
                                            "Text": {
                                                "val": "Complete work on the mission monitoring and team workflow modeling capabilities effort; develop knowledge engineering (ontologies) and inferencing techniques to enable intelligent systems to draw conclusions about the state of the world and make recommendations for decision making; develop and document knowledge products capturing best-practices for the Cyber Mission Force in response to previously developed cyber-attacks and scenario events; initiate a decision-support technology research effort; create a decision aid to enable individuals and teams to respond more effectively to the cognitive challenges of networked operations and cyber domain by optimizing human-machine interactions; develop initial prototype development by integrating workflow and mission monitoring prototype with data sources; and apply tools in a representative mission environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.96"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.96"
                                            },
                                            "Text": {
                                                "val": "Will develop and document knowledge products capturing best-practices and frameworks for the creation and exploitation of a physiological time-series database to enable Soldier performance prediction; conduct experiments with advanced machine learning algorithms on physiological time-series data to quantify situational awareness and predict performance of the dismounted Soldier\/Squad."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding partially realigned to support the Algorithms for Sensing Soldier in Mission Context and within this Project and PE 0602143A (Soldier Lethality Technology) \/ BC7 (Training Technology (Other than STE))."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Algorithms for Sensing Soldier in Mission Context"
                                    },
                                    "Description": {
                                        "val": "This effort investigates enhanced decision making under conditions of uncertain, complex, time sensitive, and dynamically changing information to optimize human-artificial intelligence (AI) shared situational understanding. Enhances operational performance of individuals and teams of Soldiers through novel visualization technologies that represent complex time-sensitive information in uncertain dynamic environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.448"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.448"
                                            },
                                            "Text": {
                                                "val": "Will develop techniques for customized and intuitive visualizations to translate disparate and uncertain sources of complex, dynamic information into actionable knowledge for improved mission critical decision making."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding partially realigned from the Soldier Performance in Sociotechnical Environments effort in this Project to enable the capability to enhance Soldier decision making by presenting critical data to the right Soldier at the right moment in the mission."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.489"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BC6"
                    },
                    "ProjectTitle": {
                        "val": "Human Perf - Tech for Warfighter Enhancement"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "2.676"
                        },
                        "BudgetYearOne": {
                            "val": "3.023"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.023"
                        },
                        "BudgetYearTwo": {
                            "val": "3.392"
                        },
                        "BudgetYearThree": {
                            "val": "1.418"
                        },
                        "BudgetYearFour": {
                            "val": "1.376"
                        },
                        "BudgetYearFive": {
                            "val": "1.39"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "13.275"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project H98  Clothing and Equipm Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops mechanisms for safely and effectively optimizing and enhancing Warfighter ability to shoot, move, communicate, and decide. These mechanisms have the potential to exploit the Soldier and Squad as the capability platform beyond materiel solutions provided to the individual and small unit. This project also conducts experiments to populate human performance models that enable tradespace analysis for portions of doctrine, organization, training, materiel, leadership and education, personnel and facilities (DOTMLPF) analysis. This Project supports the Measuring and Advancing Soldier Tactical Readiness and Effectiveness (MASTR-E) joint Science and Technology program supported by the Office of the Secretary of Defense Close Combat Lethality Task Force.\n\nThis Project is also fully coordinated and complementary with the following Projects within PE 0602143A (Soldier Lethality Technology) \/ Projects BC2 (Next Gen Mobility & Lethality Tech for Warfighters), BB9 (Human Performance Tech for Mobility & Lethality), and BE3 (Joint Service Combat Feeding Technology). It directly supports the following projects within PE 0603118A (Soldier Lethality Advanced Technology) \/ Projects BC1 (Human Performance AdvTech for Mobility & Lethality), BB8 (Soldier Centric Advanced Technology), BD7 (Soldier Sys Interfaces\/Integration-Sensor AdvTech)), and BE2 (Joint Service Combat Feeding Advanced Technology). It also has potential to inform material solutions within PE 0603118A (Soldier Lethality Advanced Technology) for the Soldier\/Small unit.\n\nWork in this Project complements and is fully coordinated with the Medical Research and Development Command under the Military Operational Medicine Research Program as well as Defense Medical Research and Development Program under Military Operational Medicine (JPC-5) to include Projects in PE 0602787A (Medical Technology). This Project also complements and is fully coordinated with work performed across Army, Navy, and Air Force under the Reliance 21 Human Systems Community of Interest: Protection, Sustainment, and Warfighter Performance. Work in this Project complements and is fully coordinated with research at the US Army Combat Capabilities Development Command Army Research Laboratory (ARL).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Modernization Strategy, and the Soldier Lethality Cross Functional Team (CFT), as well as the Office of the Secretary of Defense Close Combat Lethality Task Force.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Performance Technology for Warfighter Enhancement"
                                    },
                                    "Description": {
                                        "val": "This effort investigates mechanisms for exploiting human physiology to develop safe and effective interventions that create smarter, faster, more lethal Close Combat Warfighters. This work will result in a Soldier's ability to shoot, move, communicate, and decide faster than an adversary. Findings from these experiments will leverage existing systems and platforms to get the greatest human performance return in training and operations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.554"
                                            },
                                            "Text": {
                                                "val": "Conduct neurostimulation experiments to determine efficacy for tactically relevant improvements in skill acquisition and Warfighting tasks; conduct experiments with a benchtop gut microbiome model to identify ration components that use the gut\/brain connection to enhance and inform leap ahead gains in Soldier performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.023"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.023"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments to investigate the trade space for whom, when, and how neurostimulation is effective for improving tactically relevant skill acquisition and performance; compare and validate available neurostimulation systems for administration and efficacy for performance enhancement; validate the individualized Soldier benchtop gut microbiome model to determine inter and intra personnel variations for enabling higher precision recommendations for nutritional interventions that enhance Soldier performance via the gut\/brain connection."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.122"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BC7"
                    },
                    "ProjectTitle": {
                        "val": "Training Technology (Other than STE)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "14.155"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.155"
                        },
                        "BudgetYearTwo": {
                            "val": "14.421"
                        },
                        "BudgetYearThree": {
                            "val": "14.69"
                        },
                        "BudgetYearFour": {
                            "val": "14.83"
                        },
                        "BudgetYearFive": {
                            "val": "14.782"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "72.878"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2021 (FY21) this Project is realigned from:\nProgram Element 0602143A Soldier Lethality Technology\n* Project BC3 Soldier Decision Making & Comms Performance Tech\n* Project BE8 Synthetic Training Environment (STE) Technology\n* Project BE9 STE Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates novel medical training simulations that address all levels of care through improvements in haptic feedback and automated performance assessments in support of Army medical Individual Critical Task Lists (ICTLs). This Project designs and develops early proof-of concept training systems to support non-traditional medical areas, such as dental training simulations. This Project conducts research in immersive virtual, mixed, and augmented reality environments that stimulate human senses (e.g. sight, sound, and touch) and also conducts experiments to understand how users interface with the technology in order to improve the realism of simulation environments and therefore create enhanced immersion and more effective training systems. Research is also conducted to support the modernization of the current Live Training Environment (LTE) to allow fair fight engagements across all training environments and training devices.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States Army Futures Command (AFC) and at the Institute for Creative Technologies (ICT) University Affiliated Research Center (UARC) at the University of Southern California."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Medical Training Technology"
                                    },
                                    "Description": {
                                        "val": "Included in this effort will be the development of new medical training simulations to train medical personnel across all levels of care. Improvements in haptic capabilities will ensure hyper bio-fidelity for all levels of care. Automated measures of student performance will support Army medical Individual Critical Task Lists (ICTLs). Research areas will also include more realistic tissue properties supporting part-task trainers and modular patient simulator systems. Initial exploration of Army ICTLs will result in early proof-of-concept development of proof-of concept training systems to support non-traditional medical areas, such as dental training simulations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.695"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.695"
                                            },
                                            "Text": {
                                                "val": "Will develop haptics capabilities supporting augmented, mixed, and virtual reality by extending sense of hyper bio-fidelity and integrating emerging research into automated objective performance measures supporting Individual Critical Task Lists (ICTLs); develop proof-of-concept training systems to close capability gaps between current simulation technologies and ICTL requirements; validate usability studies and training effectiveness evaluations to gauge value of initial proof-of-concept development efforts; investigate updates to military medical training protocols (e.g., new emphasis on prolonged field care); develop research plans to include proof-of-concept development, usability studies, technology, and training effectiveness evaluations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding partially realigned to PE 0603118A (Soldier Lethality Advanced Technology) \/ BE9 (STE Advanced Technology) to support development of immersive visualization technologies for training."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warfighting M\/S Concepts and Design (ICT)"
                                    },
                                    "Description": {
                                        "val": "This Project designs and develops photorealistic synthetic environments, multi-sensory interfaces, artificially intelligent agents, and human performance assessment technologies to create virtual, augmented, and mixed reality simulation environments for training. This Project uses advanced modeling, simulation, and leadership development techniques to leverage the emerging immersive technologies of industry and the research and development community to advance the Army's capabilities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.27"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.27"
                                            },
                                            "Text": {
                                                "val": "Will conduct research on immersive, virtual, mixed, and augmented reality environments that incorporate senses such as sight, sound, and touch; will develop tools, techniques and technologies to understand how users interface with technology to improve perceptions of immersion in simulated environments to create enhanced realism and more effective training systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding partially realigned to support PE 0602143A (Soldier Lethality Technology) \/ BE8 (STE Technology) to accelerate live training technology."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyberspace Electromagnetic Activities (CEMA) Effects Modeling and Simulation"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops capabilities to more accurately model and simulate Cyberspace Electromagnetic Activities (CEMA) necessary to support training events for Corps and below."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.46"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.46"
                                            },
                                            "Text": {
                                                "val": "Will mature cloud-based network simulation components to support collective Army cyber training events; determine standard data representations to tag information on simulated networks sufficient for training Information Warfare techniques relevant to the conduct of Multi-Domain Operations (MDO); investigate collective training measurement methods for CEMA training assessments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding was partially realigned from PE 0602143A (Soldier Lethality Technology) \/ BC3 (Soldier Decision Making & Comms Performance Tech)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Innovative Synthetic Training Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs methods of applying Artificial Intelligence (AI) into the STE to simulate a fully immersive environment in large urban settings with a population of adaptable, noncombatant virtual human agents for increasing the realism and complexity of training scenarios. In addition, it develops tools, techniques and technologies for improving the immersion of human senses within simulation environments with the goal of creating enhanced realism within the simulated environment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.509"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.509"
                                            },
                                            "Text": {
                                                "val": "Will investigate neural networks and reinforcement learning techniques to simulate a ?fabric of Life? or fully immersive environment in a large urban setting with the population of adaptable, noncombatant virtual human agents to increase the realism and complexity of training scenarios; design and develop photorealistic synthetic environments, multi-sensory interfaces, artificially intelligent agents, and human performance assessment technologies to create virtual, augmented, and mixed reality simulation environments for training; investigate and design techniques and methods for integrating different sensory cues into virtual environments that result in enhanced training and leader development; and validate the design of virtual humans that embody natural language, gesture, gaze, and language understanding to simulate conversational speech within virtual humans."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned from PE 0602143A (Soldier Lethality Technology) \/ BE8 (Synthetic Training Environment Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STE Live Training"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technology to enhance the fidelity of live training systems and investigates future live training capabilities for conducting force-on-force, combined arms exercises to enhance readiness at Army home stations and Combat Training Centers."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.221"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.221"
                                            },
                                            "Text": {
                                                "val": "Will investigate eBullet capability to simulate tactical engagements with realism equivalent (or near) to Infantry weapon systems; investigate capability to simulate combat vehicle ballistic fly-out of munitions to a precise point of impact on target and accurately adjudicate weapon effects based on lethality\/vulnerability models; investigate capability to simulate friendly and enemy combat vehicle vulnerability\/lethality for battle damage assessment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BD1"
                    },
                    "ProjectTitle": {
                        "val": "Adv Soldier Sensors\/Displays Tech for Dismounts"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "4.967"
                        },
                        "BudgetYearOne": {
                            "val": "11.467"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.467"
                        },
                        "BudgetYearTwo": {
                            "val": "12.059"
                        },
                        "BudgetYearThree": {
                            "val": "16.118"
                        },
                        "BudgetYearFour": {
                            "val": "16.298"
                        },
                        "BudgetYearFive": {
                            "val": "16.3"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "77.209"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602709A Night Vision Technology\n* Project H95  Night Vision And Electro-Optic Technology\nPE 0602712A Countermine Systems\n* Project H24 Countermine Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops low power, next generation modular sensor and display components for detection and identification of both threats and friendlies in all environments. Work in this Project supports the Army Science and Technology Soldier Lethality, Next Generation Combat Vehicle, and Future Vertical Lift modernization priorities as well as the Soldier Lethality Cross Functional Team (CFT) effort.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. All FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Soldier Sensors\/Displays Technology for Dismounts"
                                    },
                                    "Description": {
                                        "val": "This effort models, simulates, investigates, designs, and develops novel low power, modular electro-optic \/ infrared (EO\/IR) and explosive hazard (EH) technologies, displays, augmented reality approaches and aided\/automatic target detection and recognition algorithms that enable improved Soldier maneuver and lethality through greater information fidelity and automated algorithms to increase Soldier probability of recognition\/identification and tracking of all threats. This effort is coordinated with PE 0603118A (Soldier Lethality Advanced Technology), PE 0603462A (Next Generation Combat Vehicle Advanced Technology), PE 0603463A (Network C3I Advanced Technology), PE 0603465A (Future Vertical Lift Advanced Technology), and PE 0602145A (Next Generation Combat Vehicle Technology)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.741"
                                            },
                                            "Text": {
                                                "val": "Develop methods to model and simulate EO\/IR system performance for computer-aided prototyping design models and augmented reality applications; model emerging active and passive EO\/IR technologies, applications, and threats (e.g. hostile fire and unmanned aerial systems) to support sensor system designs and combinations; investigate target acquisition performance measures to address EO\/IR signature countermeasures; and validate performance of novel augmented and mixed reality software in a variety of environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.467"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.467"
                                            },
                                            "Text": {
                                                "val": "Will validate computer-aided prototyping design models and augmented reality (AR) applications; develop synthetic image generation techniques to enable optimized designs of advanced electro-optic \/ infrared (EO\/IR) sensors and algorithms; mature components of virtual prototyping capabilities to support validation of sensor performance against various threats; model performance of advanced low-light sensors in multiple, simulated battlefield conditions; investigate designs for backside illuminated silicon (BSI) complementary metal-oxide-semiconductor (CMOS) to validate approaches for improved quantum efficiency (QE) in near-IR for advanced low light level imaging; develop low power, high performance application specific integrated chips (ASIC) to reduce the size, weight, power, and cost of solid state low light level sensors; develop readout integrated circuits (ROICs) with pixel bins that provide high resolution, high definition imagery in darkest conditions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in funding from PE 0603118A (Soldier Lethality Advanced Technology) \/ BC9 (Adv Soldier Sensors\/Displays AdvTech for Dismounts) to support acceleration of advanced low light sensors."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.226"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BD6"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Sys Interfaces\/Integration- Sensor Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "1.124"
                        },
                        "BudgetYearOne": {
                            "val": "1.119"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.119"
                        },
                        "BudgetYearTwo": {
                            "val": "0.92"
                        },
                        "BudgetYearThree": {
                            "val": "0.966"
                        },
                        "BudgetYearFour": {
                            "val": "0.796"
                        },
                        "BudgetYearFive": {
                            "val": "0.804"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.729"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project H98 Clothing & Equipm Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, designs, and validates advanced technologies and algorithms for enhancing dismounted Soldier deployed robotics and autonomous systems used to improve the Small Unit's situational awareness, survivability, and lethality. Technologies to be investigated may include: algorithms for dismounted robotic systems to enable autonomous navigation, automated object recognition, persistent surveillance, launch and recovery from vehicles, networked lethality, manned- unmanned teaming, and collaborative behaviors; and advanced user interfaces to optimize human-robotic interaction during dismounted operations. These advanced technologies will enable Squad and Platoon level autonomous reconnaissance using robotic systems to minimize the operator's dedicated control of the systems and reduce their cognitive burden, thus allowing Soldiers to be more lethal and survivable.\n\nWork in this Project supports key Army needs and leverages the technical research of several PEs to include PE 0603118A (Soldier Lethality Advanced Technology) \/ Project BD7 (Soldier Sys Interfaces\/Integration-Sensor AdvTech) and Project BC9 (Adv Soldier Sensors\/Displays AdvTech for Dismounts).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier System Interfaces & Integration (Sensor Technology)"
                                    },
                                    "Description": {
                                        "val": "This effort will investigate, design, and validate advanced dismounted Soldier robotic and autonomous systems technologies to enable autonomous navigation, manned-unmanned teaming, and networked reconnaissance to improve Soldier lethality, situational awareness, and survivability during tactical operations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.073"
                                            },
                                            "Text": {
                                                "val": "Investigate and develop algorithms for dismounted Small Unit level Small Unmanned Aerial Systems (SUAS) to enable autonomous operations; investigate and design soldier-robotic user interfaces to minimize soldier dedicated control of robotic assets; investigate and develop modular robotics architectures to allow for a common platform to conduct validation of algorithms and enable integration of third party software and hardware components; and validate emerging technologies in controlled laboratory and simulated environments to assess functionality, reduce risk, and improve system design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.119"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.119"
                                            },
                                            "Text": {
                                                "val": "Will investigate, design, and develop autonomous navigation algorithms, such as obstacle avoidance algorithms for fast flights and operations during night, to enhance the movement and maneuver of dismounted Small Unmanned Aerial Systems (UAS); investigate, design, and develop autonomous search and sensing algorithms to enable resource constrained Small UAS to perceive, detect, identify, and recognize objects in the environment; investigate, design, and develop mission and path planning algorithms and associated user interfaces for autonomous Small UAS; investigate, design, and develop algorithms to enable precision landing, recharging, and launch capabilities for Small UAS to enable extended operations; validate functionality of algorithms on open architecture Small UAS platforms in laboratory and simulated environment to reduce risk and improve system design."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.051"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BD8"
                    },
                    "ProjectTitle": {
                        "val": "Soldier & Sm Unit Tactical Energy Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "9.145"
                        },
                        "BudgetYearOne": {
                            "val": "9.043"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.043"
                        },
                        "BudgetYearTwo": {
                            "val": "9.154"
                        },
                        "BudgetYearThree": {
                            "val": "11.424"
                        },
                        "BudgetYearFour": {
                            "val": "11.574"
                        },
                        "BudgetYearFive": {
                            "val": "11.691"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "62.031"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602705A Electronics and Electronic Devices\n* Project H11 Tactical and Component Power Technology \n* Project H94 Elec & electronic Dev"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied research and development on materials and component level power and energy technologies in the areas of energy storage, power generation, alternative energy, and intelligent power distribution and thermal management designs that support Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) and Soldier power needs to include next generation squad weapons and advanced optical devices and sensors. Enables future Soldier lethality and mobility for longer mission durations at lighter weights to provide enhanced lethality and tactical overmatch of adversaries, and to reduce the burden on the Soldier. \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Power for Soldier Lethality"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs, and develops innovative materials and component level power generation and energy storage technologies that support next generation weapons, sensors, radios, and human augmentation devices enabling Soldiers and Small Units to maximize probability of target hits, improve collective situational awareness, ensure multiple communication streams, and assist with tactical tasks in order to decrease Soldier load and power burden, and increase power capabilities by providing more energy to prolong mission run-time."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.692"
                                            },
                                            "Text": {
                                                "val": "Conduct lab-based experiments on advanced cathode materials and pairings to assess its ability to increase the runtime of Soldier borne devices in small, lightweight, flexible form factors; optimize Silicon Anode materials for both primary and rechargeable configurations to enable greater energy densities from 300-500 WH\/Kg for Soldier and Small Units that require more Power & Energy, with longer runtimes, in distributed operations, with limited resupply; investigate and develop small, power generation devices that are powered by logistically available fuels to enable integrated Soldier borne\/operated sensors and radios for critical applications; assess small, electromechanical components with greater efficiency and power density to support Soldier and Squad level battery recharging; investigate recoil, thermal and acoustic energy harvesting technologies that scavenge unused signatures from the Next Gen Squad Weapon to provide power for fire control technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.695"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.695"
                                            },
                                            "Text": {
                                                "val": "Will develop Si-Anode based buttstock batteries (BSBs) for the Next Gen Squad Weapon that minimize weight and maximize energy; conduct component level Technology Readiness Level 5 verification and validation of these high capacity batteries in a laboratory environment; investigate advanced energy storage and power generation materials and components specifically targeted at increasing runtimes of digital Soldier devices; investigate energy storage, weight distribution, power distribution, and safety for the next generation squad weapons power\/data rail and native battery; investigate advanced cathode materials and pairings to determine increase on the runtime of Soldier borne devices in small, lightweight, flexible form factors; mature components of small, power generation devices powered by logistically available fuels to enable integrated Soldier borne\/operated sensors and radios for critical applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials & Component Technologies for Energy Independence"
                                    },
                                    "Description": {
                                        "val": "The effort develops technologies to substantially reduce the number of batteries required to accomplish dismounted Soldier\/Squad mission objectives by developing more efficient power and thermal management for small systems and harvesting energy and alternative energy technologies thereby significantly reducing Soldier-borne load and logistics requirements for Soldier\/Squad power and energy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.037"
                                            },
                                            "Text": {
                                                "val": "Develop aqueous electrolytes and other high voltage electrolytes\/additives for conformal, flexible, safe, abuse tolerant lithium ion and lithium metal batteries; research and develop a multifuel-fired power generator with high fuel efficiency and reduced noise signatures, emphasizing logistics fueled heat source, thermal selective emitter and photovoltaic cell; develop and design inductors and other power components using novel materials; explore technologies to harvest electrical power by converting and storing energy via kinetic, elastocaloric thermal materials and catalytic synthesis of fuel-like chemicals from indigenous resources; develop more efficient catalysts for carbon dioxide electroreduction to useful energy carriers; and develop higher efficiency plasmonic catalysts to catalyze the breakdown of fuels to produce usable energy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.348"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.348"
                                            },
                                            "Text": {
                                                "val": "Will investigate optimized coupling between multifuel-fired heat sources and thermophotovoltaic converters for portable multifuel-fired power generators; research and develop multiplexed micro reactors and investigate at different scales for wearable or portable multifuel-fired power generator heat sources; develop flexible and safe aqueous\/gel batteries and validate use in diversified application platforms for follow-on robustness studies; investigate the solvation, transport, liquid structure, and interface\/interphase of multivalent cation electrolytes; further extend the new halide-graphite intercalation chemistry to multivalent cations; investigate devices based on a series of new materials and chemistries in both aqueous, non-aqueous, and hybrid systems; investigate reversible Martensitic phase transformations in solid-state cooling materials such as nickel-titanium alloys and new architectures, and conduct experiments with advanced characterization techniques to enable future high-performance and silent operation for applications related to directed energy, pulse power, and Soldier wearable cooling; fund research on blue whirl combustion technology for harvesting energy from a broad range of liquid fuels at a much higher efficiency than currently possible; determine new catalytic materials and pyrolysis reactor process in one-step to produce useful chemicals\/fuels as energy scavenger for compact energy power sources for robotic autonomous systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.416"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BE1"
                    },
                    "ProjectTitle": {
                        "val": "Support Technology to Mission Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0.726"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.726"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project XW5 Small Unit Expeditionary Maneuver Technology\n\nIn FY21 this Project is being realigned to:\nPE 0602146A Network C3I Technology\n* Project AQ9 Expeditionary Data to Decisions Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and designs technologies that support Soldier\/Small Unit survivability, mobility, and combat effectiveness during mission command operations at operational and tactical levels in lethal and contested environments, enabling decentralized and dispersed operations in the future operating environment. This Project designs innovative mission command node platforms with enhanced mobility and agility, increased protection and survivability against electro-magnetic interference (EMI) and other threats, and rapid movement and emplacement, resulting in increased lethality and coordination of dispersed formations during operations and supporting resilient formations in multi-domain operations. Component technologies designed under this Project will transition to Advanced Technology Development efforts in the Soldier Lethality Modernization priority in support of decentralized and dispersed mission command operations in future operating environments and expeditionary maneuver in the Multi-Domain Operations Environment. \n\nWork in this Project supports key Army needs and leverages\/complements the technical research of several PEs to include PE 0601102A (Defense Research Sciences), and the following Projects within PE 0602143A (Soldier Lethality Technology): Project BB4 (Dismounted Soldier Survivability Materials), Project BD8 (Soldier & Sm Unit Tactical Energy Tech), Project AZ9 (Soldier Protection Advanced Tech - Detectability), PE 0603118A Soldier Lethality Advanced Technology \/ Project AZ8 (Soldier - Small Unit Detectability Adv Technology) and PE 0602712A (Countermine Systems) \/ Project H35 Camouflage and Counter-Recon Tech).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Small Unit Expeditionary Mission Command Research"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs components of agile, modular, non-traditional Command Post platforms designed to enable the mission command network, supporting decentralized and distributed mission command operations in the future operating environment. Investigates material node platforms and other component concepts supporting rapid emplacement and displacement with enhanced survivability, mobility, signature management protection, and secured\/non- degraded communication capabilities. Investigates and conducts experiments to validate component performance in a multi- domain battle operations. The large-footprint and logistics-intensive nature of current mission command systems compromise Soldier Lethality and mission effectiveness and do not provide the enhanced mobility and protection necessary to effectively execute mission command operations in the extremely expeditionary, multi-domain environment of the future. This research effort will enable tactical leaders to make timely decisions, integrate more seamlessly into the battlefield through a decrease in size, signature, and logistics burden, and will increase both maneuverability and survivability by enabling the development of agile Command Posts that support Multi-Domain Operations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.693"
                                            },
                                            "Text": {
                                                "val": "Investigate tactical Command Post design and component concepts to identify individual component metrics that support mission command effectiveness based upon critical operational partner needs such as rapid emplacement, displacement and survivability in the future operating environment; conduct experiments on Command Post components for EMI protection and secure communications to validate component performance to allow defeat of adversary efforts to disrupt mission command operations, as well as to open and retain windows of advantage in the multi-domain environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding in this effort was realigned to PE 0602146A (Network C3I Technology) \/ AQ9 (Expeditionary Data to Decisions Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.033"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BE3"
                    },
                    "ProjectTitle": {
                        "val": "Joint Service Combat Feeding Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "3.996"
                        },
                        "BudgetYearOne": {
                            "val": "4.109"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.109"
                        },
                        "BudgetYearTwo": {
                            "val": "4.073"
                        },
                        "BudgetYearThree": {
                            "val": "4.764"
                        },
                        "BudgetYearFour": {
                            "val": "4.817"
                        },
                        "BudgetYearFive": {
                            "val": "4.817"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "26.576"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project H99 Joint Service Combat Feeding Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops nutrient compositions and stabilization techniques to maximize the Warfighter's physical and cognitive performance on the battlefield, investigates technologies to enhance detection and identification capabilities of chemical and biological threats in foods, and develops innovative ration and field feeding technologies to reduce resupply requirements for the multi-domain battlefield. The Army serves as the Executive Agent for this Department of Defense (DoD) program, with oversight and coordination provided by the DoD Combat Feeding Research and Engineering Board.\n\nWork in this PE is related to and fully coordinated with PE 0602787A (Medical Technology) \/ Project 869 (Warfighter Health Prot & Perf Stnds) to develop technologies and concepts; Army Additive Manufacturing Community of Practice to enable customization, increase readiness, and improve sustainment due to fabrication of end-use items at point of need; Office of the Assistant Secretary of Defense (OASD) Applied Research for Army Priorities (ARAP) to transition and develop materiel solutions in the synthetic biology and microbiome technical areas; Defense Health Agency (DHA) Joint Program Committee-5, which seeks to develop effective nutritional countermeasures against stressors and to maximize health, performance, and well-being; and Office of Navy Research (ONR) PE 0601153N Defense Research Sciences Biosciences program to evaluate nutritional countermeasures to physiological environmental extremes.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Service Combat Feeding Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs, and develops nutrient compositions and stabilization techniques to maximize the Warfighter's physical and cognitive performance on the battlefield. The effort investigates technologies to enhance detection and identification capabilities of chemical and biological threats in foods and develops innovative ration and field feeding technologies to reduce resupply requirements. Work in this area results in increased performance, less food-borne illness, and overall increased readiness of the Warfighter."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.815"
                                            },
                                            "Text": {
                                                "val": "Identify and test nutritional interventions that prevent performance decrements associated with known degraded immune function and consequential weight loss in extreme environments; identify and test novel prophylactic nutrition to mitigate or prevent cause of illness in deployed troops globally such as gastrointestinal dysbiosis that affects operational readiness; investigate and design nutrient stabilization techniques to retain or improve quality of products when stored\/utilized in environmental extremes and multi-domain battlefields to ensure that nutrients required for optimal performance are both retained and are bioavailable at the point of consumption; transition weight reduction concepts for Close Combat Assault Ration formulations for advanced technology demonstration; investigate chemical agent permeability in ration packaging in support of Chemical Biological Radiological Nuclear and Energy (CBRNE) threats; transition novel energy ration components to advanced development; develop and model food formulations that retain desired sensory and organoleptic (appearance, odor, flavor, texture) characteristics after processing, storage and distribution to enable the customization of nutrients tailored to each individual warfighter?s need based on real time health status and operational scenario for rapid recovery and\/or mission preparation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.109"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.109"
                                            },
                                            "Text": {
                                                "val": "Will continue investigation of nutritional factors affecting immune function and muscle recovery, and perform ex-vivo experimentation to identify gut microbiome effects on immune, gastrointestinal, and neurological health for preventing performance decrements in deployed troops; validate lipid oxidation analysis techniques to improve monitoring ability in ration components and ensure optimized nutrition; identify effects of high fat intake on physical performance to ensure optimal nutrient profiles in weight reduced rations; investigate microbial response to vacuum microwave drying and antimicrobials effects on Salmonella to maintain food safety; mature component technologies for reagent-less biosensors to decrease logistical burdens in multi-domain operations; continue investigation of food product production with additive manufacturing; and design and develop ration packaging system to improve cost and efficiency."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.181"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BE6"
                    },
                    "ProjectTitle": {
                        "val": "Reactive\/Resp Surfaces & Matls-Soldiers & Sys"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "2.745"
                        },
                        "BudgetYearOne": {
                            "val": "6.317"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.317"
                        },
                        "BudgetYearTwo": {
                            "val": "3.021"
                        },
                        "BudgetYearThree": {
                            "val": "3.153"
                        },
                        "BudgetYearFour": {
                            "val": "3.555"
                        },
                        "BudgetYearFive": {
                            "val": "3.591"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "22.382"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602105A Materials Technology\n* Project H84 Materials"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs, fabricates, and assesses a variety of bio-based materials through the application of biotechnology advances to develop material capabilities that respond and adapt to a wide range of external stimuli and biological processes for protection, situational awareness, and sustainment. Innovative materials will be sought that are capable of sensing and responding, as well as adapting response, to a broad spectrum of environmental variables. Research will develop materials that are able to self-monitor, self-heal, and self-sustain. Research will explore new biology-based methods for controlled synthesis and assembly to create materials with precise chemistries, microstructures, properties, and responsive functionalities through controlled molecular placement, spatial architectures, and interfacial structures. These materials have potential to enable more survivable, situationally aware, lighter weight Soldier systems and electronics. Research conducted focuses on unique and\/or novel material properties, developing models, materials characterization techniques, non-destructive testing methods and advanced fabrication\/processing methodologies.\n\nWork in this PE complements PE 0601102A (Defense Research Sciences) \/ Project AA3 (Single Investigator Basic Research), Project AA3 (Single Investigator Basic Research), Project AA7 (Mechanics and Ballistics), and Project AA5 (Biotechnology and Systems Biology) and informs PE 0603118A (Soldier Lethality Advanced Technology) \/ BB3 (Dismounted Soldier Survivability Equip\/Tech Integ).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Bio-enabled Materials and Processes"
                                    },
                                    "Description": {
                                        "val": "This effort conducts applied research through the application of biotechnology advances to develop materials with capabilities to respond and adapt to a wide range of external stimuli and biological processes. Investment in bio-enabled materials research allows for the design of materials that are capable of sensing and responding, as well as adapting to a broad spectrum of environmental variables with the ability to self-monitor, self-heal, and self-sustain. Investments in this area could lead to future applications in Soldier performance, situational awareness, protection and sustainment. Research from this effort has potential to transition to multiple end items and applications."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.621"
                                            },
                                            "Text": {
                                                "val": "Investigate the integration of rapidly selected peptide reagents for applications in improved sensors for human performance and situational awareness; investigate a more information-driven peptide reagent design process drawn from previous studies; and design and synthesize biological materials, including a focus on diatoms for improved logistics, increased robustness and new capabilities in gradient \/ hierarchical materials with nanoscale resolution of features to control optical, structural and reactive performance for potential application in adaptive coatings for vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.984"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.984"
                                            },
                                            "Text": {
                                                "val": "Will investigate chemically and structurally diverse biological building blocks (peptide-based) for advanced sensing applications, protection, and interface\/assembly of hierarchical materials; investigate advanced coatings and materials assembly utilizing bio-derived and bio-composite materials for advanced sensing and protection (e.g. situational awareness, counter-biocorrosion, and biological inhibitors) and electro-magnetic applications such as antennas, lenses, and optically triggered skins\/coatings; identify targets and design strategy for accelerated degradation of high value assets (electronic components, protective coatings), logistics reduction (e.g., accelerated repair and reclamation of rare-earth elements), and next generation anti-tamper technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase to further investigate novel molecular biology."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.124"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Scalable and On-Demand Production of Novel Molecules"
                                    },
                                    "Description": {
                                        "val": "This effort conducts applied research through the investigation of new methods to produce novel biological molecules. Typical customized molecule production is extremely expensive and difficult to achieve. Investment in synthetic biomanufacturing techniques will further the applicability and widespread use of novel molecules to further Warfighter performance."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.333"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.333"
                                            },
                                            "Text": {
                                                "val": "Will investigate computational and experimental tools facilitating the use of molecular biology to produce novel molecules of interest."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase to maximize gains from unanticipated acceleration in this technology area."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BE8"
                    },
                    "ProjectTitle": {
                        "val": "Synthetic Training Environment (STE) Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "15.438"
                        },
                        "BudgetYearOne": {
                            "val": "14.133"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.133"
                        },
                        "BudgetYearTwo": {
                            "val": "16.207"
                        },
                        "BudgetYearThree": {
                            "val": "15.787"
                        },
                        "BudgetYearFour": {
                            "val": "15.963"
                        },
                        "BudgetYearFive": {
                            "val": "15.964"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "93.492"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602308A Advanced Concepts and Simulation\n* Project C90 Advanced Distributed Simulation\n* Project D02 Modeling and Simulation For Training And Design\nPE 0602716A Human Factors Engineering Technology\n* Project H70 Human Factors Eng Sys Dev"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops technologies supporting the Army's Synthetic Training Environment (STE).  The Synthetic Training Environment (STE) is the next generation holistic collective training capability that will train units where they will fight, with whom they will fight with, and in complex operational environments to include dense urban and sub-terrain; within the entire range of combined arms maneuver tasks in support of Multi- Domain Operations. STE Information Systems (STE-IS) delivers the Common Synthetic Environment consisting of Global Terrain\/One World Terrain (OWT), Training Simulation Software (TSS), and Training Management Tools (TMT). The STE will be available where training occurs (home station, combat training centers, armories, institutions, shipboard, deployed) and will include Air and Ground Reconfigurable Virtual Collective Trainers (RVCTs), a Soldier\/Squad Virtual Training (S\/SVT), and a live training capability. The STE will be cloud-enabled, compatible with the Army Enterprise Network, and service-based through the Common Operating Environment, including Live and Constructive. The STE will provide the realistic repetitions necessary to fight 25 bloodless battles before the first battle; a Secretary of Defense priority.  \n\nThis effort is coordinated with work done in PE 0603118A (Soldier Lethality Advanced Technology) \/ Project BE9 (Synthetic Training Environment (STE) Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Modernization Strategy and supports the STE Cross Functional Team efforts.\n\nWork in this Project is performed by the United States Army Futures Command (AFC) and at the Institute for Creative Technologies (ICT) University Affiliated Research Center (UARC) at the University of Southern California"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Innovative Synthetic Training Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs methods of applying Artificial Intelligence (AI) into the STE to simulate a fully immersive environment in large urban settings with a population of adaptable, noncombatant virtual human agents for increasing the realism and complexity of training scenarios. In addition, develops tools, techniques and technologies for improving the immersion of human senses within simulation environments with the goal of creating enhanced realism within the simulated environment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.845"
                                            },
                                            "Text": {
                                                "val": "Investigate artificially intelligent individuals and groups of virtual humans as role-players to support increased scenario complexity and social interactions with trainees and reduce the need for costly live role-players and simulation support teams; develop artificially intelligent virtual humans with adaptable human behaviors driven by their own beliefs, desires, and intentions; apply methods for natural language understanding allowing for social dialogue with the virtual humans.  Expand and apply knowledge in cognitive architectures, social simulations, and virtual human research areas to provide design, development, and improvement of new technology products focused on the accurate and immersive inclusion of the human dimension in virtual and mixed reality context."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned to PE 0602143 (Soldier Lethality Technology) \/ BC7 (Training Technology (Other than STE))."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STE One World Terrain"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs tools and methods to improve the speed and fidelity of a terrain capability that provides a representation of the globe, fully accessible through the Army network and usable by all simulation trainers; develops complex representations (including megacities and subterranean) of the operational environment and the Multi-Domain battlefield in synthetic training environments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.934"
                                            },
                                            "Text": {
                                                "val": "Research alternative data sources for applicability to modeling & simulation (M&S), with emphasis on providing accurate representation (geometry) and visuals (quality at ground level); investigate alternative data sources to improve availability of rich data for next-generation terrain representation; research data fusion techniques by exploiting data sources and processed data to demonstrate a behavior pattern of disparate data over the same geographic area, initiating the need for automated processes to combine and de-conflict different data into a single, consistent dataset for end-use applications; and develop tools and procedures for merging data sources into a single, consistent dataset."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.832"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.832"
                                            },
                                            "Text": {
                                                "val": "Will develop a whole world terrain at low to medium resolution using available data; evaluate alternative data sources to fill gaps; develop tools to rapidly process source data into a single representation that serves all application needs; develop and investigate a processes for generating fully attributed hi-resolution terrain insets such as underground geometry, key civilian infrastructure components, complex road networks, hydrological features, and complex structures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase to further experiments testing the data gathering and integration necessary to build the One World Terrain."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STE Training Management Tool"
                                    },
                                    "Description": {
                                        "val": "This effort investigates Adaptive Training (AT) methods to facilitate authoring, distribution, management, and evaluation of tailored instruction for both individuals and teams; and evaluates the impact of training and educational tools \/ methods on comprehension, reasoning, learning, performance, retention, and transfer of knowledge and acquired skills to assess Training Effectiveness (TE) in Synthetic Training Environments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.958"
                                            },
                                            "Text": {
                                                "val": "Validate a base authoring concept for adaptive training; expand concepts for authoring tools, team modeling, team instruction, and Army team domains to support the development of team (unit level) tutoring systems; mature training strategies for autonomous software systems; and develop tools to rapidly author scenario variants to customize training. Develop models and tools for automated measurement of critical training outcomes for selected individual and collective tasks; and explore and identify new sensors for measuring effectiveness in collective training events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.291"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.291"
                                            },
                                            "Text": {
                                                "val": "Will design and develop natural language artificial intelligence (AI) processing techniques for small team verbal communications during task execution; develop proof of principle for automating team performance assessments and for actionable automated after action review (AAR) feedback to teams, leaders, and instructors; develop a robust intelligent team adaptive training capability to maximize training outcomes at point of need; develop AI methods grounded in learning science to support self-optimizing systems that produce skill retention and transfer into the operational environment; conduct experiments to validate team performance measures; assess the effectiveness of different machine learning approaches to facilitate automated authoring of scenario based training for individuals and teams; develop models for assessing competencies of individuals and teams using a combination of live, virtual, and constructive training events in militarily relevant domains; investigate the use of physiological measures as a means of improving automated adaptation of training and for assessing training outcomes, predicting training transfer, and providing real-time feedback to instructors and students during the execution of individual and collective training."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STE Training Simulation Software"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops technologies that support Multi-Domain Operations modeling and maturing of simulation configuration and scalability components for collective training. In addition, designs and develops technologies that allow the synthesis of robust military behaviors that enable the scaling of Synthetic Training Environment (STE) collective training configurations and delivery to the Point of Need through the exploitation of emerging computing and networking technologies that optimize computing architectures for integrating components (models, behaviors, data, etc.) of the Training Simulation Software (TSS)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.01"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.01"
                                            },
                                            "Text": {
                                                "val": "Will investigate autonomous, artificially intelligent agents that adapt to changing battlefield conditions, friendly forces, non-combatants, and enemy threats in a military relevant virtual training environment; investigate multi-resolution modeling applications such as Live, Virtual, and Constructive (LVC) experimentation utilizing AI enabled attributes; and design and develop cutting-edge M&S methods to enable the reuse and development of new Army and Department of Defense (DoD) STE-ready models for Multi-Domain Operations in support of System of Systems (SoS) analysis, experimentation, technology tradeoffs, capability assessments, concept development, and training."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased from PE 0602145A (Next Generation Combat Vehicle Technology) \/ BF6 (Crew Augmentation and Optimization Tech) to support AI based development efforts for intelligent character behaviors."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.701"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BP9"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Lethality Technologies (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "30.626"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "30.626"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional Interest Item funding provided for Soldier Lethality Technologies."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project is for congressional increases that support applied research in support of Soldier Lethality, where the Soldier and Squad are treated as an integrated combat platform.  The  fundamental challenge is to overcome an erosion in close combat overmatch relative to the pacing threats identified in the National Defense Strategy.  This program increase leverages science, technology, and human potential to achieve the overmatch necessary to maneuver, isolate, and defeat our adversaries in any environment."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Medical simulation and training"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3.626"
                                        },
                                        "Text": {
                                            "val": "Medical simulation and training"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active and passive camouflage concealment and deception"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Active and passive camouflage concealment and deception"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human systems integration"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Human systems integration"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Expeditionary mobile base camp technology"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Expeditionary mobile base camp technology"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SOCOM communications capability"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2.5"
                                        },
                                        "Text": {
                                            "val": "SOCOM communications capability"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Lethality Technologies Program Increase"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Soldier Lethality Technologies Program Increase"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Harnessing Emerging Soldier Lethality Technology Research"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.5"
                                        },
                                        "Text": {
                                            "val": "Harnessing Emerging Soldier Lethality Technology Research"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BR9"
                    },
                    "ProjectTitle": {
                        "val": "Personnel & Airdrop Safety Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "4.098"
                        },
                        "BudgetYearOne": {
                            "val": "3.725"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.725"
                        },
                        "BudgetYearTwo": {
                            "val": "3.519"
                        },
                        "BudgetYearThree": {
                            "val": "3.951"
                        },
                        "BudgetYearFour": {
                            "val": "3.615"
                        },
                        "BudgetYearFive": {
                            "val": "3.615"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "22.523"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A  Warfighter Technology \n* Project XW5  Small Unit Expeditionary Maneuver Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project funds the research and investigation of component technologies to enhance cargo and personnel airdrop capabilities for global precision delivery, rapid deployment, and insertion for force projection into hostile regions. Areas of emphasis include parachute technologies, parachutist injury reduction, precision offset aerial delivery, soft landing technologies, and airdrop simulation. Technologies support the Soldier Lethality Army Modernization Priority. New operational concepts call for increased precision of personnel and cargo in austere environments in which small units are dispersed and logistical supply is limited. The Army requires enhanced payload extraction and other increased capabilities to support the airdrop requirement for current and future vehicles exceeding aircraft payload weight capacity. TheU.S.  Army Airborne Board (Chaired by the XVIII Airborne Corps Commanding General) identified increased payload capabilities as a critical requirement to support the mission readiness profile for the Global Response Force (GRF), and will support Joint Forcible Entry requirements while maximizing the capacity of a C-17 aircraft.\n\nWork in this Project supports key Army needs and complements the technical research of several PEs to include PE 0601102A (Defense Research Sciences), PE 0602143A (Soldier Lethality Technology) \/ Project BD6 (Soldier Sys Interfaces\/ Integration- Sensor Tech), and PE 0603118A (Soldier Lethality Advanced Technology) \/ Project BE5 (Personnel & Airdrop Safety Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Personnel & Airdrop Safety Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies that enhance payload extraction, which will allow current vehicles to be dropped with more armor and support equipment, and reduce the design constraint on future vehicles that have airdrop as an operational requirement, increase parachute gliding capabilities, and mature delivery accuracy of cargo aerial delivery systems that support varying payload weights. Research in the area of novel parachute materials will provide increased capabilities for cargo and personnel aerial delivery systems. This effort will support an investigation of new Modeling and Simulation (M&S) tools in order to develop validation methods for airdrop concepts. This effort also investigates technologies that advance airborne personnel insertion safety requirements to modernize the Airborne Soldier and provide the ability to effectively execute the airborne mission through reducing safety risk and increasing capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.912"
                                            },
                                            "Text": {
                                                "val": "Explore multi-modal sensing methods and control techniques to study the efficacy of precision aerial delivery via a variety of decelerator systems deployed via conventional and non-traditional methods in GPS denied\/degraded and anti-access \/ area denial (A2\/AD) environments to address future operational challenges; investigate augmentation of personnel airdrop systems to enhance airborne jumper performance while expanding operational footprint opportunities; conduct experiments fundamental to understanding aerodynamic characteristics of airdrop systems; and develop advanced modeling techniques applicable to the full spectrum of the acquisition process to improve airdrop safety and reduce the cost of future development efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.725"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.725"
                                            },
                                            "Text": {
                                                "val": "Will conduct research into sensing technologies that augment personnel or autonomous cargo airdrop systems, enabling accurate, reliable insertion and resupply missions across a broad scope of operational conditions and non-traditional airdrop environments; examine new parachute designs and avionics necessary to facilitate maximum mission effectiveness conducted across an array of technologies and modalities using analytical, numerical, and experimental methods."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.186"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}