{
    "id": "2021-AirForce-PB-3600-JBOOK-92b46cd12ef50ea764b60089f2b7a79948671e66250d4f7c6be7e00a142e885b-31",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V1-U_RDTE_JustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603605F"
        },
        "ProgramElementTitle": {
            "val": "Advanced Weapons Technology"
        },
        "R1LineNumber": {
            "val": "32"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "39.438"
            },
            "CurrentYear": {
                "val": "37.404"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program provides for the development, integration, demonstration, and detailed assessment of directed energy (DE) weapon technologies for potential application on Air Force platforms. These include high energy laser (HEL), high power microwaves (HPM),  and other unconventional weapon generation and transmission technologies, which can support a wide range of Air Force applications. The program develops a corresponding susceptibility, vulnerability, and lethality database for directed energy weapons. This program also develops laser-enabled atmospheric-compensated optical imaging for space situational awareness (SSA). Efforts in this program have been coordinated through the Department of Defense Science and Technology Executive Committee process to harmonize efforts and eliminate duplication.\n\nIn the FY 2021, the Air Force is consolidating its existing thirteen Advanced Technology Development (ATD), Research Development Test and Evaluation (RDT&E), Budget Activity 03 (BA 03) PEs into five new capability focused RDT&E BA 03 PEs to better align with the Air Force Science and Technology (S&T) Strategy signed by the SECAF in April 2019. This consolidation will improve and accelerate delivery of integrated transformational, multidisciplinary, collaborative technology solutions necessary to enable new Air Force warfighting capabilities that support of the National Defense Strategy. This new structure will provide the Air Force and Congress with a clearer understanding and increased transparency of integrated technology solutions and demonstrations key to enabling the Air Force future force design.\n \nIn FY 2021, the entirety of PE 0603605F, Advanced Weapons Technology, and associated Projects will be transferred to PE 0603035F, Next Gen Effects Dev\/Demo, as part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept, and Air Force S&T Strategy, April 2019. This is an administrative realignment and not a new start. This work will continue to be executed by the Air Force Research Laboratory Directed Energy Technology Directorate located in Kirtland Air Force Base, New Mexico.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities.  The use of program funds in this program element would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602602F, 0602605F, 0602788F, 1206601SF, and 0602298F.\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "43.368"
                },
                "CurrentYear": {
                    "val": "37.404"
                },
                "BudgetYearOne": {
                    "val": "30.971"
                },
                "BudgetYearOneBase": {
                    "val": "30.971"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "39.438"
                },
                "CurrentYear": {
                    "val": "37.404"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.930"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-30.971"
                },
                "BudgetYearOneBase": {
                    "val": "-30.971"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.135"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.795"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-30.971"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-30.971"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2019 in Other Adjustments of $2.795 million is due to realignment of funds to PE 0602212F to support Research and Development Projects, 10 U.S.C. Section 2363, an amendment to PL 110-417, 10 U.S.C. Section 2358 and 10 U.S.C. 2805(d)(1)(B).\n\nDecrease in FY 2021 is due to the entirety of PE 0603605F, Advanced Weapons Technology, and associated Projects being transferred to PE 0603035F, Next Gen Effects Dev\/Demo, as part of the Air Force RDT&E BA 03 PE consolidation to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept, and the Air Force S&T Strategy, April 2019."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "633151"
                    },
                    "ProjectTitle": {
                        "val": "High Power Solid State Laser Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.022"
                        },
                        "CurrentYear": {
                            "val": "19.244"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides for the development, integration, demonstration, and detailed  technical assessment of high energy laser (HEL) devices, advanced imaging and beam control technologies needed for applications such as force protection, force application, precision engagement, and aircraft self-protection. Laser system concept assessments to include vulnerability assessments and target effect testing are performed. This project also exploits the synergy between high energy laser beam control and advanced optical imaging for space situational awareness (SSA).\n\nIn FY 2021, the entirety of Project 633151, High Power Solid State Laser Technology, will be transferred to PE 0603035F, Next Gen effects Dev\/Demo, Project 633151, High Power Solid State Laser Technology, as part of the Air Force Research Development Test and Evaluation (RDT&E), Budget Activity 03 (BA 03) PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019.  The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Directed Energy Technology Directorate located in Kirtland Air Force Base, New Mexico. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Energy Laser\/Beam Control"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced beam control technologies, integrated laser systems, and aircraft self-protection laser technologies. Demonstrate beam control components integrated with high energy lasers (HEL) for Air Force utility."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.526"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.244"
                                            },
                                            "Text": {
                                                "val": "Demonstrate the integrated low power laser system in a pod for Phase 1 aircraft self-protect demonstration. Begin integration of a medium power laser system into the pod for Phase 2 aircraft self-protect demonstration. Complete integration of the laser control subsystem for directing the laser onto the target for aircraft self-protect demonstration. Complete development of ground support and aircraft interface. Complete first amplifier prototype for ultra-compact laser and transition into laser subsystem development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, this work is performed under the High Energy Laser\/Beam Control effort in PE 0603035F, Next Gen Effects Dev\/Demo, Project 633151, High Power Solid State Laser Technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $19.244 million. Funding decreased due to the transfer and realignment of this work to the High Energy Laser\/Beam Control effort in PE 0603035F, Next Gen Effects Dev\/Demo, Project 633151, High Power Solid State Laser Technology, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical Space Situational Awareness and Satellite Vulnerability"
                                    },
                                    "Description": {
                                        "val": "Mature development of laser-enabled, long-range, electro-optical technologies that enable 24\/7 ground-based optical space situational awareness delivering  characterization results on tactical timelines.  Develop and demonstrate technologies that accurately assess the vulnerability of blue satellite systems to lasers. Manage and operate research assets in support of development, demonstration, and integration of ground-based optical space situational awareness technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.496"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, this work will be performed under the PE 0602605F, Directed Energy Technology, Project 624866, Lasers & Imaging Technology, Optical Space Situational Awareness and Satellite Vulnerability effort to consolidate Optical Space Situational Awareness and Satellite Vulnerability research efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not Applicable."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Not Applicable."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "633152"
                    },
                    "ProjectTitle": {
                        "val": "High Power Microwave Development and Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.416"
                        },
                        "CurrentYear": {
                            "val": "18.160"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates high power microwave (HPM) and other unconventional electromagnetic field generation and transmission technologies that can be integrated into future weapon systems to support a wide range of Air Force missions such as air base defense or the damage\/destruction of an adversary's electronic infrastructure.  It also provides inputs to the susceptibility, vulnerability, and lethality databases used across the Department of Defense (DoD) to understand thresholds for scalable effects of directed energy weapons.\n\nIn FY 2021, the entirety of Project 633152, High Power Microwave Development and Integration, will be transferred to PE 0603035F, Next Gen Effects Dev\/Demos, Project 633152, High Power Microwave Development and Integration, as part of the Air Force Research Development Test and Evaluation (RDT&E), Budget Activity 03 (BA 03) PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019.  The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Directed Energy Technology Directorate located in Kirtland Air Force Base, New Mexico. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Power Microwave Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and evaluate high power microwave (HPM) and other unconventional weapon technologies for various platforms, including aerial, for applications such as counter-electronics. Develop and evaluate high power microwave technologies for non-kinetic and counter-electronic weapon applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.416"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.160"
                                            },
                                            "Text": {
                                                "val": "Test a class of reusable, multi-pulse, multi-target counter-electronics payloads capable of being hosted in various advanced platforms. Continue to characterize, model, test and evaluate current and projected blue directed energy threats on current red assets. Develop and test the high power microwave payload for the joint flight demonstration with the Navy. Design agile waveform high power sources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, this work is performed under the High Power Microwave Technologies effort in PE 0603035F, Next Gen Effects Dev\/Demo, Project 633152, High Power Microwave Technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $18.160 million. Funding decreased due to the transfer and realignment of this work to the High Power Microwave Technologies effort in PE 0603035F, Next Gen Effects Dev\/Demo, Project 633152, High Power Microwave Technology, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}