{
    "id": "2021-Navy-PB-1319-JBOOK-7db8e596d0ddeb1f5b53adfad61b01414eb438597126a733951e3c67dba6beab-13",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA6-U_RDTE_JustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605864N"
        },
        "ProgramElementTitle": {
            "val": "Test & Evaluation Support"
        },
        "R1LineNumber": {
            "val": "184"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "370.229"
            },
            "CurrentYear": {
                "val": "522.972"
            },
            "BudgetYearOne": {
                "val": "446.960"
            },
            "BudgetYearOneBase": {
                "val": "446.960"
            },
            "BudgetYearTwo": {
                "val": "444.077"
            },
            "BudgetYearThree": {
                "val": "453.976"
            },
            "BudgetYearFour": {
                "val": "449.706"
            },
            "BudgetYearFive": {
                "val": "425.042"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "JUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under RESEARCH, DEVELOPMENT, TEST and EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation.\n\nThis program provides institutional maintenance and operations support for: the Naval Undersea Warfare Center Detachment Atlantic Undersea Test and Evaluation Center, Andros Island, Bahamas; the Environmental Compliance Program; Naval Air Warfare Center Weapons Division, Point Mugu and China Lake, CA; Naval Air Warfare Center Aircraft Division, Patuxent River, MD; Test and Evaluation related capabilities at the Pacific Missile Range Facility, Barking Sands, HI; Maintenance and Repair at Naval Air Warfare Center Weapons Division, Naval Air Warfare Center Aircraft Division, and Naval Undersea Warfare Center Detachment Atlantic Undersea Test and Evaluation Center. The program also provides marine vessels overhauls and preventative maintenance in support of the 23 Major Range and Test Facility Base marine vessels located at Naval Air Warfare Center Weapons Division, Point Mugu, CA, Pacific Missile Range Facility, Honolulu, HI, Naval Undersea Warfare Center Keyport Nanoose and Dabob Bay Ranges, Keyport, WA, Naval Air Warfare Center Aircraft Division, Patuxent River, MD, and Naval Undersea Warfare Center Detachment Atlantic Undersea Test and Evaluation Center.  The Test and Evaluation activities make up the Navy portion of the Department of Defense's Major Range and Test Facility Base. These activities are chartered to perform Test and Evaluation for the development and acquisition of technologically advanced weapons systems. Core Test and Evaluation capabilities and capacity are operated to obtain weapons system performance documentation for acquisition program milestone decisions to provide operational forces with effective weapons systems. This program provides Navy Acquisition Program Managers required test capabilities; lowers cost of Test and Evaluation; removes cost and scheduling impact of developing and providing their own Test and Evaluation capabilities; and retains the physical airspace, land space and sea space needed to conduct testing."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "373.834"
                },
                "CurrentYear": {
                    "val": "394.020"
                },
                "BudgetYearOne": {
                    "val": "400.395"
                },
                "BudgetYearOneBase": {
                    "val": "400.395"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "370.229"
                },
                "CurrentYear": {
                    "val": "522.972"
                },
                "BudgetYearOne": {
                    "val": "446.960"
                },
                "BudgetYearOneBase": {
                    "val": "446.960"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.605"
                },
                "CurrentYear": {
                    "val": "128.952"
                },
                "BudgetYearOne": {
                    "val": "46.565"
                },
                "BudgetYearOneBase": {
                    "val": "46.565"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-1.492"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "130.444"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.687"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.919"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "46.603"
                                },
                                "BudgetYearOneBase": {
                                    "val": "46.603"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.038"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.038"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "New Project 2511 was created in support of Natural Disaster Relief starting in FY 2020. $54.136M was added in FY 2021 to project 2511 for damages caused by the Searles Valley Earthquake to MRTFB facilities, infrastructure and instrumentation at Naval Weapons Station China Lake.\n\n\nThe FY 2021 funding request was reduced by $6.544 million to account for the availability of prior year execution balances."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0541"
                    },
                    "ProjectTitle": {
                        "val": "AUTEC"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "52.080"
                        },
                        "CurrentYear": {
                            "val": "54.507"
                        },
                        "BudgetYearOne": {
                            "val": "54.213"
                        },
                        "BudgetYearOneBase": {
                            "val": "54.213"
                        },
                        "BudgetYearTwo": {
                            "val": "55.175"
                        },
                        "BudgetYearThree": {
                            "val": "56.288"
                        },
                        "BudgetYearFour": {
                            "val": "57.413"
                        },
                        "BudgetYearFive": {
                            "val": "58.562"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "As a detachment of Naval Undersea Warfare Center, Division Newport, the mission of the Atlantic Undersea Test and Evaluation Center is to provide the US Navy an underwater range facility for full-spectrum test and evaluation of Undersea Warfare systems and for Fleet training and readiness assessment.  The Atlantic Undersea Test and Evaluation Center  Program Office is headquartered at Newport, RI.  Atlantic Undersea Test and Evaluation Center's administrative offices are located at West Palm Beach, Florida.  Test facilities are located at Andros Island, Sites 1 through 4, and the Berry Islands in the Bahamas.  Atlantic Undersea Test and Evaluation Center aircraft make scheduled daily flights between West Palm Beach and Andros Town Airport.  \n\nAtlantic Undersea Test and Evaluation Center manages and, under service contract, maintains and operates a 500 square nautical miles deep-water and a 100 square nautical miles shallow-water range; air-target tracking capabilities; sonobuoy simulation systems; electronic warfare threat simulation systems; rotary wing aircraft; aircraft ground support facilities; acoustic targets; torpedo retrieval and flushing capabilities; open-ocean range craft; marine support facilities; and data processing and analysis capabilities.  \n\nMajor test facilities on Andros Island are located at Site 1.  The Command Control Building houses the range tracking displays and replay centers, the computer center, operations support functions, communications center, and the central timing system. The Range Support Facility houses a torpedo post-run workshop, Mark 46 \/Mark 50 and Mark 54 lightweight torpedo Intermediate Maintenance Activity, a Mark 30 undersea target Intermediate Maintenance Activity, a Mark 48 heavyweight torpedo Research and Development Turnaround facility and related technical facilities. The complex includes electrical and physical calibration labs, a complete electronics maintenance shop, a dive locker, a precision machine shop, and logistics support areas.\n\nAtlantic Undersea Test and Evaluation Center has a 285-foot concrete pier with a controlling depth of 17 feet (5.2 meters) at mean low tide. An adjacent wharf is approximately 240 feet in length (72 meters) with a controlling depth of 15 feet at mean low tide.  Power is available at both locations.  Facilities at the pier\/marine area include fully equipped machine \/fabrication and marine overhaul shops.  Also at Site 1, six Range User Buildings are maintained  for assembling test equipment and equipment check-out during test mobilization or dockside periods. These staging areas are equipped with a variety of power sources, gantry cranes, compressed air and security features. A fully equipped range user hanger for ground maintenance and storage of helicopters is located at the Atlantic Undersea Test and Evaluation Center helicopter airstrip.  Sites 2, 3, and 4 are small instrumented areas located south of Site 1 used to extend tracking of sonobuoys, communications, and air target track. This project funds costs that are not chargeable to customers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Atlantic Undersea Test and Eval Ctr Facility"
                                    },
                                    "Description": {
                                        "val": "Atlantic Undersea Test and Evaluation Center is a Test and Evaluation facility for collecting selected underwater, surface and air tracking data on test participants.  This project funds the overhead\/institutional costs required to sustain the Major Range and Test Facility capabilities at Atlantic Undersea Test and Evaluation Center in accordance with Department of Defense Directive 3200.11."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.324"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "42.751"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources, instrumentation systems and marine craft required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain Major Range and Test Facility Base operations.  Reimburse the Command for General and Administrative support services.  Continue to support resolution of policy compliance issues resulting from a Naval Sea Systems Command Inspector General\/Newport Office of Counsel and Contracting review."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.457"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.457"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources, instrumentation systems and marine craft required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain Major Range and Test Facility Base operations.  Reimburse the Command for General and Administrative support services.  Continue to support resolution of policy compliance issues resulting from a Naval Sea Systems Command Inspector General\/Newport Office of Counsel and Contracting review."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2020 to FY 2021 is due to realignment of funds for Cyber Pure Line project unit 2958."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bahamian Lease"
                                    },
                                    "Description": {
                                        "val": "Rental payments to the Bahamian government for use of land and ocean in the Bahamas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.756"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.756"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide rental payments to the Bahamian government for use of land and ocean in the Bahamas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.756"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.756"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide rental payments to the Bahamian government for use of land and ocean in the Bahamas."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0566"
                    },
                    "ProjectTitle": {
                        "val": "NAVAIR Environmental Compliance"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "4.402"
                        },
                        "CurrentYear": {
                            "val": "4.572"
                        },
                        "BudgetYearOne": {
                            "val": "4.158"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.158"
                        },
                        "BudgetYearTwo": {
                            "val": "5.059"
                        },
                        "BudgetYearThree": {
                            "val": "5.053"
                        },
                        "BudgetYearFour": {
                            "val": "4.948"
                        },
                        "BudgetYearFive": {
                            "val": "5.047"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This continuing project supports environmental compliance, conservation and pollution prevention related efforts at the Navy Major Range and Test Facility Base located at Patuxent River, MD, China Lake, CA, Point Mugu, CA, and Atlantic Undersea Test and Evaluation Center, Bahamas.  The Navy Major Range and Test Facility Base environmental projects include ongoing efforts to comply with Federal, State, and local environmental requirements.\n\nThe Major Range and Test Facility Base are test and evaluation facilities that provide for Department of Defense test and evaluation support missions.  These missions include: Weapons system testing, military operational squadron training on new weapon systems, and validation of performance or operational characteristics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental Compliance"
                                    },
                                    "Description": {
                                        "val": "Projects supporting level 1 compliance requirements at Naval Air Systems Command Ranges inclusive of hazardous waste disposal, Resource Conservation & Recovery Act, Subtitle C - 40 CFR 260 through 279, and Emergency Planning and Community Right-to-Know Act, Sections 311-312; solid waste disposal, Resource Conservation & Recovery Act, Subtitle D - 40 CFR Parts 239 through 259; natural & cultural resources programs, National Environmental Policy Act, Environmental Protection Act, Marine Mammal Protection Act, Endangered Species Act, Archeological and Historic Preservation Act, maintenance of environmental permits, Clean Air Act, Clean Water Act, and environmental monitoring. Resource Conservation & Recovery Act, 42 U.S.C. Section 6901 et sequens 1976; Emergency Planning and Community Right-to-Know Act, 42 U.S.C. Section 11001-11050 et sequens 1986; National Environmental Policy Act, 42 U.S.C. Section 4331 et sequens 1969; Marine Mammal Protection Act, 16 U.S.C. Section 1361 et sequens 1972; Clean Water Act, 33 U.S.C. Section 1251-1387 1972; ESA, 7 U.S.C. Section 136, 16 U.S.C. Section 1531 et sequens 1973; Archeological and Historic Preservation Act, 16 USC Section 469-469c-2 1960; and Clean Air Act, Title V, 33 U.S.C. Section 1251 et sequens 1972."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.402"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.572"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the identification and funding of level 1 requirements that support compliance projects at Naval Air Systems Command Ranges to ensure applicable laws and regulations are met and Range mission\/operations proceed unencumbered.  Global Information Systems Encroachment Data Supporting Testing & Training, 0.2\nCultural Surveys Supporting Testing & Training, 0.1"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.158"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.158"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the identification and funding of level 1 requirements that support compliance projects at Naval Air Systems Command Ranges to ensure applicable laws and regulations are met and Range mission\/operations proceed unencumbered.  Support Testing for Global Information Systems Encroachment and Cultural Surveys."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 funding request was reduced to account for the availability of prior year execution balances."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0653"
                    },
                    "ProjectTitle": {
                        "val": "NAWC Weapons Division"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "141.269"
                        },
                        "CurrentYear": {
                            "val": "155.097"
                        },
                        "BudgetYearOne": {
                            "val": "152.741"
                        },
                        "BudgetYearOneBase": {
                            "val": "152.741"
                        },
                        "BudgetYearTwo": {
                            "val": "157.458"
                        },
                        "BudgetYearThree": {
                            "val": "156.402"
                        },
                        "BudgetYearFour": {
                            "val": "158.971"
                        },
                        "BudgetYearFive": {
                            "val": "162.152"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Project provides continuing maintenance and operational support for the Naval Air Warfare Center Weapons Division Test and Evaluation capabilities.  These capabilities include the Pacific Ranges and Facilities, consisting of China Lake Ranges and the Point Mugu Sea Range, aerial and surface target launch and recovery, target test instrumentation and Test and Evaluation aircraft.  The Pacific Ranges use China Lake's 1.1 million acres of land and 17,000 square miles of military restricted (R-2508) airspace together with Point Mugu's 125,000 square miles of instrumented sea range and 36,000 square miles of controlled overlying airspace, and airfield and test instrumentation at San Nicolas Island to perform its Test and Evaluation mission.  Included in the China Lake ranges is the Electronic Combat Range, which provides outdoor free space developmental and operational testing of airborne electronic warfare systems and tactics against shipboard and land based air defense systems. These ranges perform metric radar, multilateration and optical  tracking of test objects; command, control,  and destruct for range safety purposes; communications; frequency interference control and analysis; collection processing and display of telemetered data; real-time data processing and display; and the operation of a sub scale aerial target launch capability.  Other test capabilities include sled tracks, measurement facilities; propulsion, warhead, environmental, rocket motor, and other missile component test facilities; and gun ranges.  This project funds costs that are not chargeable to customers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pacific Ranges"
                                    },
                                    "Description": {
                                        "val": "In accordance with Department of Defense Directive 3200.11., this project funds the overhead\/institutional costs required to sustain the Major Range and Test Facility Base capabilities at the Pacific Ranges and Facilities located at China Lake and Point Mugu, CA.  These facilities provide safe, instrumented, controlled open air testing utilizing the Land Range, Sea Range, Electronic Combat Ranges, and San Nicholas Island."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "59.339"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "63.221"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources. These resources include test article\ninstrumentation and\/or modification for Flight Test Aircraft and Weapons Undersea Test as well as ground and flight test instrumentation systems, range instrumentation systems and data processing and communication systems required to meet customer test workload. Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test Facility Base operations.  Maintenance will begin on five Radar Signal Emulators (RSEs) and a battlespace shaping capability that requires Special Access Program (SAP) facilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "62.917"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "62.917"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources. These resources include test article\ninstrumentation as well as ground and flight test instrumentation systems, range instrumentation systems and data processing and communication systems required to meet customer test workload. Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test Facility Base operations.  Sustain maintenance activities associated with five Radar Signal Emulators (RSEs) and a battlespace shaping capability that requires Special Access Program (SAP) facilities. Initiate maintenance activities to sustain warfare battle shaping capability."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No significant changes from FY 2020 to FY 2021"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy Test Wing Pacific"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the Major Range and Test Facility Base  capabilities of the Naval Test Wing Pacific located at China Lake and Point Mugu, CA.  These facilities provide the Navy's principal Pacific test activity for Naval Aviation Systems Team aircraft, engaged in or supporting Test & Evaluation of aircraft, weapons and weapons systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.521"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.118"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with airborne and seaborne targets required to meet customer test workload. Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test Facility Base operations.  Stand up maintenance activity for the new Gulf Stream C-20 aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.595"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.595"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support aircraft associated with aviation platform and weapon system test and evaluation. Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain Naval Test Wing Pacific operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease from FY 2020 to FY 2021 reflects the completion of stand up for the Gulf Stream Maintenance Operations Base support C-20 Aircraft."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat\/Target Systems"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the Major Range and Test Facility Base  capabilities of the Threat\/Target Systems facilities.  These facilities provide the airborne and seaborne target presentations for test and evaluation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.454"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.804"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with airborne and seaborne targets required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test Facility Base operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.713"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.713"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with airborne and seaborne target operations required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test Facility Base target operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no significant change from FY 2020 to FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation Ordnance"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the Major Range and Test Facility Base  capabilities of the Test and Evaluation Ordnance facilities.  These facilities provide test and evaluation of All-Up live ordnance and components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.540"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated propulsion, warhead, environmental, rocket motor, and other missile component test facilities required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain Major Range and Test Facility Base  operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated propulsion, warhead, environmental, rocket motor, and other missile component test facilities required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain Major Range and Test Facility Base ordnance test and evaluation operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no significant changes from FY 2020 to FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval Air Warfare Center Weapons Division Command"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the Naval Air Warfare Center Weapons Division Major Range and Test Facility Base Test and Evaluation capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "44.415"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "49.454"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to reimburse the Command for General and Administration Support services.  Continue to fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities, Navy Marine Corps Intranet, and any costs  necessary to manage and sustain Major Range and Test Facility Base operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "49.926"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "49.926"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to reimburse the Command for General and Administration Support services.  Continue to fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities, Navy Marine Corps Intranet, and any costs  necessary to manage and sustain Major Range and Test Facility Base operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY 2020 to FY 2021 is due to FAA rate increase for Air Traffic Control Services in R2508."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0654"
                    },
                    "ProjectTitle": {
                        "val": "NAWC Acft Division"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "95.496"
                        },
                        "CurrentYear": {
                            "val": "100.281"
                        },
                        "BudgetYearOne": {
                            "val": "101.753"
                        },
                        "BudgetYearOneBase": {
                            "val": "101.753"
                        },
                        "BudgetYearTwo": {
                            "val": "103.733"
                        },
                        "BudgetYearThree": {
                            "val": "105.776"
                        },
                        "BudgetYearFour": {
                            "val": "108.853"
                        },
                        "BudgetYearFive": {
                            "val": "111.028"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides funds for the maintenance and operations of the Naval Air Warfare Center Aircraft Division's    Major Range and Test Facility Base capabilities used to conduct test and evaluation for air platforms.  Naval Air Warfare Center Aircraft Division has extensive airfield, flight test ranges, aircraft systems test facilities and simulation laboratories to support aircraft Research Development Test and Evaluation.  This includes 50,000 square miles of airspace, 39,375 square miles of sea space, and 7,950 acres of land space.  Product areas include aircraft systems flight test and evaluation, carrier suitability certification, test article preparation, installed system test and evaluation, and modeling and simulation support of the acquisition program test requirements. The Test and Evaluation Group, Patuxent River, performs development and operational test and evaluation of manned and unmanned air vehicle systems, including mission systems, equipment, subsystems, components, and support systems.  This project also provides test and evaluation facilities for air-breathing propulsion systems and extensive facilities for conducting both installed and uninstalled aircraft engine development and test and evaluation.  This project funds costs that are not chargeable to customers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Atlantic Ranges"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the Major Range and Test Facility Base capabilities associated with the Atlantic Ranges and Facilities and Air Vehicle Modification and Instrumentation.  These facilities provide safe, instrumented, controlled flight testing and training in air, sea, and land arenas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.349"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.871"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources.  These resources include test article instrumentation and\/or modification for Flight Test Aircraft and Weapons Undersea Test as well as ground and flight test instrumentation systems, range instrumentation systems and data processing and communication systems required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the  Major Range and Test Facility Base operations.  Maintenance will begin for two new control rooms that operate at the Special Access Program (SAP) level, including the IT equipment required to perform test and evaluation operations from the control rooms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.257"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.257"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources.  These resources include test article instrumentation and\/or modification for Flight Test Aircraft and Weapons Undersea Test as well as ground and flight test instrumentation systems, range instrumentation systems and data processing and communication systems required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the  Major Range and Test Facility Base operations.  Continue maintenance for two new control rooms that operate at the Special Access Program (SAP) level, including the IT equipment required to perform test and evaluation operations from the control rooms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2020 to FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Environmental Effects and Air Combat Environment Test and Evaluation Facility"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the Major Range and Test Facility Base  capabilities associated with Electromagnetic Environmental Effects and Air Combat Environment Test and Evaluation Facility.  These facilities  provide Test and Evaluation support with integrated, interactive, and repeatable synthetic environments and reduce the risk and cost for programs with the use of installed systems tests to include simulation and stimulation tools, techniques and technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.188"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.084"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test Facility Base operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.794"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.794"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Electromagnetic Environmental Effects and Air Combat Environment Test and Evaluation Facility operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY 2020 to FY 2021 supports increase in maintenance requirements associated with Air Combat Environment Test and Evaluation Facility Electronic Warfare test capabilities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Propulsion Systems Evaluation Facility"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the Major Range and Test Facility Base   capabilities of the Propulsion Systems Evaluation Facility. These facilities perform Test and Evaluation of propulsion systems in the laboratories, engine test chambers and component test rigs of the Propulsion Systems Evaluation Facility and the Aircraft Test and Evaluation Facility.  Propulsion Systems consists of engines, engine components and accessories."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.498"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.587"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources required to meet customer test requirements.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test  Facility Base operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.646"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.646"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Propulsion System Evaluation Facility operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2020 to FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat\/Target Systems"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the Major Range and Test Facility Base. Threat\/Target Systems operations provide the airborne and seaborne target presentations for test and evaluation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.284"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.329"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with airborne and seaborne targets required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test Facility Base operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.376"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.376"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with airborne and seaborne target operations required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test Facility Base target operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2020 to FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval Test Wing Atlantic"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the Major Range and Test Facility Base  capabilities of the Naval Test Wing Atlantic.  These facilities provide support for Naval Aviation Systems Team aircraft, engaged in or supporting aircraft system test and evaluation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.320"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.757"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with 11 aircraft and related systems and flight test safety required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test Facility Base operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.747"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.747"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with 11 aircraft and related systems and flight test safety required to meet customer test operations.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Naval Test Wing Atlantic."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2020 to FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval Air Warfare Center Aircraft Division Command"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the Naval Air Warfare Center Aircraft Division Major Range and Test Facility Base Test and Evaluation capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.857"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.653"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to reimburse the Command for General and Administrative support services.  Continue to fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test Facility Base operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.933"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.933"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to reimburse the Command for General and Administrative support services.  Continue to fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Naval Air Warfare Center Aircraft Division Range and Test Facility Base operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No significant change from FY 2020 to FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2511"
                    },
                    "ProjectTitle": {
                        "val": "Natural Disaster Relief"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "130.444"
                        },
                        "BudgetYearOne": {
                            "val": "54.136"
                        },
                        "BudgetYearOneBase": {
                            "val": "54.136"
                        },
                        "BudgetYearTwo": {
                            "val": "39.655"
                        },
                        "BudgetYearThree": {
                            "val": "47.000"
                        },
                        "BudgetYearFour": {
                            "val": "33.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "304.235"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "New Project 2511 created in support of Natural Disaster Relief."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project was created in response to the 2019 Searles Valley Earthquakes at Naval Weapons Station China Lake to support repairs at Navy MRTFB sites that have been damaged by natural disasters to include earthquakes, wildfires, hurricanes, tornadoes, landslides and floods."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Natural Disaster Relief"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "130.444"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funds provided in support of repairing damage caused by the July 2019 Searles Valley Earthquake to the MRTFB facilities, infrastructure and instrumentation at Naval Weapons Station China Lake. FY20 plans include repair of Class-3 property; Propulsion Lab Repairs at Cal Tech Sites 1 and 4, the Environmental Test Area and Burro Canyon. Plans also include network fiber optic repairs to instrumentation on North and South Range complexes; Replacement and integration of Optical Systems; Replacement and integration of Communications Systems; and Repairs to Remotely Operated Tracking Radars Instrumentation; Energetic Material mixers; and Laser equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "54.136"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "54.136"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This is a continuation of repairing damage caused by natural disasters at Navy MRTFB sites.  FY21 repairs will include: Class-3 property; Propulsion Lab Repairs at Cal Tech Sites 1 and 4, the Environmental Test Area and Burro Canyon. Plans also include network fiber optic repairs to instrumentation on North and South Range complexes; Replacement and integration of Optical Systems; Replacement and integration of Communications Systems; and Repairs to Remotely Operated Tracking Radars Instrumentation; Energetic Material mixers; and Laser equipment"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease from FY20 to FY21 is due to a large number of priority repair projects having been addressed in FY20."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2921"
                    },
                    "ProjectTitle": {
                        "val": "Pacific Missile Range Facility"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.139"
                        },
                        "CurrentYear": {
                            "val": "5.394"
                        },
                        "BudgetYearOne": {
                            "val": "5.413"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.413"
                        },
                        "BudgetYearTwo": {
                            "val": "5.523"
                        },
                        "BudgetYearThree": {
                            "val": "5.634"
                        },
                        "BudgetYearFour": {
                            "val": "5.746"
                        },
                        "BudgetYearFive": {
                            "val": "5.862"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program provides continuing maintenance and operations support for Test and Evaluation related capabilities at the Pacific Missile Range Facility located at Barking Sands on Kauai, HI.  Pacific Missile Range Facility's Test and Evaluation capabilities include precision radar and telemetry assets, the Mobile Aerial Target Support System, and Stabilized High-accuracy Optical Tracking System.  These assets support Navy, Department of Defense, and Missile Defense Agency Test and Evaluation.  This project funds costs not chargeable to customers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pacific Missile Range Facility"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the recognized Major Range and Test Facility Base capabilities at Pacific Missile Range Facility in accordance with Department of Defense Directive 3200.11."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.139"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.394"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources including three precision radars and eight telemetry antennas, the Mobile Aerial Target Support System barge, and the four Optical Systems required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test Facility Base operations.  Reimburse the Command for General and Administrative support services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.413"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.413"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources including three precision radars and eight telemetry antennas, the Mobile Aerial Target Support System barge, and the four Optical Systems required to meet customer test requirements.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test Facility Base operations.  Reimburse the Command for General and Administrative support services."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2020 to FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2922"
                    },
                    "ProjectTitle": {
                        "val": "MRTFB Maint & Repair"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "44.685"
                        },
                        "CurrentYear": {
                            "val": "41.382"
                        },
                        "BudgetYearOne": {
                            "val": "37.246"
                        },
                        "BudgetYearOneBase": {
                            "val": "37.246"
                        },
                        "BudgetYearTwo": {
                            "val": "47.743"
                        },
                        "BudgetYearThree": {
                            "val": "47.506"
                        },
                        "BudgetYearFour": {
                            "val": "49.695"
                        },
                        "BudgetYearFive": {
                            "val": "50.690"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides funding for the maintenance and repair of the Major Range and Test Facility Base Real Property Maintenance Activities at the Naval Air Warfare Center Weapons Division, the Naval Air Warfare Center Aircraft Division, and the Atlantic Undersea Test and Evaluation Center.  Funds mission critical emergency services, recurring maintenance and repair, and major repair projects.  In addition it addresses priority items on the Backlog of Maintenance and Repair list."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Facility Maintenance and Repair"
                                    },
                                    "Description": {
                                        "val": "Maintenance and repair of the Major Range and Test Facility Base Real Property Maintenance Activities at Naval Air Warfare Center Weapons Division, Naval Air Warfare Center Aircraft Division, and the Naval Undersea Warfare Center Detachment Atlantic Undersea Test and Evaluation Center."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "44.685"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "41.382"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to support mission critical emergency services, recurring maintenance and repair, and minor and major repair efforts at Naval Air Warfare Center Weapons Division, Naval Air Warfare Center Aircraft Division, and the Naval Undersea Warfare Center Detachment Atlantic Undersea Test and Evaluation Center.  FY20 budget funds Major Range and Test Facility Base facility to 75% of Department of Defense Facility Sustainment Model v19.1 with $9M to continue the Naval Air Systems Command Hangar recapitalization efforts and complete Atlantic Undersea Test and Evaluation Center Inspector General Compliance projects to improve security."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "37.246"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "37.246"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to support mission critical emergency services, recurring maintenance and repair, and minor and major repair efforts at Naval Air Warfare Center Weapons Division, Naval Air Warfare Center Aircraft Division, and the Naval Undersea Warfare Center Detachment Atlantic Undersea Test and Evaluation Center.  FY21 budget funds Major Range and Test Facility Base facility to 65% of Department of Defense Facility Sustainment Model v19.1 with $11M to continue the Naval Air Systems Command Hangar recapitalization efforts and complete Atlantic Undersea Test and Evaluation Center Inspector General Compliance projects to improve perimeter security."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 funding request was reduced to account for the availability of prior year execution balances."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2958"
                    },
                    "ProjectTitle": {
                        "val": "Cyberspace Activities"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.433"
                        },
                        "BudgetYearOne": {
                            "val": "0.445"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.445"
                        },
                        "BudgetYearTwo": {
                            "val": "0.445"
                        },
                        "BudgetYearThree": {
                            "val": "0.445"
                        },
                        "BudgetYearFour": {
                            "val": "0.454"
                        },
                        "BudgetYearFive": {
                            "val": "0.463"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides funding for cyber requirements for the Major Range and Test Facility Base Real Property at the Atlantic Undersea Test and Evaluation Center.  Funds critical cybersecurity upgrades to instrumentation and networks to ensure capabilities are secure and available to support customer test requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyberspace Activities"
                                    },
                                    "Description": {
                                        "val": "This project funds network and instrumentation compliance with cybersecurity requirements at the Atlantic Undersea Test and Evaluation Center."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.433"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Maintain critical cyber requirements and equipment at Atlantic Undersea Test and Evaluation Center as required to support test and evaluations operations at the Atlantic Undersea Test and Evaluation Center."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.445"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.445"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Maintain compliance with cybersecurity requirements at Atlantic Undersea Test and Evaluation Center as required to support test and evaluations operations at the Atlantic Undersea Test and Evaluation Center."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase is no significant change from FY 2020 to FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3154"
                    },
                    "ProjectTitle": {
                        "val": "Nanoose and Dabob Bay Ranges"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "11.833"
                        },
                        "CurrentYear": {
                            "val": "12.714"
                        },
                        "BudgetYearOne": {
                            "val": "12.899"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.899"
                        },
                        "BudgetYearTwo": {
                            "val": "12.741"
                        },
                        "BudgetYearThree": {
                            "val": "12.996"
                        },
                        "BudgetYearFour": {
                            "val": "13.412"
                        },
                        "BudgetYearFive": {
                            "val": "13.680"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides maintenance and operations support  for the Nanoose and Dabob Bay Ranges along with associated support systems to provide Test and Evaluation and readiness assessment services for acquisition programs and the Fleet.  Operates ocean-based environment, measurement and support systems.  Maintains and repairs systems that measure warfare system performance.  Oversees test, training, and measurement facilities, equipment, operations and maintenance processes.  Satisfies customer exercise and measurement requirements through the operation of ocean based test and measurement systems.  Assures the readiness of  systems through the implementation of calibration, maintenance, repair and life cycle processes.  Performs exercise planning, exercise interpretation and development of surrogate environments, for system performance measurement.  Assists in the design, fabrication and testing of systems for Undersea Warfare applications.  Oversees the manning and maintenance of Naval Undersea Warfare Center Division Keyport range craft and range craft systems. This project funds costs not chargeable to customers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Undersea Ranges"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the Major Range and Test Facility Base capabilities at the Nanoose and Dabob Bay undersea tracking ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.833"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.714"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with the unique test environments for Test and Evaluation of undersea weapons, sensors, submarines and other undersea systems required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test Facility Base operations.  Reimburse the Command for General and Administrative support services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.899"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.899"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with the unique test environments for Test and Evaluation of undersea weapons, sensors, submarines and other undersea systems required to meet customer test requirements.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test Facility Base operations.  Reimburse the Command for General and Administrative support services."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2020 to FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3386"
                    },
                    "ProjectTitle": {
                        "val": "MRTFB Marine Vessels"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "15.325"
                        },
                        "CurrentYear": {
                            "val": "18.148"
                        },
                        "BudgetYearOne": {
                            "val": "23.956"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.956"
                        },
                        "BudgetYearTwo": {
                            "val": "16.545"
                        },
                        "BudgetYearThree": {
                            "val": "16.876"
                        },
                        "BudgetYearFour": {
                            "val": "17.214"
                        },
                        "BudgetYearFive": {
                            "val": "17.558"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the overhauls and preventative maintenance of the 23 Major Range and Test Facility Base marine vessels located at Naval Air Warfare Center Weapons Division, Point Mugu, CA, Pacific Missile Range Facility, Honolulu, HI, Naval Undersea Warfare Center Keyport, WA, Naval Air Warfare Center Aircraft Division, Patuxent River, MD, and Atlantic Undersea Test and Evaluation Center. These vessels are used to launch and recover torpedoes, acoustic systems, and other weapons, provide range surveillance and clearance, and can be configured for target services.  Overhauls are required to operate ships over 300 tons overseas in compliance with American Bureau of Shipping \"Load Line\" certification requirements.  Major preventative maintenance requiring shipyard support is also performed during these periods to mitigate risks of failures and sustain critical, Hull, Mechanical and Electrical systems to support operations at sea."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MRTFB Marine Vessels"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhauls and preventative maintenance of the 23 Major Range and Test Facility Base marine vessels located at Naval Air Warfare Center Weapons Division, Point Mugu, CA, Pacific Missile Range Facility, Honolulu, HI, Naval Undersea Warfare Center Keyport Keyport Nanoose and Dabob Bay Ranges, Keyport, WA, Naval Air Warfare Aircraft Division, Patuxent River, MD, and Naval Undersea Warfare Center Detachment Atlantic Undersea Test and Evaluation Center."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.325"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.148"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform overhauls of a Naval Undersea Warfare Center Keyport, Atlantic Undersea Test and Evaluation Center, Naval Air Warfare Center Aircraft Division, and Naval Air Warfare Center Weapons Division vessel. Continue purchase of the Naval Undersea Warfare Center Detachment Atlantic Undersea Test and Evaluation center Rover replacement vessel."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.956"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.956"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform overhauls of a Naval Undersea Warfare Center Keyport, Atlantic Undersea Test and Evaluation Center, Naval Air Warfare Center Aircraft Division, and Naval Air Warfare Center Weapons Division vessel.  Purchase replacement of Naval Air Warfare Center Weapons Division Mobile Ship Target."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY 2020 to FY 2021 reflects replacement of the Mobile Ship Target at Naval Air Warfare Center Weapons Division."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        }
                    }
                }
            ]
        }
    }
}