{
    "id": "2021-AirForce-PB-3600-MJBOOK-0-0-4ccc939241b47239c36ee98d5519ce37a7e18b46d494a025321d2035cb3d38d7-30",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603601F"
        },
        "ProgramElementTitle": {
            "val": "Conventional Weapons Technology"
        },
        "R1LineNumber": {
            "val": "31"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "191.704"
            },
            "CurrentYear": {
                "val": "225.817"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This project develops, integrates, and demonstrates advance ordnance and guidance technologies for air-launched conventional weapons.  The effort focuses on conventional ordnance component technologies such as war-heads, fuzes, and explosives, as well as munition guidance component technologies such as navigation and control systems and seekers.  Technologies to be developed, demonstrated, and integrated into system concepts will address blast, fragmentation, penetration, low collateral damage, variable depth\/location fuzing, precise guidance, and high-performance and insensitive explosives.  Efforts in this project have been coordinated through the Department of Defense Science and Technology Executive Committee process to harmonize efforts and eliminate duplication.\n\nIn the FY 2021, the Air Force is consolidating its existing thirteen Advanced Technology Development (ATD), Research Development Test and Evaluation (RDT&E), Budget Activity 03 (BA 03) PEs into five new capability focused RDT&E BA 03 PEs to better align with the Air Force Science and Technology (S&T) Strategy signed by the SECAF in April 2019. This consolidation will improve and accelerate delivery of integrated transformational, multidisciplinary, collaborative technology solutions necessary to enable new Air Force warfighting capabilities that support of the National Defense Strategy. This new structure will provide the Air Force and Congress with a clearer understanding and increased transparency of integrated technology solutions and demonstrations key to enabling the Air Force future force design.\n\nIn FY 2021, the entirety of Project 63670A, Weapon Technology Development will be transferred from PE 0603601F, Conventional Weapons Technology, to PE 0603035F, Next Generation Effects Dev\/ Demo. \n\nIn FY 2021, Project 63670B, Weapon Concept Development, non-Vanguard efforts and activities will be transferred from PE 0603601F, Conventional Weapon Technology, to PE 063035F, Next Gen Effects Dev\/Demo.  Golden Horde Vanguard activities under this project will be consolidated and transferred in FY 2021 from PE 0603601F, Conventional Weapon Technology to PE 0603032F, Future AF Integrated Technology Demos, Project 630320, Air Force Vanguards.  \n\nAll these transfers detailed above are part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept, and Air Force S&T Strategy, April 2019. This is an administrative realignment and not a new start. This work will continue to be executed by the Air Force Research Laboratory Munitions Technology Directorate located in Eglin Air Force Base, Florida.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science and technology capabilities.  The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602602F, 0602605F, 0602788F, 1206601SF, and 0602298F.\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "204.756"
                },
                "CurrentYear": {
                    "val": "225.817"
                },
                "BudgetYearOne": {
                    "val": "206.783"
                },
                "BudgetYearOneBase": {
                    "val": "206.783"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "191.704"
                },
                "CurrentYear": {
                    "val": "225.817"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-13.052"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-206.783"
                },
                "BudgetYearOneBase": {
                    "val": "-206.783"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-7.202"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-5.850"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-206.783"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-206.783"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2019 in Other Adjustments of $5.850 million is due to realignment of funds to PE 0602212F to support Research and Development Projects, 10 U.S.C. Section 2363, an amendment to PL 110-417, 10 U.S.C. Section 2358 and 10 U.S.C. 2805(d)(1)(B).\n\nDecrease in FY 2021 of $206.783 million is due to PE 0603601F, Conventional Weapons Tech, and associated non-Vanguard Projects being transferred to PE 0603035F, Next Gen Effects Dev\/Demo.  Golden Horde Vanguard activities under Project 63670B, Weapon Concept Development, will be consolidated and transferred in FY 2021 from PE 0603601F, Conventional Weapon Technology, to PE 0603032F, Future AF Integrated Technology Demos, Project 630320, Air Force Vanguards.  These transfers are part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept, and Air Force S&T Strategy, April 2019."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "63670A"
                    },
                    "ProjectTitle": {
                        "val": "Weapon Technology Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "118.868"
                        },
                        "CurrentYear": {
                            "val": "57.895"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, matures, assesses, and demonstrates advanced\/innovative ordnance and guidance component and subsystem technologies for air-launched conventional weapons.  The project focuses on maturation of advanced explosives, fuzes, warheads, sub-munitions, and weapon airframes, carriage and dispensing; as well as innovative munition seekers, weapon aerodynamics, navigation and control, and guidance subsystem integration\/simulation.\n\nIn FY 2021, the entirety of Project  63670A, Weapon Technology Development, will be transferred to PE 0603035F, Next Generation Effects Dev\/Demos, Project 63670A, Weapon Technology Development as part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas that better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019.  The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Munitions Technology Directorate located in Eglin Air Force Base, Florida.  This is an administrative realignment for consolidation, and not a new start."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program increase - rotary launcher development"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.649"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally directed efforts"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "Not applicable"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ordnance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate integrated ordnance technologies to improve conventional air-delivered munitions.  Specific technical areas of focus include energetic materials, fuze technology, warhead sciences, and modeling and simulation tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "57.335"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.582"
                                            },
                                            "Text": {
                                                "val": "Complete characterization of weapon effects for distributed, multi-point detonation fuze technology including safe and arm functions.  Complete multiple-hit target demonstration against hard and deeply buried targets.  Continue demonstration of distributed, embedded fuzing concepts for close-controlled strike, area attack, and penetration applications such as layer counting at high speed, including assessing long-term safety, survivability, and functionality.  Continue development of ordnance technologies to allow tailored lethality by controlling weapon fragmentation. Continue to mature ordnance technologies for rapid transition into high-speed strike weapon concepts, collecting complex arena test data for implementation into lethality modeling and simulation tools. Continue to develop test capabilities and high fidelity analysis tools into higher level engineering and fast-running models to enable the war-fighter to make more accurate weaponeering choices.  Continue to develop ordnance technologies\/methodologies for high-speed impact and functional defeat.  Continue research into armament systems for Special Operations applications. Continue to conduct lethality analyses for air-to-air weaponry, and improve lethality and survivability tools at the mesoscale and micro-scale.  Continue to mature research on distributed, collaborative, cooperative effects munitions technologies.  Continue the development of high-fidelity test capabilities and analysis tools to evaluate ordnance technologies in relevant environments.  Continue development of improved material models and develop further joint kinetic\/directed energy common target models.  Continue to develop models for progressive collapse, multiple point initiation, secondary debris and others."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, this work is performed under the Ordinance Technologies effort in PE 0603035F, Next Generation Effects Dev\/Demos, Project 63670A, Weapon Technology Development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $29.582 million.  Funding decreased due to the transfer and realignment of this work to the Ordinance Technologies effort in PE 0603035F, Next Gen Effects Dev\/Demos, Project 63670A, Weapon Technology Development as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Guidance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop guidance technologies to improve the precision, controlled lethality, and flexibility of conventional, air-delivered munitions.  Specific technical areas include precision navigation and terminal seekers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "51.884"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.313"
                                            },
                                            "Text": {
                                                "val": "Complete hardware-in-the-loop and software-in-the-loop characterization air-to-air and air-to-ground guidance and control technologies.  Continue integration of hardware-in-the-loop, software-in-the-loop, and other Modeling and Simulation technologies for the demonstration of open architecture, high-speed, cooperative, and modular weapon munition concepts.  Continue the design and development of seeker subsystem prototypes for platform self-defense.  Continue development of advanced, high-resolution infrared scene projectors, distributed simulation concepts, software defined Radio Frequency test chamber, scene generation, mission, engagement, campaign level simulations, and panoramic infrared dome technologies.  Continue to develop technologies for precision navigation of weapons in Global Positioning System-denied scenarios.  Continue to mature and integrate advanced carriage and release concepts and sub-systems.  Complete fabrication of Modeling and Simulation center and initiate processes to enable simultaneous multi-level security Modeling and Simulation activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, this work is performed under the Guidance Technologies effort in Program Element 0603035F, Next Generation Effects Dev\/Demos, Project 63670A, Weapon Technology Development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $28.313 million.  Funding decreased due to the transfer and realignment of this work to the Guidance Technologies effort in PE 0603035F, Next Gen Effects Dev\/Demos, Project 63670A, Weapon Technology Development as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "63670B"
                    },
                    "ProjectTitle": {
                        "val": "Weapon Concept Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "72.836"
                        },
                        "CurrentYear": {
                            "val": "167.922"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, refines, integrates, demonstrates, and assesses ordnance and guidance technologies to reduce risk for potential air-launched conventional weapons acquisitions.  The project concentrates in two effort areas, Air-to-Air Concept Development and Air-to-Ground Concept Development.  The project focuses on risk reduction of advanced explosives, fuzes, warheads, sub-munitions, and weapon airframes, carriage and dispensing; as well as innovative munition seekers, weapon aerodynamics, navigation and control, and guidance subsystem integration\/simulation.\n\nIn FY 2021, Project 63670B, Weapon Concept Development, non-Vanguard efforts and activities will be transferred from PE 0603601F, Conventional Weapons Technology, to PE 0603035F, Next Gen Effects Dev\/Demo.  Golden Horde Vanguard activities under this Project will be consolidated and transferred in FY 2021 from PE 0603601F, Conventional Weapons Technology to PE 0603032F, Future AF Integrated Technology Demos, Project 630320, Air Force Vanguards.  These transfers are part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas that better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019.  The Project and associated non-Vanguard efforts and activities will continue to be executed by the Air Force Research Laboratory Munitions Technology Directorate located in Eglin Air Force Base, Florida.  This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air-to-Air Concept Development"
                                    },
                                    "Description": {
                                        "val": "Mature, integrate, and demonstrate air-to-air weapon components and systems to include ordnance, guidance, and carriage and release technologies to demonstrate war-fighter capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.071"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "81.207"
                                            },
                                            "Text": {
                                                "val": "Continue developing the technology trade space to enable air-to-air weapons with robust capability in the future-years threat environment, including technologies for efficient propulsion, high lethality, efficient flight\/high-agility, miniaturization, and cost and risk reduction for both offensive and defensive purposes.  Continue to develop and test prototype propulsion systems with flexibility to enable more adaptable next generation air-to-air weapons.  Continue to conduct lethality studies to enable design of small form factor warheads lethal against the future plus target set.  Continue to develop preliminary design of air-to-air weapon concepts for sixth generation platforms.  Continue to document missile flight dynamics trade space and conduct wind-tunnel experiments to characterize airframes and validate aerodynamic codes leading to development of highly maneuverable and efficient missiles to counter advanced targets, and improve persistence and survivability of future platforms.  Continue to conduct ground and arena tests of advanced weapons experimental-carriages for sixth generation weapon concept and prepare for flight worthiness testing.  Continue to mature simulation architectures to assess the trades and synergies between kinetic and directed energy weapons.  Continue to incorporate higher fidelity methodologies into systems level analysis including joint weapons effectiveness and perform experiments with small warheads to obtain data for lethality analysis and validate designs.  Continue to plan and execute highly agile airframe ground tests and integrated sub-system experimentation.  Initiate planning for major subsystem component tests to verify baseline performance for future counter-air application and platform integration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, this work is performed under Air-to-Air Concept Development effort under PE 0603035F, Next Generation Effects Dev\/Demos, Project 63670B, Weapon Concept Development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $81.207 million.  Funding decreased due to the transfer and realignment of this work to the Air-to-Air Concept Development effort in PE 0603035F, Next Gen Effects Dev\/Demos, Project 63670B, Weapon Concept Development as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air-to-Ground Concept Development"
                                    },
                                    "Description": {
                                        "val": "Mature, integrate, and demonstrate air-to-ground weapon components and systems (ordnance, guidance, and carriage and release technologies) to demonstrate war-fighter capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "50.765"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "86.715"
                                            },
                                            "Text": {
                                                "val": "Complete low-cost cruise missile\/small engine flight test demo.  Continue to conduct relevant long range strike weapon technology demonstrations to reduce risk for potential follow-on acquisition programs, and finalize system detailed design for flying hypersonic munition demonstrator flight. Continue the development of munition concepts to incorporate technologies for carriage and terminal impact at high speed.  Continue planning and technology risk reduction including demonstration and initial flight testing for weapons concepts responsive to the future-year time-frame threat environment including hypersonic and cooperative\/collaborative concepts.  Consolidate collaborative munition technology efforts into Air Force Vanguard Golden Horde to include hardware\/software development\/testing, flight , and modeling and simulations efforts.  Continue to mature simulation architectures to assess the trades and synergies between kinetic and directed energy weapons.  Continue to incorporate higher fidelity methodologies into systems level analysis including joint weapons effectiveness and to apply methodology to support future air dominance analysis.  Continue to investigate kinetic\/non-kinetic payloads, seeker, and fuze technology for hypersonic applications.  Continue system integration of algorithms and software defined radios onto pathfinder weapon system to enable synchronized collaborative weapon effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, non-Vanguard efforts are performed under Air-to-Ground Concept Development effort in PE 0603035F, Next Generation Effects Dev\/Demos, Project 63670B, Weapon Concept Development.  Golden Horde Vanguard activities are performed under the Golden Horde effort in PE 0603032F, Future AF Integrated Technology Demos, Project 630320, Air Force Vanguards."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $86.715 million.  Funding decreased due to the transfer and realignment of this work to the Air-to-Ground Concept Development effort in PE 0603035F, Next Gen Effects Dev\/Demos, Project 63670B, Weapon Concept Development, with the execution of Golden Horde Vanguard activities which will be realigned to the Golden Horde effort in PE 0603032F, Future AF Integrated Technology Demos, Project 630320, Air Force Vanguards, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}