{
    "id": "2021-Army-PB-2040-JBOOK-2ce7b76ca8f41dbc06183380f90728d4a8e40b9122c9effab5b4a02fdffb364e-8",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605604A"
        },
        "ProgramElementTitle": {
            "val": "Survivability\/Lethality Analysis"
        },
        "R1LineNumber": {
            "val": "194"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "39.886"
            },
            "CurrentYear": {
                "val": "35.075"
            },
            "BudgetYearOne": {
                "val": "36.001"
            },
            "BudgetYearOneBase": {
                "val": "36.001"
            },
            "BudgetYearTwo": {
                "val": "36.839"
            },
            "BudgetYearThree": {
                "val": "35.67"
            },
            "BudgetYearFour": {
                "val": "36.365"
            },
            "BudgetYearFive": {
                "val": "36.369"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "256.205"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) funds objective vulnerability assessment products necessary for the inherently-governmental Army Test & Evaluation Command\/Army Evaluation Center (ATEC\/ AEC) mission, for the Research and Development communities as well as the Analytical communities. Products result from investigating, analyzing, assessing, experimenting and reporting on the survivability of Soldiers, and on the survivability, lethality and vulnerability (SLV) of the highest-priority Army and threat systems. Products are leveraged within the Army Futures Command and the Program Manager \/ Program Executive Office (PM\/PEO) community to exercise constructive design influence over materiel development and to provide credible engineering-level underpinning and input to the Army Analytical Community. While the Army is at war, analytical results funded by this PE are also directly leveraged for urgent materiel releases and support to current operations.\n\nThis PE provides quantitative lethality and survivability analyses and data for fielded and developmental systems as the Army pursues its modernization priorities and ensures readiness through the fielding of lethal and survivable systems for multi-domain operations. PE funds engineering level SLV analysis in the areas of Long Range Precision Fires systems, Next Generation Combat Vehicles, Future Vertical Lift, Network\/C3I, Air & Missile Defense, Soldier Lethality, and other highest Army priority efforts in the threat competencies of ballistics, electronic warfare, and cyber. \n\nVulnerability assessments funded by this PE are conducted across the spectrum of multi-domain battlefield threats to include: guns, missiles, mines and other methods of inflicting physical damage; jammers, countermeasures, and other electronic warfare techniques; cyber threats from insiders to external nation states; and directed energy weapons. Many different kinds of technical capabilities are used to generate these analyses, including specialized equipment, modeling & simulation, and experimental facilities. This PE ensures these capabilities can represent a credible live, virtual, or constructive hostile environment required for vulnerability assessment, thus enabling evaluators, developers, users, and decision makers to make informed SLV judgments for both Soldiers and materiel. These technical survivability and lethality details: enable properly informed decisions concerning acquisition and production; maximize Army overmatch in systems and tactics; inform investment priorities; and mitigate system weaknesses prior to actual combat. \n\nTechnical data and analysis results funded by this PE are efficiently leveraged for many different Army uses, reducing total cost to the Army by eliminating the need for duplicative capabilities funded by individual system developers. Central funding of this mission assures accurate and consistent treatment of survivability and lethality across all classes of systems, across all formal system Evaluations, and across the Army's analytical community as it conducts analyses of alternatives and other studies. The U.S  Army Combat Capabilities Development Command (CCDC) and ATEC\/AEC integrate the SLV work program into Army's formal Evaluation process to ensure ATEC can comply with its legally-mandated responsibility to assess system survivability along with effectiveness and suitability."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "40.48"
                },
                "CurrentYear": {
                    "val": "35.075"
                },
                "BudgetYearOne": {
                    "val": "35.881"
                },
                "BudgetYearOneBase": {
                    "val": "35.881"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "39.886"
                },
                "CurrentYear": {
                    "val": "35.075"
                },
                "BudgetYearOne": {
                    "val": "36.001"
                },
                "BudgetYearOneBase": {
                    "val": "36.001"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.594"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0.12"
                },
                "BudgetYearOneBase": {
                    "val": "0.12"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.594"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.12"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.12"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675"
                    },
                    "ProjectTitle": {
                        "val": "Army Survivability Analysis & Evaluation Supp"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "39.886"
                        },
                        "CurrentYear": {
                            "val": "35.075"
                        },
                        "BudgetYearOne": {
                            "val": "36.001"
                        },
                        "BudgetYearOneBase": {
                            "val": "36.001"
                        },
                        "BudgetYearTwo": {
                            "val": "36.839"
                        },
                        "BudgetYearThree": {
                            "val": "35.67"
                        },
                        "BudgetYearFour": {
                            "val": "36.365"
                        },
                        "BudgetYearFive": {
                            "val": "36.369"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "256.205"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds objective vulnerability assessment products necessary for the inherently-governmental Army Test & Evaluation Command\/Army Evaluation Center (ATEC\/ AEC) mission, for the Research and Development communities as well as the Analytical communities. Products result from investigating, analyzing, assessing, experimenting and reporting on the survivability of Soldiers, and on the survivability, lethality and vulnerability (SLV) of the highest-priority Army and threat systems. Products are leveraged within the Army Futures Command and the Program Manager \/ Program Executive Office (PM\/PEO) community to exercise constructive design influence over materiel development and to provide credible engineering-level underpinning and input to the Army Analytical Community. While the Army is at war, analytical results funded by this Project are also directly leveraged for urgent materiel releases and support to current operations.\n\nThis Project provides quantitative lethality and survivability analyses and data for fielded and developmental systems as the Army pursues its modernization priorities and ensures readiness through the fielding of lethal and survivable systems for multi-domain operations. This Project funds engineering level SLV analysis in the areas of Long Range Precision Fires systems, Next Generation Combat Vehicles, Future Vertical Lift, Network\/C3I, Air & Missile Defense, Soldier Lethality, and other highest Army priority efforts in the threat competencies of ballistics, electronic warfare, and cyber. \n\nVulnerability assessments funded by this Project are conducted across the spectrum of multi-domain battlefield threats to include: guns, missiles, mines and other methods of inflicting physical damage; jammers, countermeasures, and other electronic warfare techniques; cyber threats from insiders to external nation states; and directed energy weapons. Many different kinds of technical capabilities are used to generate these analyses, including specialized equipment, modeling & simulation, and experimental facilities. This Project ensures these capabilities can represent a credible live, virtual, or constructive hostile environment required for vulnerability assessment, thus enabling evaluators, developers, users, and decision makers to make informed SLV judgments for both Soldiers and materiel. These technical survivability and lethality details: enable properly informed decisions concerning acquisition and production; maximize Army overmatch in systems and tactics; inform investment priorities; and mitigate system weaknesses prior to actual combat. \n\nTechnical data and analysis results funded by this Project are efficiently leveraged for many different Army uses, reducing total cost to the Army by eliminating the need for duplicative capabilities funded by individual system developers. Central funding of this mission assures accurate and consistent treatment of survivability and lethality across all classes of systems, across all formal system Evaluations, and across the Army's analytical community as it conducts analyses of alternatives and other studies. The U.S Army Combat Capabilities Development Command (CCDC) and ATEC\/AEC integrate the SLV work program into Army's formal Evaluation process to ensure ATEC can comply with its legally-mandated responsibility to assess system survivability along with effectiveness and suitability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Survivability, Lethality, Vulnerability Analyses (SLVA) for Ground, Aviation, Munitions, and Soldier Systems"
                                    },
                                    "Description": {
                                        "val": "This activity provides integrated multi-domain SLV for CSA and other highest priority Ground, Aviation, Munitions, and Soldier Systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.621"
                                            },
                                            "Text": {
                                                "val": "Conducted ballistic and other needed SLVA on AEC's highest priority platform and weapon systems, supporting LFT&E pre-shot predictions, damage assessments, post-shot analysis, and crew survivability analysis and provided technical data for system evaluation reports. Provided vulnerability reduction recommendations to PMs for those systems supported. For systems analyzed, provided data to AMSAA for support of Army Analyses of Alternatives and other Army studies; incorporated collected data into the DOT&E live-fire report to Congress as well as the System Evaluation Reports prepared by ATEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.604"
                                            },
                                            "Text": {
                                                "val": "Will conduct SLVA on Long Range Precision Fires, Next Generation Combat Vehicle, Future Vertical Lift, and Soldier lethality systems, and on AEC and RDECOM?s highest priority platform and weapon systems. For systems supported will work with materiel developers to constructively influence system design and will provide relevant data to Army analytical community to for supporting Analyses of Alternatives and other Army studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.37"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.37"
                                            },
                                            "Text": {
                                                "val": "Will conduct SLVA on Long Range Precision Fires, Next Generation Combat Vehicle, Future Vertical Lift, and Soldier lethality systems, and on AEC and CCDC's highest priority platform and weapon systems. For systems supported, working with materiel developers to constructively influence system design and providing relevant data to Army analytical community for supporting Analyses of Alternatives and other Army studies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increase supports anticipated mission requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) System Survivability Assessments"
                                    },
                                    "Description": {
                                        "val": "This effort produces assessments of the survivability of C4ISR systems in EW and cyber threat environments and conducts Electronic Attack (EA) and cyber analyses that reveal critical vulnerabilities in C4ISR systems. It also defines, demonstrates, and recommends mitigation options to proponents and evaluators of C4ISR. A cyber vulnerability database is maintained for the benefit of the community."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.662"
                                            },
                                            "Text": {
                                                "val": "Analyzed EP and cybersecurity for systems under test and systems under investigation in future NIEs and other high priority tests and for additional highest priority technologies and developmental systems as specified by ATEC so as to reduce costs of downstream development by identifying and fixing vulnerabilities earlier and to assure that formal Army evaluations at Milestone decision points are fully informed on EP and cyber issues. Matured and updated cyber-attack M&S tools so as to more accurately assess the operational impact of such attacks on small unit mission accomplishment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.006"
                                            },
                                            "Text": {
                                                "val": "Will conduct cyber and EW SLVA on network components as specified by the Network C3I CFT and AEC and on RDECOM?s highest priority Network\/C3 and other systems. For systems supported will work with materiel developers to constructively influence system design and will provide relevant data to Army analytical community to support Analyses of Alternatives and other Army studies. Cyber support includes resiliency assessments of systems and Soldiers together and verification of fixes to identified vulnerabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.075"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.075"
                                            },
                                            "Text": {
                                                "val": "Will conduct cyber and EW SLVA on network components as specified by the Network C3I CFT and AEC and on CCDC's highest priority Network\/C3 and other systems. For systems supported working with materiel developers to constructively influence system design and providing relevant data to Army analytical community to support Analyses of Alternatives and other Army studies. Cyber support includes resiliency assessments of systems and Soldiers together and verification of fixes to identified vulnerabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2021 increase supports anticipated mission requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability, Lethality, Vulnerability (SLV) Analyses for Developmental Air and Missile Defense Systems"
                                    },
                                    "Description": {
                                        "val": "Conduct integrated SLV analyses for developmental air and missile defense systems, pre-planned product improvements of current systems, and recently fielded systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.601"
                                            },
                                            "Text": {
                                                "val": "Designed, developed, and employed advanced electronic attack countermeasures to assess priority AMD systems and system of systems. Developed and provided advanced EA and cybersecurity test support for highest priority operational and developmental test events. Provided additional EA\/EP and cyber analysis for other AMD systems as prioritized by ATEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.872"
                                            },
                                            "Text": {
                                                "val": "Will conduct high-priority SLVA on AMD systems and components as specified by AEC and RDECOM. For systems supported will work with materiel developers to constructively influence system design and will provide relevant data to Army analytical community to support Analyses of Alternatives and other Army studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.556"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.556"
                                            },
                                            "Text": {
                                                "val": "Will conduct high-priority SLVA on AMD systems and components as specified by AEC and CCDC. For systems supported working with materiel developers to constructively influence system design and providing relevant data to Army analytical community to support Analyses of Alternatives and other Army studies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2021 increase supports anticipated mission requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.002"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC  638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.593"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC  638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC  638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}