{
    "id": "2021-AirForce-PB-3600-JBOOK-3e653292bf23896b48cfe5595b0e37331c47f0115b5ffcbbc983acf5fb3f0001-51",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V3B-U_RDTE_JustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0708611F"
        },
        "ProgramElementTitle": {
            "val": "Support Systems Development"
        },
        "R1LineNumber": {
            "val": "292"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "4.406"
            },
            "CurrentYear": {
                "val": "0.539"
            },
            "BudgetYearOne": {
                "val": "11.838"
            },
            "BudgetYearOneBase": {
                "val": "11.838"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "13.725"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.497"
                },
                "CurrentYear": {
                    "val": "0.539"
                },
                "BudgetYearOne": {
                    "val": "11.860"
                },
                "BudgetYearOneBase": {
                    "val": "11.860"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.406"
                },
                "CurrentYear": {
                    "val": "0.539"
                },
                "BudgetYearOne": {
                    "val": "11.838"
                },
                "BudgetYearOneBase": {
                    "val": "11.838"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.091"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.022"
                },
                "BudgetYearOneBase": {
                    "val": "-0.022"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.091"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.022"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.022"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675042"
                    },
                    "ProjectTitle": {
                        "val": "Log Application Logisitics Integration (LALI)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.406"
                        },
                        "CurrentYear": {
                            "val": "0.539"
                        },
                        "BudgetYearOne": {
                            "val": "11.838"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.838"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "13.725"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Logistics, Installations and Mission Support - Enterprise View (LIMS-EV) is the A4 reporting and analytics gateway providing a single \"source of truth\" via aggregated logistics data from numerous authoritative logistics systems using a wide range of analytic tools from streamlined, comprehensive dashboards to intricate, tailored adhoc reporting for multiple logistics mission areas including weapon systems, engines, support equipment, financials, maintenance, repair network, vehicles, and mobile. LIMS-EV delivers 20+ Business Intelligence capabilities to various logistics business areas by integrating data from 70+ systems with world-wide access by 30K+ users including decision makers at all AF levels (Flight, Squadron, Group, Wing, MAJCOM, COCOM).  \n\nProjects currently in development include four new capabilities modernizing three views : (1) Weapon System Sustainment (WSS) Automation - 1.0, (2) Engines View 4.0 (ENG) (deployment),  (3) Supply Chain Management (SCM) - 8.0 DLA iPID\/Serialized Control Total Asset Visibility.  These are being delivered using an Scaled Agile Framework.   Using Lean and Agile methodologies to efficiently manage and execute scope, three capabilities affecting two views have been pushed out and are planned to be delivered after FY20.  This includes (1) Vehicle View - 8.0 MELRAT and Virtual Parking Tool as well as (2) Support Equipment View (SEV) 2.0.\n\nFuture LIMS-EV modernization include federating\/integrating LIMS-EV with the A4 enterprise Basing and Logistics Analytics Data Environment(BLADE), which will allow expansion of LOGCOP capability using LIMS-EV data.   Additionally, refactoring LIMS-EV using enterprise technical solutions will increase scalability and portability of LIMS-EV views by reducing reliance on legacy software applications which currently require separate licensing which increases cost and limits portability.   Asset Lifecycle Management Automation, Improved Supply Chain Visibility and End-to-End Maintenance Lifecycle Management are planned to deliver eight new capabilities to modernize six current views which targets 80% of current LIMS-EV users.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver our integrated logistics capability. The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F.\n\nThis requirement supports performance of a full financial audit as required by title 10 U.S.C. Chapter 9A, Sec 240-D.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "LIMS-EV Version 3.0 Product Development"
                                    },
                                    "Description": {
                                        "val": "Expanded, Scalable, Portable, Enterprise Logistics Data Accessibility"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.406"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.539"
                                            },
                                            "Text": {
                                                "val": "Complete Three Major Enhancements and 11 Minor change requests for the Supply, Maintenance, Avionics, Propulsion, Repair Network communities to build the foundation and support targeted initial offerings of the following capabilities: \n- Enable secure, elastic capability that automatically scales to on-demand peak needs, provides reliable response and reduces scale and time of outages.\n- Provide incremental improved customer user and data quality metrics.\n- Isolate data latency issues and provide greater stability in ETL performance between source systems, DISA and Cloud One infrastructure"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.838"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.838"
                                            },
                                            "Text": {
                                                "val": "FY 2021 Base Plans:\nEight Major Enhancements and 23 Minor change requests for the Vehicle Management, Supply, Maintenance,\nAvionics, Propulsion, Repair Network, Support Equipment and Communication Security (COMSEC) communities\nthat build on prior development to enable advanced Predictive Enterprise Logistics Reporting and Analytics in\nthe following areas:\n-  Begin to implement a modeling & simulation capability\n-  Begin Big data analytics\n-  Begin actuarial capability and reliability analysis\n-  Begin to incorporate operational data, such as flight profile data to support deep performance analysis of weapon system components and supporting predictive modeling\n-  Will begin to configure and simulate different logistical outcomes based on known factors\n-  Provide greater control to functional representatives to transform data by revising reference tables and business rules without developer intervention\n-  Provide greater functional self service provisioning capability\n-  Implement Mobile Capability to support initiatives such as Flight line of the Future\n-  Enable federation of data across multi-security and functional domains.\n-  Expand ADHOC reporting capability without needing special data universes\n-  Modernize expanded visualization capability, with greater consistency across application views.\n-  Expand access to new data feeds as well as unstructured and semi-structured data\n-  Provide foundation infrastructure for Logistics Data Environment\n-  Improve Forecasting Capability\n-  Forecast future health of weapon system and equipment with constraint analysis\n-  Improve trend analysis\n-  Implement Statistical Process Control with anomaly detection\n-  Determine root cause and fault analysis\n-  Project future data with high degree of confidence\n-  Display OSD Re-phasing and Program reduction limits ability for new enhancements"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased to ramp up development for enhancements\/changes. Significant increase in the number of major enhancements and minor changes requests are described in the plans above. FY20 funding was reduced by $6.109M to account for the availability of prior year execution balances."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "LIMS-EV will utilize services provided by the Air Force Cloud One Government Cloud Framework. AFLCMC\/HNII Data Services Program Management Office (PMO), as LIMS-EV Program Manager, is responsible to competitively acquire additional LIMS-EV capabilities using a variety of fixed price, labor hour, time and material, and cost plus contracts within the Cloud One Framework.\nLIMS-EV capabilities utilize services provided by the DISA Government Cloud Data Services (GCDS)\/Cloud One Framework. AFLCMC\/HNII Data Services PMO, as LIMS-EV Program Manager, manages LIMS-EV development projects following the Agile\/Rapid Prototyping\/Rapid Fielding software development release process.  \nLIMS-EV development projects will be implemented via the Cloud One development contract under oversight by AFLCMC\/HNII Data Services Program Management Office, Wright-Patterson Air Force Base, Ohio. Future development\/modification and sustainment contracts are being developed for post-GCSS-AF II contract period of performance."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "LALI LIMS-EV Systems Engineering Contractor Support (Product Development) LIMS-EV"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.406"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.539"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.838"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.838"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Support Systems Developments PE 0708611F"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "LIMS-EV Version 3.0"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "LIMS-EV alignment with A4 enterprise data environment (BLADE)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "LIMS-EV native cloud solution integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Asset Lifecycle Management Automation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Improved Supply Chain Visibility"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Machine Learning Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "End-to-End Maintenance Lifecycle Management"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}