{
    "id": "2021-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-9791cb30a17933e364f6388e243081e196aa85793c267cee3ac7042f1c1057a0-8",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603286E"
        },
        "ProgramElementTitle": {
            "val": "ADVANCED AEROSPACE SYSTEMS"
        },
        "R1LineNumber": {
            "val": "34"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "287.907"
            },
            "CurrentYear": {
                "val": "279.741"
            },
            "BudgetYearOne": {
                "val": "230.978"
            },
            "BudgetYearOneBase": {
                "val": "230.978"
            },
            "BudgetYearTwo": {
                "val": "191.443"
            },
            "BudgetYearThree": {
                "val": "185.811"
            },
            "BudgetYearFour": {
                "val": "207.034"
            },
            "BudgetYearFive": {
                "val": "213.608"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "302.463"
                },
                "CurrentYear": {
                    "val": "279.741"
                },
                "BudgetYearOne": {
                    "val": "217.434"
                },
                "BudgetYearOneBase": {
                    "val": "217.434"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "287.907"
                },
                "CurrentYear": {
                    "val": "279.741"
                },
                "BudgetYearOne": {
                    "val": "230.978"
                },
                "BudgetYearOneBase": {
                    "val": "230.978"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-14.556"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "13.544"
                },
                "BudgetYearOneBase": {
                    "val": "13.544"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-3.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-11.556"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "13.544"
                                },
                                "BudgetYearOneBase": {
                                    "val": "13.544"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019:  Decrease reflects reprogrammings and the SBIR\/STTR transfer.\nFY 2020:  N\/A\nFY 2021:  Increase reflects initiation of the Gunslinger program."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AIR-01"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED AEROSPACE SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "287.907"
                        },
                        "CurrentYear": {
                            "val": "279.741"
                        },
                        "BudgetYearOne": {
                            "val": "230.978"
                        },
                        "BudgetYearOneBase": {
                            "val": "230.978"
                        },
                        "BudgetYearTwo": {
                            "val": "191.443"
                        },
                        "BudgetYearThree": {
                            "val": "185.811"
                        },
                        "BudgetYearFour": {
                            "val": "207.034"
                        },
                        "BudgetYearFive": {
                            "val": "213.608"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Advanced Aerospace Systems program element, budgeted in the Advanced Technology Budget Activity, is focused on exploiting high pay-off opportunities to provide revolutionary new system capabilities, as opposed to incremental or evolutionary advancements, in order to achieve undeterrable air presence at dramatically reduced costs.  Rapid prototyping and experimentation of integrated system concepts, as well as enabling vehicle subsystems will be conducted.  Programs will explore new architectural concepts that employ a mix of weapon technologies that achieve lethality through a combination of overwhelming performance and overwhelming numbers rather than through the use of singular and costly high value assets.  Studies conducted under this program element include examination and evaluation of emerging aerospace threats, technologies, concepts, use of autonomy to minimize risk, and applications for missiles, munitions, and vehicle systems."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Hypersonics Weapons Programs Development and Transition"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "30.000"
                                        },
                                        "Text": {
                                            "val": "-  HAWC: Performed risk reduction efforts and initiated ground testing of the demonstration system.\n-  HAWC: Conducted additional inlet cover ejection test.\n-  HAWC: Completed additional high temperature instrumentation.\n-  TBG: Conducted risk reduction efforts on additional leading edge materials and additional coating systems.\n-  TBG: Conducted instrumentation development for the leading edge.\n-  TBG: Began fabrication of additional aeroshell."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Boost Glide"
                                    },
                                    "Description": {
                                        "val": "The Tactical Boost Glide (TBG) program is a Joint DARPA \/ Air Force effort that will develop and demonstrate technologies to enable air-launched tactical range hypersonic boost glide systems, including flight demonstration of a vehicle that is traceable to an operationally relevant weapon that can be launched from current platforms.  The program will also consider traceability, compatibility, and integration with the Navy Vertical Launch System (VLS).  The metrics associated with this objective include total range, time of flight, payload, accuracy, and impact velocity.  The program will address the system and technology issues required to enable development of a hypersonic boost glide system considering (1) vehicle concepts possessing the required aerodynamic and aero-thermal performance, controllability and robustness for a wide operational envelope, (2) the system attributes and subsystems required to be effective in relevant operational environments, and (3) approaches to reducing cost and improving affordability for both the demonstration system and future operational systems.  TBG capabilities are planned for transition to the Air Force and the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "140.568"
                                            },
                                            "Text": {
                                                "val": "-  Continued procurement of hardware for demonstration vehicles.\n-  Continued Assembly, Integration, and Test (AI&T) of Static Test Article (STA).\n-  Continued risk reduction and qualification testing.\n-  Continued AI&T of remaining test articles.\n-  Continued detailed flight test and range safety planning, coordination, and documentation.\n-  Updated Technology Maturity Plans (TMPs) and Risk Management Plans (RMPs).\n-  Planned and conducted additional aerodynamic and aero-thermodynamic risk reduction testing.\n-  Planned and conducted additional material and thermo-structural risk reduction testing.\n-  Planned and conducted additional materials arc-jet testing.\n-  Updated aerodynamic and materials databases based on risk reduction test analysis.\n-  Planned additional tests for expanded risk reduction.\n-  Procured hardware for testing and began AI&T of test articles.\n-  Awarded contract to second TBG performer to evolve an All-Up Round (AUR) design to a critical design level of maturity.\n-  Began second TBG performer aerodynamic and aero-thermodynamic risk reduction testing.\n-  Planned and conducted second TBG performer material and thermo-structural risk reduction testing.\n-  Updated second TBG performer aerodynamics and materials databases based on risk reduction test analysis.\n-  Began second TBG performer detailed flight test and range safety planning, coordination, and documentation.\n-  Began procurement of second TBG performer's long-lead hardware for flight vehicles.\n-  Developed preliminary requirements for a Navy variant AUR.\n-  Began trade studies and assessed booster and Vertical Launch System (VLS) integration development needs for a Navy variant AUR.\n-  Began Navy variant test planning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "152.100"
                                            },
                                            "Text": {
                                                "val": "-  Complete Static Test Article (STA) aeroshell thermo-structural testing.\n-  Complete Assembly, Integration, and Test (AI&T) of Engineering Development Unit (EDU) and first flight test vehicle.\n-  Conduct test readiness review (TRR) for first flight, conduct flight test, and complete post-flight analysis.\n-  Continue AI&T of second and third flight test vehicles.\n-  Continue additional aerodynamic and aero-thermodynamic risk reduction testing.\n-  Continue additional material and thermo-structural risk reduction testing.\n-  Continue additional materials arc-jet testing.\n-  Plan additional tests for expanded risk reduction.\n-  Continue procuring hardware for additional tests and AI&T of test articles.\n-  Begin second TBG performer's engineering component testing and design verification testing.\n-  Complete second TBG performer air vehicle and all-up round (AUR) subsonic, transonic, and hypersonic performance and control tests.\n-  Conduct second TBG performer demonstration system solid rocket motor static fire test.\n-  Continue second TBG performer material and thermo-structural risk reduction testing, and conduct engineering environmental and static loads testing.\n-  Continue second TBG performer's material and thermo-structural risk reduction testing.\n-  Continue procurement of second TBG performer's long-lead hardware for flight vehicles.\n-  Continue second TBG performer's detailed flight test and range safety planning, coordination, and documentation.\n-  Complete second TBG performer's subsystem and system-level critical design reviews.\n-  Begin second TBG performer's detailed design, procurement of remaining hardware, and build of flight test vehicles.\n-  Plan and conduct Navy variant risk reduction testing.\n-  Continue detailed Navy variant test planning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "116.508"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "116.508"
                                            },
                                            "Text": {
                                                "val": "-  Conduct TRRs for two flights, conduct flight tests, and complete post-flight analysis.\n-  Continue detailed planning of additional tests for expanded risk reduction.\n-  Continue procurement of hardware for additional tests and continue AI&T of test articles.\n-  Continue second TBG performer's aerodynamic and aero-thermodynamic risk reduction testing.\n-  Continue second TBG performer's material and thermo-structural risk reduction testing.\n-  Continue second TBG performer's materials arc-jet testing.\n-  Complete second TBG performer's engineering component and system-level testing and design verification testing.\n-  Complete second TBG performer's material and thermo-structural risk reduction testing, including structural model validation test, and full-scale hot structure test.\n-  Complete fabrication and integration and begin test of second TBG performer's inert operating missiles including ground testing and captive carriage flight testing.\n-  Continue second TBG performer's detailed flight test and range safety planning, coordination, and documentation.\n-  Continue second TBG performer's detailed design, procurement of remaining hardware, and build of flight test vehicles.\n-  Continue Navy variant risk reduction testing.\n-  Conduct Navy variant demonstration article critical design review.\n-  Conduct Navy variant subsystem preliminary and critical design reviews."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program progression from the first performer's flight tests to Vertical Launch System(VLS) risk reduction and second performer's design to assembly, integration, and test phase."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Full Range Engine (AFRE)"
                                    },
                                    "Description": {
                                        "val": "The Advanced Full Range Engine (AFRE) program will establish the feasibility of a hypersonic aircraft reusable propulsion system through a two-pronged approach.  AFRE will demonstrate turbine to Dual Mode Ramjet (DMRJ) transition of a Turbine-Based Combined Cycle (TBCC) propulsion system utilizing an off-the-shelf turbine engine.  Large scale components of this complex propulsion system will be developed and demonstrated independently; to be followed by a full-scale freejet TBCC propulsion system mode transition ground test.  Accomplishing these objectives will enable future airfield-based hypersonic systems to operate without special logistics considerations, resulting in transformational changes in long range strike, high speed Intelligence, Surveillance and Reconnaissance (ISR) and Two-Stage-To-Orbit (TSTO) operations.  The anticipated transition partner for this effort is the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "36.221"
                                            },
                                            "Text": {
                                                "val": "-  Completed manufacturing and started ground testing of full-scale turbine\/common nozzle with water injection.\n-  Completed manufacturing and began test installation of common inlet aerodynamic model.\n-  Completed integrated system (TBCC) design (preliminary and critical design)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "40.741"
                                            },
                                            "Text": {
                                                "val": "-  Complete full-scale turbine\/common nozzle with water injection ground test.\n-  Complete full-scale combustor (DMRJ) fabrication and ground test demonstration.\n-  Complete installation and testing of common inlet aerodynamic model.\n-  Complete full-scale inlet fabrication, test installation, and checkout test.\n-  Complete component (combustor, turbine, and nozzle) post-test inspection and refurbishment.\n-  Begin integrated TBCC system assembly, installation and checkout tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.700"
                                            },
                                            "Text": {
                                                "val": "-  Complete integrated TBCC system freejet test and final report."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects completion of full-scale testing and final program reporting."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Glide Breaker"
                                    },
                                    "Description": {
                                        "val": "Glide Breaker will develop a critical component technology to support a lightweight vehicle designed for precise engagement of hypersonic threats at very long range.  Glide Breaker focuses on a single, critical, long-lead technology with applicability to a variety of interceptor concepts and designs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.546"
                                            },
                                            "Text": {
                                                "val": "-  Executed trade studies, identified key technologies and estimated system performance.\n-  Initiated preliminary design reviews for technology demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete preliminary design reviews.\n-  Continue to execute trade studies, identify key technologies and estimate system performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete critical design review for technology demonstration.\n-  Complete component level bench testing.\n-  Complete test readiness review for critical, long-lead technology demonstration.\n-  Conduct critical, long-lead technology demonstration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects completion of bench testing and movement to technology demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operational Fires"
                                    },
                                    "Description": {
                                        "val": "The goal of the Operational Fires (OpFires) program is to develop and demonstrate a novel ground-launched system enabling advanced tactical weapons to penetrate modern enemy air defenses and rapidly and precisely engage critical time sensitive targets.  This program seeks to develop an advanced booster capable of delivering a variety of payloads at a variety of ranges.  Additional considerations include the need for compatible mobile ground launch platforms enabling integration with existing ground forces and infrastructure, and specific system attributes required for rapid deployment and redeployment.  The OpFires program will conduct a series of subsystem tests designed to evaluate component design and system compatibility, and culminate in integrated end-to-end flight tests.  OpFires will leverage and integrate ongoing investments in hypersonics to achieve these objectives.  The transition partner is the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.099"
                                            },
                                            "Text": {
                                                "val": "-  Completed ground launch platform Systems Requirements Review (SRR) and Conceptual Design Review (CoDR).\n-  Completed booster propulsion system Preliminary Design Review (PDR).\n-  Conducted early propulsion system risk reduction testing.\n-  Evaluated combustion stability in representative hybrid motor.\n-  Performed extinguishable propellant formulation and characterization testing.\n-  Completed military utility assessment and wargames.\n-  Began development of technology maturation plans and risk management plans (TMPs and RMPs).\n-  Began flight test and range safety planning, coordination, and documentation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "50.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform propulsion system risk reduction testing.\n-  Complete propulsion system Critical Design Review (CDR).\n-  Complete integrated weapon System Requirements Review (SRR).\n-  Develop integrated weapon system technology maturation plan and initial flight test plan.\n-  Complete Operational Fires integrated system trade studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct integrated weapon system risk reduction testing.\n-  Complete integrated weapon system Preliminary Design Review (PDR).\n-  Conduct full-scale propulsion system static hot-fire testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects completion of hot-fire\/static fire tests and the transition to weapon system integration planning and design."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hypersonic Air-breathing Weapon Concept (HAWC)"
                                    },
                                    "Description": {
                                        "val": "The Hypersonic Air-breathing Weapon Concept (HAWC) program is a Joint DARPA \/ Air Force effort that will develop and demonstrate technologies for an effective and affordable air-launched hypersonic cruise missile.  These technologies include advanced air vehicle configurations capable of efficient hypersonic flight, hydrocarbon scramjet-powered propulsion to enable sustained hypersonic cruise, thermal management approaches designed for high-temperature cruise, and affordable system designs and manufacturing approaches.  This is a joint program with the Air Force, and HAWC technologies are planned for transition to the Air Force after flight testing is complete."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.598"
                                            },
                                            "Text": {
                                                "val": "-  Continued software-in-the-loop testing for the demonstration vehicle.\n-  Continued hardware-in-the-loop testing for the demonstration vehicle.\n-  Completed full-scale thermal-structural testing.\n-  Continued flight test planning for the demonstration system.\n-  Began assembly, integration, and test of demonstration vehicle.\n-  Began range safety analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.900"
                                            },
                                            "Text": {
                                                "val": "-  Complete software-in-the-loop testing for the demonstration vehicle.\n-  Complete hardware-in-the-loop testing for the demonstration vehicle.\n-  Complete assembly, integration, and test of demonstration vehicle.\n-  Complete flight test planning for the demonstration system.\n-  Complete flight certification reviews with the test range.\n-  Complete range safety analysis.\n-  Conduct mission readiness review.\n-  Conduct first flight.\n-  Conduct interim flight test data analysis.\n-  Complete flight tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct final flight data review.\n-  Conduct final program reviews."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects completion of flight tests."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Aerospace System Concepts"
                                    },
                                    "Description": {
                                        "val": "Studies conducted under this program examine and evaluate emerging aerospace technologies and system concepts for applicability to military use.  This includes the degree and scope of potential impact and improvements to military operations, mission utility, and warfighter capability.  Studies are also conducted to analyze emerging aerospace threats along with possible methods and technologies to counter them.  The feasibility of achieving potential improvements, in terms of resources, schedule, and technological risk, is also evaluated.  The results from these studies are used, in part, to formulate future prototype development programs or refocus ongoing work.  Topics of consideration include: methods of defeating enemy anti-aircraft attacks; munition technologies to increase precision, range, endurance, and lethality of weapons for a variety of mission sets; novel launch systems; air vehicle control, power, propulsion, materials, and architectures; and payload and cargo handling systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Performed ground and flight experiments to characterize boundary layer transition physics.\n-  Initiated studies of novel concepts.\n-  Performed technology risk assessments to identify critical enabling technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct proof-of-concept demonstrations to verify technology feasibility.\n-  Perform initial development of novel aircraft and power plant configurations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct modeling of concept system designs.\n-  Perform sub-system viability experiments.\n-  Demonstrate enabling technologies that support sub-system components."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air-Ground Autonomous VEhicles (AGAVE)"
                                    },
                                    "Description": {
                                        "val": "The Air-Ground Autonomous VEhicles (AGAVE) program will explore the seams between air and ground vehicles.  New approaches are required to address one of the most symmetric of all warfighting domains - ground combat.  The program will seek to provide improved mobility solutions for supporting combat operations that place unmanned assets forward to explore and inform troops prior to entering an area, or to provide continued perimeter and overhead surveillance during operations.  Technologies will be explored to allow increased levels of autonomy, improved operating ranges, improved mobility through complex 3-dimensional battlespaces, and integration of the requirements for both ground and air mobility in complex urban warfare settings.  Reduced manning requirements will be a part of the design space evaluation, with unmanned vehicles operating in a supporting role instead of a traditional supported role.  Novel approaches to multi-modal platforms, platform states, and manned-unmanned teaming that reduce the need for highly trained personnel dedicated to monitoring unmanned vehicles will be explored.  Problems that cross all domains, such as high energy density power supplies, navigation through uncertain and changing environments, and supervisory autonomy of vehicles will be addressed.  Novel networking and teaming approaches to achieve tactical tasks will also be explored to close the seams between ground and air unmanned vehicles and to improve confidence in identifying risks associated with both natural hazards and enemy actions prior to ground personnel entering an area.  Cueing from other assets and long range, long duration autonomous assets will be included in the overall tradespace explored."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Refine design space and develop system requirements.\n-  Initiate studies in the areas of autonomy, mobility, and energy to define technology development areas.\n-  Begin development of concepts of operations and system architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.500"
                                            },
                                            "Text": {
                                                "val": "-  Define field experiment approaches, terrains, and candidate platform scale.\n-  Finalize concept of operation systems architecture."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects a shift from initial studies and designs to final concept of operations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LongShot"
                                    },
                                    "Description": {
                                        "val": "The goal of the LongShot program is to develop and flight demonstrate a weapon system using multi-mode propulsion that significantly increases engagement range and weapon effectiveness against adversary air threats.  LongShot will explore new engagement concepts for multi-modal, multi-kill systems that can engage more than one target.  LongShot can be deployed either externally from existing fighters or internally from existing bombers.  An air system using multi-modal propulsion could capitalize upon a slower speed, higher fuel-efficient air vehicle for ingress, while retaining highly energetic air-to-air missiles for endgame target engagements.  This approach provides several key benefits, which ultimately increase weapon effectiveness.  First, the weapon system will have a much-increased range over their legacy counterparts for transit to an engagement zone.  Second, launching air-to-air missiles closer to the adversary increases energy in terminal flight, reduces reaction time, and increases probability of kill.  The program will also evaluate other applications of multi-mode propulsion.  Potential transition partners include the Navy and Air Force."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate conceptual design of vehicle and begin operational analysis showing mission utility of performer design approaches.\n-  Conduct system requirements review of the demonstration system.\n-  Complete preliminary design of the demonstration system and conduct preliminary design review.\n-  Conduct risk reduction studies in support of design activity.\n-  Mature operational analysis showing mission utility of performer design approaches."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gunslinger"
                                    },
                                    "Description": {
                                        "val": "The Gunslinger program will develop and demonstrate technologies to enable an air-launched tactical range missile system capable of multi-mission support.  This system will utilize the high maneuverability of a missile system coupled with a gun system capable of scalable effects and engagement of multiple targets.  These mission sets addressed will include counter insurgency (COIN) operations, close air support (CAS) and air-to-air engagements.  The metrics associated with this system include total range (which includes transit to target, loiter and engagement) and weapon system effectiveness.  The program will address the system and technology issues required to enable development of a robust missile system considering (1) vehicle concepts possessing the required aerodynamic, propulsion, and payload capacity for a wide operational envelope, (2) the algorithms that support maneuvering and target recognition to enable expedited command decision making for selecting and engaging targets and (3) approaches to incorporating modularity of design to reduce cost throughout the design and development process.  The anticipated transition partners for this effort are the Air Force and the Navy."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.270"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.270"
                                            },
                                            "Text": {
                                                "val": "-  Conduct trade studies, to include propulsion, munitions, sensors, GPS and communications.\n-  Develop higher fidelity modeling and simulation environment to support program concept of operations.\n-  Conduct conceptual design sizing and synthesis activities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collaborative Operations in Denied Environment (CODE)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Collaborative Operations in Denied Environment (CODE) program was to enhance mission performance, reduce cost, confound adversaries, and reduce reliance on space assets for navigation and communication by distributing mission functions such as sensing, communication, precision navigation, kinetic, and non-kinetic effects to small platforms and increasing their level of autonomy.  Collaboration of multiple assets offered new possibilities to conduct military missions using smaller air platforms to enhance survivability, reduce overall acquisition cost, create new effects, increase communications range and robustness in denied environments, increase search area, increase areas held at risk, reduce target prosecution reaction time, and provide multi-mission capabilities by combinations of assets.  This effort focused on developing and demonstrating approaches that will expand the mission capabilities of legacy air assets through autonomy and collaborative behaviors, within a standard based open architecture.  CODE transitioned to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed integration of the full suite of CODE algorithms and Units of Portability (UoPs).\n-  Demonstrated the ability of a single commander to plan and execute a complex end-to-end scenario.\n-  Performed capstone demonstration involving six live and multiple virtual aircraft executing a complex end-to-end mission scenario with multiple contingency events and limited advanced knowledge of red team positions and tactics.\n-  Completed independent, fully-informed modeling, simulation, and analysis effort to validate final CODE software builds.\n-  Produced final CODE software package with complete software development kit and simulation environment to facilitate technology transfer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft and Vehicle IntegrAted Team (AVIATE)"
                                    },
                                    "Description": {
                                        "val": "The Aircraft and Vehicle IntegrAted Team (AVIATE) program studied the use of an Unmanned Aerial System (UAS) that is an integrated subsystem of a ground vehicle with features to autonomously land, attach, stow, detach, and take-off from its parent ground vehicle while it is on the move to enable on-demand capabilities and drastically improved protection.  Ground vehicles could perform traditional UAS missions such as intelligence, surveillance and reconnaissance (ISR) and fires support, as well as unique missions such as electronic attack, sensor emplacement, infrastructure attack, and active protection without having to rely on brigade and theater level assets.  This effort explored design interfaces between the air and ground vehicle, attributes to allow for launch and recovery on the move, and design considerations to enable operations in contested environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.875"
                                            },
                                            "Text": {
                                                "val": "-  Explored airframe design concepts of flight demonstration vehicle."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}