{
    "id": "2021-DefenseTechnicalInformationCenter-PB-0400-MJBOOK-0-0-0f5e21a673278222cc5fc703f9a033574c0d04162cf3e506ecc6116355de5c11-0",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DTIC-U_RDTE_MasterJustificationBook_Defense_Technical_Information_Center_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Technical_Information_Center_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Technical Information Center",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605801KA"
        },
        "ProgramElementTitle": {
            "val": "Defense Technical Information Center"
        },
        "R1LineNumber": {
            "val": "170"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Technical Information Center"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "262.894"
            },
            "PriorYear": {
                "val": "56.853"
            },
            "CurrentYear": {
                "val": "57.716"
            },
            "BudgetYearOne": {
                "val": "59.369"
            },
            "BudgetYearOneBase": {
                "val": "59.369"
            },
            "BudgetYearTwo": {
                "val": "61.308"
            },
            "BudgetYearThree": {
                "val": "62.408"
            },
            "BudgetYearFour": {
                "val": "64.328"
            },
            "BudgetYearFive": {
                "val": "65.691"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Technical Information Center’s (DTIC) unique mission is to aggregate and fuse science and technology data to provide rapid, accurate, and reliable knowledge to researchers and developers of the next generation of technologies needed to assure our national security.  DTIC, a DoD Field Activity under the authority, direction and control of the Under Secretary of Defense for Research and Engineering (USD(R&E)), is the DoD’s singular executive agent and designated source for DoD-funded scientific, technical, engineering, and industry-related information.  DTIC provides USD(R&E) the capability to develop and deliver new information products and tools to share knowledge and enhance decision making.\n\nThis Program Element (PE) provides for DTIC mission operations, which are focused on three core efforts:  Collection, Dissemination, and Information Analysis Centers (IACs): \n1)  Collect, curate, and preserve science and technical information resulting from DoD’s $14B annual investment.  Build upon past work to avoid costly and time-delaying rework. \n2)  Share and disseminate information as required by statute; provide access to more than 4.4 Million technical records.  Provide DoD users improved situational awareness.  Simplify and reduce expertise needed to discover the most relevant of information - provide role based content, research results, budget investment, where work is being done, by who, and what level of maturity.  \n3)  Operate the DoD Information Analysis Centers (IACs), centered on Defense Systems; Cyber Security and Information Systems; and Homeland Defense and Security.  The IACs provide the Department with an R&D contracting vehicle to support PEO and PM insertion of technical innovation into systems of record.\n\nOther priority DTIC mission activities are described below:\n1)  Foster collaboration across communities, researchers, warfighters, industry, academia, Federal agencies, and Allies.  Increase collaboration between S&T\/RDT&E and warfighters.\n2)  Ensure information protection, document marking, authenticate and validate users, enforce access controls.\n3)  Develop and manage DoD’s Science Technology Information Policy (STIP).\n4)  Agile software development, secure (cyber), and host applications supporting R&E initiatives and activities.\n5)  Maintain compliance with existing public law, regulations, and guidelines.\n6)  Implement congressionally-mandated programs, as directed within the FY 2019 National Defense Authorization Act (NDAA):\n- Innovators Information Repository (IIR):  increase awareness of Small Business Innovation Research (SBIR)\/ Small Business Technology Transfer (STTR) and other small business innovative technology capability and improve transition to systems of record.  DTIC is creating a database with reports, proposals, and vendor information.\n- Global Research Watch (GRW) Program:  provide decision quality analysis of open source information.  The Strategic Intelligence & Analysis Cell (SIAC) program is evaluating potential algorithms that will analyze journal literature and other open source information from both allies and competitors.  DTIC will manage and host in the cloud a tool based on promising algorithms.\n- Datasets and Data Repositories:  establish database of datasets created during research activities to support reuse; encourage data management planning with each research project.  DTIC is creating a dataset directory to direct users to organizations holding relevant datasets.\n\nIn support of these mission operations, DTIC purchases space and critical shared services (e.g., human resources (HR); financial management; contracting; common-use IT services and security; communications; and civilian payroll services) from expert and efficient DoD service-providers.\n\nDTIC MISSION RESULTS\n\nThe Department invests over $90 Billion annually in Research, Development, Test and Evaluation (RDT&E) needed to protect and defend our nation.  DTIC preserves the fruits of these costly labors for reuse across the enterprise.  As an efficient and cost-effective steward of technical information, DTIC collects data and provides answers to researchers seeking state-of-the-art data relevant to their projects.  Through this interchange of information, DTIC accelerates innovation and prevents duplication of experiments, tests, and prototyping activities because researchers can build on what has been done or choose other paths if prior research resulted in a dead end. Using DTIC-created forums, researchers, Warfighters, and industry partners can also rapidly collaborate and connect across the DoD research and engineering (R&E) enterprise.  Finally, DTIC provides a department-level map of R&D activity.  This map gives decision-makers insight into current and past research, highlighting where progress is being made and by whom.  Through the preservation and sharing of the results of billions of dollars of past DoD investments, DTIC increases the return on past investments and accelerates current efforts, saving the Department precious time and dollars.  Through its collaboration tools and outreach to the R&E community, DTIC connects researchers across the lab enterprise, to include researchers and engineers, Warfighters and DoD’s industry partners.\n\nDTIC's Information Analysis Centers (IACs) drive innovation and technological development by anticipating and responding to the information needs of the defense and broader community.  The IAC Program Management Office (IAC PMO) provides core funding, management and oversight of three IACs, which are chartered by DoD to collect, research, analyze, and disseminate scientific and technical information in specialized fields to DoD researchers and acquisition professionals.  In addition, the IAC PMO manages several multiple award contracts to make possible new research that builds on prior investments and incorporates the innovations of government, industry, and academia.  For the last several years, competition inherent in the IAC model has produced savings of 10-16% under projected costs, while still delivering vetted technical expertise to address DoD’s complex challenges.  Providing DoD labs and program managers access to thousands of industry subject matter experts, the IACs performed $2 Billion of customer-funded research and analysis in FY 2019.  The results of the work are a rich source of new material in DTIC's technical repositories and are available to users across the Department.  The IAC approach was identified as a \"best practice\" by the Director of Defense Pricing and Contracting and the then-Acting Assistant Secretary of Defense for Research and Engineering in a July 2018 memo wherein they recommended use of the IAC contracts across DoD as \"vehicles of first choice.\"\n\nNATIONAL DEFENSE STRATEGY\n\nThe DTIC and IAC mission operations described above are focused on actively supporting USD(R&E) efforts in generating decisive and sustained U.S. military advantages through the pursuit of three distinct lines of effort, as outlined in the 2018 National Defense Strategy (NDS):  \n\n1)  Rebuild military readiness as we build a more lethal Joint Force:  Develop and implement machine learning and semantic language algorithms to simplify discovery of relevant information – reduce search time and user expertise, provide tailored and actionable results, provide ability for S&T communities to collaborate with stakeholders and partners.\n2)  Strengthen alliances as we attract new partners:  Modernize user validation technology, implement White House directed Controlled Unclassified Information (CUI) markings while continuing to support legacy distribution code marking, support White House Open Science mandate and provide information to allies while preventing release of sensitive documents and data. \n3)  Reform the Department’s business practices for greater performance and affordability:  Increase ability and reduce time and cost to respond to current and future R&E support needs.  Migrate application hosting to the cloud; develop modular components; leverage Open Source, commercial, and Small Business Innovative Research (SBIR) technology; leverage the Information Analysis Center contracting model."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "56.853"
                },
                "CurrentYear": {
                    "val": "57.716"
                },
                "BudgetYearOne": {
                    "val": "59.778"
                },
                "BudgetYearOneBase": {
                    "val": "59.778"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "56.853"
                },
                "CurrentYear": {
                    "val": "57.716"
                },
                "BudgetYearOne": {
                    "val": "59.369"
                },
                "BudgetYearOneBase": {
                    "val": "59.369"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.409"
                },
                "BudgetYearOneBase": {
                    "val": "-0.409"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Changes"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.409"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.409"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Program Change:  The FY 2021 Base program reduction (-$0.409 Million), as compared to the Previous President’s Budget FY 2021 Base, reflects a net change resulting from the following adjustments:  \n\n1)\tA Defense-wide Review (DWR) program adjustment (decrease) of $0.100 Million to reduce cost and manage risk of DTIC Public Internet materials.\n2)\tA Defense-wide Review (DWR) program adjustment (decrease) of $0.446 Million as part of the Fourth Estate Network Optimization (4ENO) effort.  Funds are realigned to the Defense Information Systems Agency (DISA).\n3)\tMiscellaneous adjustments related to economic assumptions, inflation, and civilian payroll pricing.\n\nFY 2021 Service Requirements Review Board (SRRB) Reduction:  The FY 2021 Base program includes a $0.740 Million reduction in accordance with the Department’s recent service contract downsizing effort.\n\nThe FY 2021 Base program also includes a $0.032 Million reduction attributable to Fourth Estate Information Technology (4E IT) Reform savings."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "Defense Technical Information Center"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "233.523"
                        },
                        "PriorYear": {
                            "val": "51.837"
                        },
                        "CurrentYear": {
                            "val": "52.700"
                        },
                        "BudgetYearOne": {
                            "val": "54.353"
                        },
                        "BudgetYearOneBase": {
                            "val": "54.353"
                        },
                        "BudgetYearTwo": {
                            "val": "56.292"
                        },
                        "BudgetYearThree": {
                            "val": "57.392"
                        },
                        "BudgetYearFour": {
                            "val": "59.312"
                        },
                        "BudgetYearFive": {
                            "val": "60.675"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "DTIC is responsible for developing, coordinating and enabling a strong scientific and technical information (STINFO) program for the Office of the Under Secretary of Defense for Research and Engineering (OUSD(R&E)) and the DoD scientific and technical (S&T) enterprise.  In this role, DTIC sets policy for scientific and technical information (STI) exchanges for the research and engineering (R&E) community.  DTIC’s goal is to maximize the availability and use of technical information and products resulting from Defense-funded technical activities while ensuring restrictions to safeguard national security, export control, and intellectual property rights.  The Department conducts science and technology research via the following means:  60+ labs, Federally Funded Research and Development Centers (FFRDCs), DTIC’s Information Analysis Centers (IACs), and other contracts and grants.  DTIC’s information assets, tools and community interaction capabilities foster innovation, competition and identification of solutions in an access-controlled environment.\n\nWithin this budget project, DTIC’s organizational efforts are focused on the Collection and Dissemination core mission areas, along with the following critical activities:\n1) Search:  Develop new algorithms and tailored search mechanisms that enable our users to quickly discover useful information and to ensure we present the most relevant information.  Semantic (machine learning) mapping of information for comprehensive and precise data retrieval--built on DTIC’s custom thesaurus (for use by DoD and Allied partners).  Expand and enhance our data collections to improve the quality and completeness of the data. \n2) Collaboration:  Provide customized collaboration platforms and tools for the DoD science and technology community to work together on investments that efficiently deliver solutions to the Warfighter.\n3) Access Identity:  Strengthen methods of user authentication through the use of public key infrastructure (PKI) tokens, biometrics and other methods to grant access to recognized, trusted and authorized users.  Protect intellectual property (IP) and industry proprietary data assets entrusted to DTIC’s stewardship (protect information access).\n4) Data Fusion\/Analysis:  Gather information from multiple data sources and provide knowledge products that fuse the disparate data sets into a single view of the life cycle of research.  Present an overarching picture of research investment that enables decision-makers to link multiple efforts with integrated capabilities (employ resources to highest priority efforts and coordinate efforts across Services).  \n5) Cyber Security:  Continue to leverage state-of-the art technologies, processes and practices designed to protect DTIC networks, computers, programs and data from attack, damage or unauthorized access.\n6) Data Center Optimization\/Cloud:  Migrate services to cloud providers to improve availability, survivability, and mission flexibility; to reduce time to deliver new capabilities; to save costs; and to enhance cyber security.\n7) Mobile and Emerging Technology:  Ensure DTIC products, tools and interfaces are compatible with, and actively support customer\/user (DOD, industry partners, academic researchers) devices, operating systems, and browsers.  \n8) Controlled Unclassified Information (CUI):  An ongoing effort to standardize the way the Executive Branch handles unclassified information under a new document-marking framework. \n9) Public Access\/Open Science (for articles and digital data):  Acquire and disseminate DoD-funded, openly published journal articles, increasing access and encouraging innovation.  Develop a catalog of digital datasets supporting the conclusions of journal articles.\n10) FY 2019 NDAA Section 202 and Section 905 new mission activities:  Dataset management, the Global Research Watch (GRW) program, and Innovators Information Repository (IIR).  \n\nSUPPORTING USER COMMUNITIES\n\nDTIC supports user communities on the network where they work, i.e., NIPRNet, SIPRNet, and the public internet, and uniquely provides access controls within unclassified and classified material to protect intellectual property in our search, distribution, and collaboration tools.\n\n- DoD’s RDT&E Enterprise:  As a Field Activity to the Office of the Under Secretary of Defense for Research and Engineering (OUSD(R&E)), DTIC’s priority is the RDT&E enterprise, hosting information assets and tools on the NIPRNet, the primary network for the community.\n\n- Warfighter:  Improving coordination between the acquisition enterprise and warfighter communities, DTIC hosts a subset of information assets and tools on the SIPRNet.  DTIC is actively working to expand the availability of science and technology (S&T) information, to include Independent Research and Development (IR&D), on the SIPRNet.  DTIC continues its efforts to establish parity of information and capabilities on applications hosted on both NIPRNet and SIPRNet platforms.\n\n- Industry, Academia, and Citizen Science via Public Internet:  Engaging industry outside the NIPRNet firewall to support acquisition improvement initiatives and encourage the introduction of innovation, DTIC hosts unclassified public information and tools accessible to all users on the Internet.  DTIC provides public access to DoD-funded journal articles and research data, and increases outreach to industry through DTIC’s Defense Innovation Marketplace.\n\nSUMMARY\n\nDTIC provides interactive tools and advanced tailored search engines to leadership, scientists and engineers, PMs and PEOs, warfighters and budget analysts.  Furthermore, DTIC protects and preserves DoD’s multi-billion dollar investment in research, which empowers the acquisition enterprise through innovative tools, information systems, and decision support capabilities. The efficiency benefits can be enormous.  Each 1 percent increase in the reuse of S&T efforts produces over $100 Million in savings that can be redirected.  Those savings come from elimination of inefficient redundancy (and unnecessary delays), increased community interaction, and ultimately, a more capable military.  DTIC is uniquely positioned to support and to ensure the value of DoD’s R&D portfolio is fully realized."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Technical Information Center"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "51.837"
                                            },
                                            "Text": {
                                                "val": "The FY 2019 National Defense Authorization Act (NDAA) directs DTIC to implement the following programs on behalf of the Department:  Innovators Data Base, Global Research Watch Program, and Datasets and Data Repositories.\n-- Submit an action plan to OSD and the Congress in support of FY 2019 NDAA directives.\n-- Investigate and consider implementing technologies and tools; develop the necessary partnerships with the Services and DoD Agencies.\n- Deliver the next generation Search and Discovery capability, allowing customers to gain intricate knowledge of DTIC data and collections, the ability to use that data in a variety of ways, and to analyze that data through a single user-oriented solution.\n-- Collapse multiple user interfaces that are used to access the same data sets into a consolidated user interface that has multiple functionalities.\n-- Continue the effort to expose MarkLogic functionalities in this next generation Search and Discovery user interface.\n-- Enhance the user’s ability to package relevant information generated through search and discovery for their use in research papers, presentations, and analysis and decision tools.\n-- Continue to encourage DoD adaptation and use of persistent open source identifiers, such as Open Researcher and Contributor ID (ORCID), in order to build complete author profiles and establish links to the author’s technical documents contained within the collection.\n-- Improve relevance of user search and discovery results, including use of semantic technologies to pre-process metatag\/label\/categorize material and to expand user search terms at runtime in order to help users--who are not experts--locate information to answer questions.\n- Investigate innovative commercial technologies needed to field mobile capabilities in support of user devices (desktops, laptops, tablets, etc.), operating systems, and browsers.\n-- Enhance current products and services to incorporate mobile technologies, such as responsive designs and mobile application integration. \n- Continue to develop Access and Identity Management technologies to further protect DTIC data and enhance visibility of a user’s path through DTIC products and services.\n-- Initiate implementation of a commercial off-the-shelf access and identity management system that replaces the current DTIC Registration system on both NIPR and SIPR.\n- Enable the defense community to locate the most relevant technical information by leveraging the Master Data Repository (MDR) solution. \t\n-- Complete effort to surface richer metadata describing DTIC Technical Reports. \n-- Complete effort to feed richer metadata describing DTIC Technical Reports to public search sites. \n-- Initiate effort to surface richer metadata describing Information Analysis Center (IAC) Technical Reports.\n- Continue to broaden and expand DTIC collections to include material from the Department’s Rapid Fielding and Prototyping communities, which fall under the Research, Development, Test, and Evaluation (RDT&E) Budget Activity (BA) 4, Advanced Component Development and Prototypes (ACD&P).\n-- Continue to develop, build and foster collaboration, partnerships, and business relationships with leadership elements from within these communities.\n- Continue consolidation efforts\/plans for one primary interface with collection products\/tools on the Defense Logistics Agency (DLA) server; begin the integration of the Unified Research & Engineering Database (URED) into DTIC’s Enterprise Content Management System (ECMS).  DoD-funded research documents may be submitted for inclusion into DTIC using the ECMS, a secure online platform.\n-- Update Communities of Interest (COI) of both main and sub-area data fields within the (legacy) URED Input application (in case URED integration into ECMS is not completed in ample time, by the annual start of the URED Defense-wide Data Call’s official reporting period).\n- Continue supporting efforts to incorporate system enhancements on the DoD Grant Awards System in FY 2019 to reflect increased attention on grants data and possible changes to DoD requirements\/policies--as received by the Product Owner\/OUSD(R&E).\n- Expand usage of DTIC auto-indexing (MetaTagger) to other DoD components and Federal partners.\n- Collaborate with the DoD Intelligence community and other OSD representatives on policy and implementation of the new Controlled Unclassified Information (CUI) federal marking regulations, as DoD rewrites the guidance for marking DoD documents.\n-- Create requirements for changes to DTIC systems in support of the new CUI Framework.\n- Support DoD’s public access effort; conduct outreach and educate intramural and extramural researchers on the requirement to submit journal articles to DTIC.\n-- Establish a pilot project to accept submissions of data management plans (DMPs) for DoD-funded research programs.\n-- Initiate an independent study and develop a prototype to examine options for the management of digitally formatted scientific datasets for internal DoD use.\n-- Initiate development of a catalog\/locator of DoD-funded data sets using discovery and descriptive metadata.\n-- Integrate the search and display features of existing DTIC products with public access materials.\n-- Examine the feasibility of integrating other federal agency submission flows for publications, metadata and\/or data sets in order to reduce the burden of multi-funded researchers, and aid in compliance measures.\n-- Extend existing collaborations with other federal agencies to comply with public access requirements.\n- Expand customer outreach efforts to the R&E community.\n-- Build and foster relationships to further enable scientific collaboration by researchers, scientist, and engineers across the services. \n-- Further engage Communities of Interest (COIs), DoD Labs, Combatant Commands (CCMDs), and service schools for DTIC growth opportunities.\n-- Continue to reach out to industry partners in order to share both information and DoD customer requirements. \n-- Seek out new opportunities supporting collaboration.\n- Achieve and maintain SIPRNet parity in the DTIC Information Technology (IT) environment for core products.\n-- Complete implementation of technical processes that apply enhancements to NIPR and SIPR simultaneously.\n-- Ensure the DTIC Information Technology (IT) infrastructure and equipment can fully provide DTIC’s capabilities equally to users on SIPRNet and NIPRNet.\n- Establish baseline to develop a fully functional IT Continuity of Operations (COOP) capability for DTIC’s unclassified infrastructure.\n-- Achieve Full Operational Capability (FOC) for reliable data management to include data backup and restoral of DTIC information.\n-- Complete an approved and executable IT COOP plan; plan and design SIPRNet COOP infrastructure.\n-- Fully integrate efforts with concurrent Cloud services planning to provide required infrastructure to support and sustain the future COOP environment.\n-- Complete the design and implementation of the cyber security architecture; implement Risk Management Framework (RMF) continuous monitoring for full COOP capabilities.\n- Continue the migration of DTIC’s information systems and services to Cloud based infrastructure.\n-- Align with DoD cloud efforts; leverage enterprise-wide solutions, platforms, and contract vehicles.\n-- Complete the migration of DTIC’s public infrastructure to Cloud environments as planned, allowing DTIC staff to focus on more complex activities, and improving IT infrastructure availability.\n-- DTIC will have an approved Authority To Operate (ATO) with a continuously monitored Risk Management Framework (RMF) for its Cloud-based IT infrastructure, strengthening its Cyber security posture.\n-- Implement Cloud based identity management system enhancements and actionable user metrics.\n-- Complete the establishment of well-defined processes and procedures for operating in the Cloud environments.\n-- Establish DTIC contracts and service level agreements with selected Cloud Service Providers (CSP).\n- Continue to publish the R&E Journal at the CUI and Classified levels in order to share information throughout the R&E community.\n-- Expand marketing and awareness of the Journal; seek out a broader pool of article contributors and peer reviewers to highlight the work of DoD researchers.\n-- Publish supplemental and special edition issues.\n-- Initiate development of a Portfolio of DoD Journals on DTIC sites to enhance collaboration, synergy, and knowledge development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "52.700"
                                            },
                                            "Text": {
                                                "val": "- Implement improved search features for geolocation, visualization and graphing, and search of multimedia to give users and researchers the capability for broader discovery and ability to follow the research from funding to completion. \n- Improve search and discovery efficiency and accuracy through implementation of machine learning including tagging of all documents and search using semantic key word expansion, thus reducing user expertise needed to find the most relevant information.\n- Advance mobile capabilities; refine application development and delivery for the most dynamic services requiring frequent updates.  \n-- Field DTIC tools compatible with mobile platforms used by the customer base.\n-- Enhance security through continuous updates needed to maintain currency with mobile devices and technologies.\n- Deploy a Commercial-off-the-Shelf (CoTS) user Access and Identity Management tool, replacing a custom in-house application.\n-- Improve user access and cyber security; enable new identity mechanisms supporting mobile devices and emerging identity tokens.\n-- Improve the customer experience for access and registration through the implementation of self-service trouble shooting, Frequently Asked Questions (FAQs), and visual aids regarding the process of credentialing and seamless registration.\n- Continue maturation of DTIC’s Data Warehouse (i.e., the Master Data Repository, or MDR).\n-- Complete effort to surface richer metadata describing Information Analysis Center (IAC) Technical Reports (TRs).\n-- Establish links across data, enabling integrated displays of project, organization, topic, and user data.\n-- Integrate budget data into DTIC’s Data Warehouse to enable increased search capability.\n-- Evaluate out-of-the-box advanced security and compatibility with Controlled Unclassified Information (CUI) policies and off-the-shelf Access and Identity Management System.\n- Implement internal interfaces for the DTIC staff to test the system, manage content, and assist users.\n- Expand DTIC collections; develop requirements for a submission compliance tool to assist in ensuring all relevant information is being collected, and made available to the DoD community.\n-- Continue consolidation efforts\/plans for one primary interface with collection products\/tools on the Defense Logistics Agency (DLA) server--proceed with the integration of Unified Research & Engineering Database (URED) into DTIC’s common submission system (i.e., the Enterprise Content Management System, or ECMS).\n-- Continue supporting efforts to incorporate system enhancements on the DoD Grant Awards System to reflect increased attention on grants data and possible changes to DoD requirements\/policies, as received by the Product Owner\/USD(R&E).\n-- Research and provide recommendations on technologies as a means to maintain traceability of documents disseminated by DTIC (e.g., blockchain).  Provide the ability to trace what happened to the information once it leaves the DTIC network.\n-- Implement the capability to provide reference links within and across documents\/datasets\/metadata to allow users to view information in a more meaningful way.\n-- Implement a pilot to maintain document authenticity and integrity after dissemination beyond the DTIC environment.\n-- Implement and deploy Document Similarity capability to further combat Fraud, Waste and Abuse (FW&A); strengthen FW&A detection capabilities.\n- Collaborate with the DoD Intelligence community and other OSD representatives on policy and implementation of the new Controlled Unclassified Information (CUI) federal marking regulations, as DoD coordinates the guidance for marking DoD documents.\n-- Upon release of OSD guidance\/policies, initiate implementation of CUI changes to DTIC systems.\n- Support DoD’s public access effort; conduct outreach and educate intramural and extramural researchers on the requirement to submit journal articles, data management plans, and datasets to DTIC.\n-- Implement an automatic authentication method for contractors\/grantees journal article input.\n-- Begin to accept voluntary input of metadata pointing to datasets for internal DoD use.\n-- Create a Data Management Plan building tool for documentation of planning for storage and preservation of data sets throughout the research life cycle, to lessen the burden of compliance for intramural and extramural researchers, including the flexibility for different templates for different subject areas.\n- Expand R&E engagement and outreach to the Research and Engineering customer base. \n- Continue efforts to achieve SIPRNet parity for core products.\n- Implement failover capabilities of core applications for IT Continuity of Operations (COOP) support systems using common security, authentication, and identity management solutions.\n-- Fully implement COOP failover with cloud services as the primary, where appropriate.\n-- Explore dynamic failover capabilities, load balancing, and high availability models for COOP support.\n- Support DoD Cloud Computing Strategy by fostering adoption of Cloud Computing by completing migration of NIPRNet\/SIPRNet hosting environments.\n-- Optimize Data Center consolidation compliance by leveraging technologies within new Cloud Service Provider environments. \n-- Implement container images or similar technologies to further efficiencies deploying applications between development and staging environments.\n- The FY 2019 National Defense Authorization Act (NDAA) directs DTIC to implement the following programs on behalf of the Department:  Innovators Information Repository (IIR), Global Research Watch (GRW) Program, and Datasets and Data Repositories.\n- Deploy the Initial Operating Capability (IOC) for the Innovators Information Repository (IIR), which will include the following:\n-- Search and visualization of Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) contract awards allowing an IIR user to see responses to DoD needs.\n-- Capability to view all prior contract awards by year and see full company contact information with web address.\n-- Provide access to Company Commercialization Reports (CCRs) which present detail on actual matured products available for acquisition.\n-- Initiate the revision of DoD 3200.14 requiring the use of the IIR to determine whether technology exists or is in development before Department organizations initiate a Request for Information (RFI) or Request for Proposal (RFP).\n- Mature the Global Research Watch (GRW) Program.\n-- Add collections to the GRW tools on NIPR with data from the Small Business Innovation Research (SBIR) Office, Strategic Intelligence Analysis Cell (SIAC), AFWERX, and others.\n-- Explore partnering with SIAC to host commercial analytics and horizon scanning GRW tools at DTIC\/on DTIC cloud environment.\n-- Partner with SIAC to pilot the GRW tools for storing and serving large volumes of data to commercial analytics and horizon scanning tools.\n-- Enhance technology scouting\/trip reporting capability to include offline submission form that enables global technology scouts to complete reports in the field without a connection to a DoD network.\n-- Expand the search capabilities on data within the GRW tools. \n-- Continue partnership with the Office of Naval Research (ONR) to incorporate additional basic and applied research activities and capabilities of foreign nations, to include both allies and competitors, in areas of military interest.\n- Expand Datasets and Data Repositories; create a DoD Research Data Catalog, which is searchable as part of the R&E Gateway search.\n-- Develop requirements for a compliance tool for use in analyzing when a journal article or data set submission is expected, identifying potential gaps in what DTIC has received.\n-- Work with DoD Labs to point to the location their datasets are hosted.\n-- Link datasets to Technical Reports and Unified Research and Engineering Database (URED) projects to enable users to follow a research projects work in progress to the various results of the research.   \n-- Working within the Department’s direction, continue to mature selected implementing technologies and tools; continue to develop the necessary partnerships with the Services and DoD Agencies.\n- Continue to publish the Journal of DoD Research and Engineering (JDRE), which presents DoD’s best opportunity for the best scientists and researchers in the DoD to publish their work, in a protected environment, to the larger S&T community for the purpose of creating increased visibility, opportunity to be peer reviewed, opportunity to do peer reviewing. \n-- Continue to publish the JDRE at the CUI and Classified levels in order to share information throughout the R&E community.\n-- Support the Communities of Interest (CoIs) and increase visibility into the Department’s best research on Microelectronics, Advanced Electronics, Hypersonics, and Cyber with the publication of supplemental and special edition issues.\n- Implement the DISA-sponsored and managed Interactive Customer Evaluation (ICE) system for the DTIC Research and Reference the Access and Identity Management Customer Service Desks to gain specific customer feedback on DTIC products and services, which may be addressed immediately or translated to future requirements to improve overall value of DTIC services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "54.353"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "54.353"
                                            },
                                            "Text": {
                                                "val": "- Provide users with the ability to analyze search results using visual and graphical displays.  \n- Support mobile device access to DTIC products and services.\n- Utilize commercial tools to upgrade Access and Identity Management on the DTIC secret network (SIPRNet).\n-- Simplify user access, enhance cyber security, and support new ways for users to access securely.\n- Continue integration of the common submission system and the Data Warehouse to bypass and decommission legacy databases.\n-- Initiate development of an Application Programming Interface (API) for organizations to pull data from the Data Warehouse; explore federated searches to the warehouse.\n- Increase collection capacity by 25 percent, increasing the ability to add new technical reports into the DTIC Collection for use by DoD and partners.\n-- Automate standard data fields, saving user time with collection submissions, by incorporating a unique identifier for authors through the use of the ORCID tool.  This will result in a better search experience for DTIC customers.\n-- Incorporate unique identifiers for documents (DOI) with collection submissions to create a persistent link for consistency and increased accuracy in the search experience.\n- Collaborate with the DoD Intelligence community and other OSD representatives on policy and implementation of the new Controlled Unclassified Information (CUI) federal marking regulations, as DoD coordinates the guidance for marking DoD documents.\n-- Upon release of OSD guidance\/policies, initiate implementation of CUI changes to DTIC systems.\n- Support DoD’s public access effort; conduct outreach and educate intramural and extramural researchers on the requirement to submit journal articles, data management plans, and datasets to DTIC.\n-- Create a compliance tool for use in analyzing when a journal article or data set is expected, identifying potential gaps in what DTIC has received.\n-- Integrate the work flows between DTIC’s technical reports collection and PubDefense for public access materials, so each system feeds into the other.\n- Continue R&E engagement and outreach by meeting with DoD labs, conducting site visits to R&E organizations, and attending conferences to further extend the use of DTIC resources.\n- Deliver information on Warfighter networks to improve access and engagement with the R&E community.\n- Improve IT Continuity of Operations (COOP) capabilities to provide critical information to customers during a crisis.\n-- Implement dynamic failover capabilities for critical applications that demand high availability and performance.\n-- Develop operations framework to minimize workload for ad hoc implementation of essential services in COOP environments.\n- Migrate 90% of traditional data center computing\/storage capabilities with cloud services for more agile operations; complete IT modernization goal to migrate all mission applications within three years.\n- The National Defense Authorization Act (NDAA-19) Programs include:  Innovators Information Repository (IIR), Global Research Watch (GRW) Program, and Datasets and Data Repositories.\n- Expand the Innovators Information Repository (IIR).\n-- Explore, in partnership with Services and CCMDs, the development of a capability for companies, academia, and startups to submit portfolios of innovation activities and company information.\n-- Complete the revision of DoD 3200.14 requiring the use of the IIR to determine whether technology exists or is in development before Department organizations initiate a Request for Information (RFI) or Request for Proposal (RFP).\n-- Partner with Services and DoD Agencies to identify a strategy to address classification due to compilation of information.\n- Expand the Global Research Watch (GRW) Program.\n-- Explore language identification and translation capabilities of foreign research literature to facilitate the comparative analysis of foreign nations in relations to the research capabilities of the United States.\n-- Expand the GRW tools on the secret network.\n-- Partner with the Services, DoD Agencies, and Intelligence Communities to identify and incorporate Classified foreign research and technologies. \n- Expand the Department’s Datasets and Data Repositories.\n-- Migrate dataset input capability to DTIC enterprise input system to reduce software maintenance costs.\n-- Address datasets requiring applications for use.\n-- Work with basic research areas to help determine data exchange standards, dissemination protocols, inter-operability, reusability, and administration requirements. \n-- Continue partnering efforts with DoD Labs to point users to their dataset hosting location.\n-- Investigate automated processes to help evaluate the sensitivity of datasets, and apply appropriate security controls. \n- Continue to publish the Journal of DoD Research and Engineering (JDRE) two times each year, and seek opportunities for special editions.\n-- Manage peer reviewers from across entire R&E community; manage vetting of restricted and classified articles submitted from across the entire R&E community.\n- Implement customer satisfaction benchmarks based on results and feedback from the Interactive Customer Evaluation (ICE)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In the FY 2018 President’s Budget, the Department recapitalized DTIC across the FYDP.  The $1.653 Million increment in the current FY 2021 PB builds upon FY 2018-20 activities and progress towards meeting urgent operational mission requirements:\n\n- Improvements to DoD search tools.\n- Identity management and information protection.\n- Re-establishment of an IT COOP.\n- Parity of services on SIPRNet.\n- Migration to cloud services.\n- Support of Public Access\/citizen science.\n- Address technology shortfalls in user interface and the continuing migration of users to mobile devices.\n- The Department’s implementation of Controlled Unclassified Information (CUI) marking.\n- Implement, expand, and mature programs directed by the National Defense Authorization Act (NDAA-19), to include:  Innovators Information Repository (IRR), Global Research Watch (GRW) Program, and Datasets and Data Repositories.\n\nDTIC's investment in new tools and capabilities will address customer needs and underwrite the innovation necessary to support DoD’s enduring mission to provide combat-ready military forces to deter war and protect the security of our nation."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "002"
                    },
                    "ProjectTitle": {
                        "val": "Information Analysis Centers"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "29.371"
                        },
                        "PriorYear": {
                            "val": "5.016"
                        },
                        "CurrentYear": {
                            "val": "5.016"
                        },
                        "BudgetYearOne": {
                            "val": "5.016"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.016"
                        },
                        "BudgetYearTwo": {
                            "val": "5.016"
                        },
                        "BudgetYearThree": {
                            "val": "5.016"
                        },
                        "BudgetYearFour": {
                            "val": "5.016"
                        },
                        "BudgetYearFive": {
                            "val": "5.016"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "DoD Information Analysis Centers (IACs), established under DoD Instruction 3200.14, serve as a vital resource in providing timely, relevant information directly to users when and where it is needed.  IACs serve as a bridge between the warfighter and the Acquisition\/Research community, providing essential technical analysis and data support to a diverse customer base, to include the Combatant Commands (CCMDs), the Office of the Secretary of Defense, Defense Agencies, and the Military Services.  IACs actively partner and collaborate with Defense Research and Engineering (R&E) focus groups and communities of interest in areas of specialized fields or specific technologies.  The IACs create and maintain comprehensive knowledge analysis centers that include historical, technical, scientific, and other data and information collected worldwide. They are staffed with scientists, engineers and information specialists to provide research and analysis to customers with diverse, complex and challenging requirements.  IAC operations, in concert with 2018 National Defense Strategy objectives, directly support the warfighter, and play an ongoing and critical role in solving key CCMD operational issues such as cyber security, unmanned aerial vehicle visual\/audible signature reduction, and improvements to the ballistic resistance of body armor.\n\nThe IAC Program Management Office at DTIC performs contract acquisition, program management, and operational support for IAC contract operations and the technical information that is generated as a result of research and studies. In a time of shrinking budgets and increasing responsibility, IACs are a valuable resource for accessing scientific and technical information culled from efforts to solve new and historic challenges.  Direct IAC customer support activities, such as Task Order processing, Basic Center of Operations (BCO) support, Defense Finance and Accounting Service (DFAS) activities, contracting\/acquisition related activities, etc., are funded in part through partnerships with the Defense R&E community and the annual collection of customer reimbursements for their share of direct costs, in accordance with the IAC Reimbursable Review Board (IRRB) recommendations.  This represents the maximum cost-sharing with IAC customers allowable, per guidance from the OSD Office of General Counsel. Annual IAC efforts and accomplishments are dependent on the level of participation and collaboration by the R&E community at large."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Information Analysis Centers"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.016"
                                            },
                                            "Text": {
                                                "val": "- Support the DTIC mission to provide technical reports to DoD.\n- Provide administrative and operational oversight of basic core contract activities for DoD IACs to collect, analyze, synthesize and disseminate worldwide scientific and technical information (STI) in support of DoD's critical technologies and the warfighter.\n- Respond to technical inquiries (average 400 per month) and provide in-depth science and technology (S&T) analysis; create and provide STI results via IAC websites; capture STI products from new\/on-going analysis tasks; and support the exchange of information among members of the operational and technical communities.\n- Manage and support Technical Area Tasks (TATs) ordered by the DoD and non-DoD customers; provide program strategy and ensure alignment with Department goals\/direction.\n- Begin making new Task Order awards to the IAC MAC contract (awarded in September 2018) from Homeland Defense, Defense Systems, and Cyber Systems contacts; close these contracts to new awards while continuing work on existing Task Orders.\n- Award the Record Digitization small business contract ($4 Million) for the purpose of digitizing over 1 million hardcopy, microfiche, and microfilm technical documents for preservation and ease of discovery."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.016"
                                            },
                                            "Text": {
                                                "val": "- Collect and provide a minimum of 10,000 new technical reports to DTIC for DoD use.\n- Provide administrative and operational oversight of basic core contract activities for DoD IACs to collect, analyze, synthesize and disseminate worldwide scientific and technical information (STI) in support of DoD's critical technologies and the warfighter.\n- Answer approximately 3,600 technical inquiries with timely and in-depth science and technology (S&T) analysis; create and provide STI results via three IAC websites; capture STI products from new\/on-going analysis tasks; and support the exchange of information among members of the operational and technical communities.\n- Award, manage and support at least 50 new Task Orders requested by DoD customers; provide program strategy and ensure alignment with Department goals\/direction.\n- Assess first year of the new indefinite-delivery\/indefinite-quantity (IDIQ), the IAC multiple award contract (MAC), and its usage; adjust processes as necessary.\n- Provide acquisition services to new DoD customers, ensuring that new users exceed departing customers, and support research in new technologies as needed to align to USD(R&E) priorities.\n- Award a consolidated contract for the operation of the program’s three Basic Centers of Operation (Cyber, Defense systems, Homeland Defense), consolidating three current small business contracts into one at a value of $99 million."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.016"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.016"
                                            },
                                            "Text": {
                                                "val": "- Collect and provide a minimum of 12,000 new technical reports to DTIC for DoD use, increasing collection efforts over the previous year.\n- Answer approximately 3,600 technical inquiries with timely and in-depth science and technology (S&T) analysis; create and provide STI results via three IAC websites; capture STI products from new\/on-going analysis tasks; and support the exchange of information among members of the operational and technical communities.\n- Award, manage and support at least 50 new Technical Area Tasks (TATs) ordered by the DoD and non-DoD customers; provide program strategy and ensure alignment with Department goals\/direction.\n- Assess second year of the usage of the IDIQ, the IAC MAC; adjust processes as necessary.\n- Provide acquisition services to new DoD customers, ensuring that new users exceed departing customers, and support research in new technologies as needed to align to USD(R&E) priorities.\n- Increase the number of registered users of the IAC program by at least 1,500."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "- There is no change in the FY 2021 Base, as compared to the FY 2020 Base."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}