{
    "id": "2021-Navy-PB-1319-JBOOK-29075b3c2af92ab5fcca1096cf65ecac9cc771240d227e79d45bc59626cdea42-23",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603758N"
        },
        "ProgramElementTitle": {
            "val": "Navy Warfighting Exp & Demo"
        },
        "R1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "64.422"
            },
            "CurrentYear": {
                "val": "67.739"
            },
            "BudgetYearOne": {
                "val": "40.709"
            },
            "BudgetYearOneBase": {
                "val": "40.709"
            },
            "BudgetYearTwo": {
                "val": "41.302"
            },
            "BudgetYearThree": {
                "val": "57.585"
            },
            "BudgetYearFour": {
                "val": "57.697"
            },
            "BudgetYearFive": {
                "val": "58.851"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Office of Naval Research (ONR) guides ongoing research in the pursuit of innovative, decisive capabilities for our Sailors and Marines. ONR manages a broad, but priority-driven investment portfolio of near to long-term basic and applied research. This Program Element (PE) addresses the development of recent Science and Technology (S&T) breakthroughs to meet current operational needs from a subscale proof-of-principle into a full-scale prototype for warfighter experimentation during laboratory and operational demonstrations including Fleet Battle Problems (FBP), Limited Objective Experiments (LOEs) and Fleet\/Force exercises. The key aspects of this PE are divided into five areas supporting the continuum of S&T from discovery to delivery: (1) Naval Warfare Experimentation develops rapid prototypes and provides them to the warfighter for experimentation during operational demonstrations and exercises; (2) Operations Analysis provides the Navy and Marine Corps the means to identify capability needs that can be addressed with science and technology solutions and inform future investment; (3) SwampWorks develops and demonstrates newly invented or recently discovered technologies that address emergent and enduring operational problems in an accelerated timeframe; (4) TechSolutions develops rapid response science and technology prototypes addressing Fleet\/Force needs identified by Sailors and Marines at the deckplate level: and (5) support for the Naval Precision Strike Operations, providing the Navy capability to quickly locate, target, and strike critical targets.\n\nToday's Sailors and Marines are enabled by naval Science and Technology (S&T). Since 1946, the Office of Naval Research (ONR) has fostered scientific research related to the maintenance of maritime superiority and national defense.  ONR manages the Department of the Navy's (DON) portfolio of naval Basic and Applied research, and Advanced Technology Development investments to ensure naval forces can effectively deter conflict, but when called upon, fight, win and come home safe. Current investments hedge against uncertainty, providing solutions to commanders today, and options for the future. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy through research priorities set by the Chief of Naval Research, coordinated across the Naval Research Enterprise (NRE), and outlined in the Naval R&D Framework.\n\nThis Program Element (PE) funds Advanced Technology Development (ATD) that includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment. Efforts in this PE generally have Technology Readiness Levels TRL) of 4 (component and\/or breadboard validation in laboratory environment.), 5 (component and\/or breadboard validation in relevant environment.), or 6 (system\/subsystem model or prototype demonstration in a relevant environment).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "65.885"
                },
                "CurrentYear": {
                    "val": "67.739"
                },
                "BudgetYearOne": {
                    "val": "67.925"
                },
                "BudgetYearOneBase": {
                    "val": "67.925"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "64.422"
                },
                "CurrentYear": {
                    "val": "67.739"
                },
                "BudgetYearOne": {
                    "val": "40.709"
                },
                "BudgetYearOneBase": {
                    "val": "40.709"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.463"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-27.216"
                },
                "BudgetYearOneBase": {
                    "val": "-27.216"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.463"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-27.216"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-27.216"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:  The reduction in FY 2021 is due to the realignment of Advanced Technology Development efforts and the realignment of resources administered through ONR Global to higher priority Navy requirements. \n\nTechnical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2918"
                    },
                    "ProjectTitle": {
                        "val": "Navy Warfighting Experiments and Demo"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "64.422"
                        },
                        "CurrentYear": {
                            "val": "67.739"
                        },
                        "BudgetYearOne": {
                            "val": "40.709"
                        },
                        "BudgetYearOneBase": {
                            "val": "40.709"
                        },
                        "BudgetYearTwo": {
                            "val": "41.302"
                        },
                        "BudgetYearThree": {
                            "val": "57.585"
                        },
                        "BudgetYearFour": {
                            "val": "57.697"
                        },
                        "BudgetYearFive": {
                            "val": "58.851"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project focuses on the application of recent technology breakthroughs to meet current operational needs from a subscale proof-of-principle into a full-scale prototypes for warfighter experimentation during laboratory and operational demonstrations, Fleet Battle Problems (FBPs), Limited Objective Experiments (LOEs) and Fleet\/Force exercises."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Naval Warfare Experimentation"
                                    },
                                    "Description": {
                                        "val": "The objective of this activity is to capitalize on recent technology breakthroughs to develop and integrate components including subsystems into prototypes quickly. These technologies are provided to the warfighter for experimentation, field experiments, and\/or tests in simulated or actual environments. The use of Navy Warfare Development Command (NWDC) Fleet Experimentation (FLEX) events is encouraged. The net results are knowledge that only an experiment can provide and that will inform future Science and Technology (S&T) development and transition of capabilities.\n\nAn example of Naval Warfare Experimentation efforts is funding participation of the SeaHunter Medium Displacement Unmanned Surface Vessel (MDUSV) in a recent Pacific Fleet Battle Problem to determine its ability to conduct operations as part of a larger naval force transiting autonomously from California to Hawaii."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.145"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.608"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Expand operational experimentation efforts through the creation and maintenance of an Experimentation and Analysis Opportunities catalog for use by the Naval Research Enterprise (NRE) in order to develop a prioritized list of concept investigations that will result in operational experimentation in the form of tests, demonstrations, and large and small scale experimentation that will address emerging operational needs.  Early Technology Readiness Level concept investigations with Fleet and Force input will be conducted to establish concept potential, and inform NRE investment decisions.  Additionally, experimentation will be used as an excursion to address additional warfighter needs or mitigate capability delivery risk."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.518"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.518"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Maintain and leverage a Naval Research Enterprise (NRE) Experimentation and Analysis Opportunities catalogue to guide prioritized concept investigations in support of fleet\/force needs and strategic S&T initiatives. Invest in operational experimentation such as tests, demonstrations, and large and small scale experimentation that will address emerging operational needs.  Manage a NRE experimentation plan which will guide multi-year S&T experimentation efforts in response to emerging concepts and doctrine.  Conduct early Technology Readiness Level concept investigations with Fleet and Force input to establish concept potential, and inform NRE investment decisions. Leverage experimentation as an excursion to traditional programs to address additional warfighter needs and\/or mitigate capability delivery risk."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The reduction from FY 2020 to FY 2021 is due to the realignment of Advanced Technology Development efforts and the realignment of resources administered through ONR Global to higher priority Navy requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operations Analysis"
                                    },
                                    "Description": {
                                        "val": "The objective of this project is to provide operational analysis through studies, analyses, gaming, modeling and simulation (M&S), and experimentation to identify Navy and Marine Corps capability needs that can be addressed with S&T solutions.  The effort includes core analysis of Science and Technology (S&T) programs, military utility\/capability gaps analyses, war gaming, structured experimentation events, the articulation of the results of that analysis and war gaming, and the development of innovation strategies and messages resulting from these analyses.\n\nAn example of an Operations Analysis effort would be conducting an Artificial Intelligence Technology Innovation Game (TIG) with the Naval Warfare Development Command and representatives from the fleet, force, and NRE to determine where application of AI can have the most significant, near term impact on warfighting capability which allows the NRE to more accurately focus its S&T investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.167"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.204"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct warfighter workshops to discover new concepts and issues and identify new focus areas for S&T development guided by the warfighter.  Additionally, conduct Concept of Employment Development to explore existing or new S&T into training or exercises to improve effectiveness.  Also conduct Concept of Operations development to explore how operational objectives or capabilities can be met with existing or new S&T. Additionally, work with the Navy Warfare Development Command in order to conduct Technology Innovation Games that help inform Science and Technology program capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.804"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.804"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct warfighter workshops to discover and\/or refine new concepts and issues and identify new focus areas for Science and Technology (S&T) development guided by the warfighter.  Commission studies to investigate emerging areas for S&T investment and determine the naval specific challenges requiring NRE investment. Conduct Concept of Employment investigations to explore incorporating existing or new S&T into training or exercises to improve effectiveness. Conduct Concept of Operations investigations to explore how operational objectives or capabilities can be met with existing or new S&T. Work with the Navy Warfare Development Command in order to conduct Technology Innovation Games that help inform Science and Technology program capabilities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The reduction from FY 2020 to FY 2021 is due to the realignment of Advanced Technology Development efforts and the realignment of resources administered through ONR Global to higher priority Navy requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Swampworks"
                                    },
                                    "Description": {
                                        "val": "The SwampWorks portfolio explores high-risk, disruptive, and innovative technologies and concepts that advance naval warfighters capabilities. The program has substantial programmatic flexibility and is not limited to any set of technology areas.  Ultimately, the goal is to provide a dramatic improvement for the warfighter at a rapid pace.  Some of these technologies may become part of a follow-on technology development, may end up in the hands of the warfighter for Fleet\/ Force experimentation, or may culminate in a significant Fleet\/Force exercise that demonstrates capability that transitions into the Acquisition Program of Record (POR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.886"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.430"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The balance of the S&T projects that will start in FY20 will be identified during FY20 as the needs of the warfighters, for investments in this portfolio, evolve or change.  SwampWorks projects will be based on input from Naval Research Enterprise stakeholders (including the Naval enterprises, the combatant commands, OPNAV and Headquarters Marine Corps) and will be designed to exploit breakthroughs in science and technology in order to deliver maximum warfighting benefit to our sailors and marines.  SwampWorks projects will be aligned with shared priorities throughout the whole of RDT&E in order to quickly advance new capabilities from discovery to deployment across the warfighting domains."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.950"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.950"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Digital Twin for USS JOHN F. KENNEDY (CVN 79) Advanced Weapons Elevator. Continue development of Quantum Gravimeter Navigation System. The remaining Science and Technology (S&T) projects that start in FY21 will be identified during FY21 as emerging warfighters needs are realized. Swampworks projects will continue to be aligned with National Defense Strategy, OSD Modernization Priorities and CNO \/ CMC Guidance."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The reduction from FY 2020 to FY 2021 is due to the realignment of Advanced Technology Development efforts and the realignment of resources administered through ONR Global to higher priority Navy requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tech Solutions"
                                    },
                                    "Description": {
                                        "val": "TechSolutions develops rapid response Science and Technology (S&T) solutions to immediate Fleet\/Force needs identified by individual Sailors at the deckplate level and Marines in the field.  TechSolutions links warfighters to the government science and technology community to develop needed technologies as quickly as possible.  Sailors, Marines and Science Advisors submit their issues throughout the year via the TechSolutions web portal.  Projects are initiated directly from such requests and a prototype solution is developed collaboratively with the warfighter.  Within 12 months the prototype is delivered into the hands of the warfighter and demonstrated in an operationally relevant context.  \n\nHistorical examples of technology requests have included an enhancement to weapons training for security forces that was satisfied by development of an Augmented Reality headset and instrumented weapons, and a request for automated video recording of interactions at sea that was satisfied by the development of 360 degree visible and infrared cameras and DVR for quickly generating reports with video documentation to transmit up the chain of command."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.958"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.126"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This program will conduct new S&T developments based on Fleet\/Force interactions and expressed warfighter needs.  The program will be readily available to support the mission of the fleet by responding to Sailors\/Marines need for technology.  Developments will be undertaken to deliver rapid response solutions so warfighters can achieve mission success and perform their duties safer, more effectively and more efficiently by leveraging technology that has recently been developed or is emergent.  Demonstrations will be conducted with warfighters at the conclusion of developments to assess the utility of the technology and understand what steps remain to achieve transition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.064"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.064"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This program will conduct new Science and Technology (S&T) developments based on Fleet\/Force interactions and expressed warfighter needs.  The program will be readily available to support the mission of the fleet by responding to Sailors\/Marines need for technology. Developments will be undertaken to deliver rapid response solutions so warfighters can achieve mission success and perform their duties safer, more effectively and more efficiently by leveraging technology that has recently been developed or is emergent.  Demonstrations will be conducted with warfighters at the conclusion of developments to assess the utility of the technology and understand what steps remain to achieve transition."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The reduction from FY 2020 to FY 2021 is due to the realignment of Advanced Technology Development efforts and the realignment of resources administered through ONR Global to higher priority Navy requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precision Strike Technology"
                                    },
                                    "Description": {
                                        "val": "Efforts in this area support Naval Precision Strike Operations, providing the Navy capability to quickly locate, target, and strike critical targets. Ongoing efforts include conducting kill-chain studies to identify and recommend engineering trades to enable weapon system interoperability and data fusion alternatives. These studies assess engineering feasibility of various kill-chain options and assess the capability provided.  Classified addendum includes further program details."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.266"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.371"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Efforts in this area support Naval Precision Strike Operations, providing the Navy capability to quickly locate, target, and strike critical targets. Ongoing efforts include conducting kill-chain studies to identify and recommend engineering trades to enable weapon system interoperability and data fusion alternatives. These studies assess engineering feasibility of various kill-chain options and assess the capability provided."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.373"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.373"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Efforts in this area support Naval Precision Strike Operations, providing the Navy capability to quickly locate, target, and strike critical targets. Ongoing efforts include conducting kill-chain studies to identify and recommend engineering trades to enable weapon system interoperability and data fusion alternatives. These studies assess engineering feasibility of various kill-chain options and assess the capability provided."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2020 to FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        }
                    }
                }
            ]
        }
    }
}