{
    "id": "2021-Army-PB-2040-JBOOK-2ce7b76ca8f41dbc06183380f90728d4a8e40b9122c9effab5b4a02fdffb364e-14",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605716A"
        },
        "ProgramElementTitle": {
            "val": "Army Evaluation Center"
        },
        "R1LineNumber": {
            "val": "200"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "56.532"
            },
            "CurrentYear": {
                "val": "60.815"
            },
            "BudgetYearOne": {
                "val": "63.141"
            },
            "BudgetYearOneBase": {
                "val": "63.141"
            },
            "BudgetYearTwo": {
                "val": "65.217"
            },
            "BudgetYearThree": {
                "val": "61.392"
            },
            "BudgetYearFour": {
                "val": "64.966"
            },
            "BudgetYearFive": {
                "val": "66.221"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "438.284"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) provides the resources to operate the Army Evaluation Center (AEC), the Army's independent evaluator for Army Futures Command (AFC) Cross Functional Team (CFT) efforts and all other Army programs (currently over 700 programs in total).  AEC is the lead agent to plan, direct and evaluate all required program testing and is the unbiased, independent authority for reporting on system progress. AEC is the focal point in test strategy development, system safety verification, and data analyses from early developmental consumer tests through operational tests. AEC develops Critical Operational Issues and Criteria (COIC) in conjunction with AFC to narrow the focus of testing to what is essential.  AEC reviews system requirements to ensure they do not drive unnecessary testing.  AEC provides critical independent assessments on the effectiveness, suitability, and survivability to include cyber and electronic warfare; safety of materiel solutions; and viability of emerging technologies and engineering change proposals in order to support major acquisition\/fielding decisions including but not limited to acquisition milestones, materiel changes, and materiel release.\n\nAEC is responsible for all assigned developmental and independent operational evaluation of Army materiel, information and acquisition systems, an inherently governmental mission.  This core evaluation mission cannot be reimbursable. AEC must remain independent from the development community. AEC assists the Chief of Staff of the Army decision making process by supporting Army Requirements Oversight Council (AROC) processes as well as supporting the AFC through the CFT concept. AEC evaluates operational effectiveness by determining if the system provides intended benefits to the Force.  AEC determines impacts to readiness through Human Systems Integration (HSI), Unit Systems Integration (USI), and Army Systems Integration (ASI), as well as doctrine, organization, training, materiel, leadership and education, personnel, facilities and policy (DOTMLPF-P) impacts, AEC evaluates ballistics survivability and lethality, adversarial assessments\/threat computer network operations, cooperative vulnerability and penetration assessments (CVPA), and electronic warfare (EW) (attack, protection, and support) in support of the National Defense Authorization Act (NDAA) 2016 Section 1647, establishment of Cybersecurity and Electromagnetic Affects (CEMA).  AEC manages, plans, and executes Information Assurance (IA) operational assessments during annual Combatant Command and Army Service exercises in support of the congressionally mandated Office of the Secretary of Defense Director, Operational Test and Evaluation (OSD DOT&E) assessment, and performs the operational test agency (OTA) duties for the Ballistic Missile Defense System.\n\nThis PE funds direct civilian labor and minimum non-labor requirements to include: Temporary Duty (TDY), personnel training, career development, supplies and equipment, hardware, software, and other external Other Government Agency (OGA) support as well as methodology development required to evaluate emerging technologies and instrumentation requirements.\n\nAEC consists of seven directorates (Aviation-Fires Evaluation Directorate, Ballistic Missile Defense (BMD) Evaluation Directorate (funded by the Missile Defense Agency (MDA)), Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) Evaluation Directorate, Integrated Suitability & Methodology Directorate, Mounted Systems Evaluation Directorate, Soldier & Support System Evaluation Directorate and Survivability Evaluation Directorate) and a lean headquarters element as AEC receives staff services from the Army Test and Evaluation Command Headquarters (ATEC HQ). The AEC primary competencies are: identify what decision makers need to know; plan and direct test and evaluation strategies; evaluate operational effectiveness, suitability, survivability and safety; and provide senior leadership unbiased advice on Army programs."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "57.039"
                },
                "CurrentYear": {
                    "val": "60.815"
                },
                "BudgetYearOne": {
                    "val": "62.482"
                },
                "BudgetYearOneBase": {
                    "val": "62.482"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "56.532"
                },
                "CurrentYear": {
                    "val": "60.815"
                },
                "BudgetYearOne": {
                    "val": "63.141"
                },
                "BudgetYearOneBase": {
                    "val": "63.141"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.507"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0.659"
                },
                "BudgetYearOneBase": {
                    "val": "0.659"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.507"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.659"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.659"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "302"
                    },
                    "ProjectTitle": {
                        "val": "Army Evaluation Center"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "56.532"
                        },
                        "CurrentYear": {
                            "val": "60.815"
                        },
                        "BudgetYearOne": {
                            "val": "63.141"
                        },
                        "BudgetYearOneBase": {
                            "val": "63.141"
                        },
                        "BudgetYearTwo": {
                            "val": "65.217"
                        },
                        "BudgetYearThree": {
                            "val": "61.392"
                        },
                        "BudgetYearFour": {
                            "val": "64.966"
                        },
                        "BudgetYearFive": {
                            "val": "66.221"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "438.284"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides the resources to operate the Army Evaluation Center (AEC), the Army's independent evaluator for Army Futures Command (AFC) Cross Functional Team (CFT) efforts and all other Army programs (currently over 700 programs in total).  AEC is the lead agent to plan, direct, and evaluate all required program testing and is the unbiased and independent authority for reporting on system progress.  AEC is the focal point in test strategy development, system safety verification, and data analyses from early developmental consumer tests through operational tests.  AEC develops Critical Operational Issues and Criteria (COIC) in conjunction with AFC to narrow the focus of testing to what is essential.  AEC reviews system requirements to ensure they do not drive unnecessary testing.  AEC provides critical independent assessments on the effectiveness, suitability, and survivability to include cyber and electronic warfare; safety of materiel solutions; and viability of emerging technologies and engineering change proposals in order to support major acquisition\/fielding decisions including but not limited to acquisition milestones, materiel changes, and materiel releases.\n\nAEC is responsible for all assigned developmental and independent operational evaluation of Army materiel, information and acquisition systems, an inherently governmental mission. This core evaluation mission cannot be reimbursable. AEC must remain independent from the development community. AEC assists the Chief of Staff of the Army decision making process by supporting Army Requirements Oversight Council (AROC) processes as well as supporting the AFC through the CFT concept. AEC evaluates operational effectiveness by determining if the system provides intended benefits to the Force. AEC determines impacts to readiness through Human Systems Integration (HSI), Unit Systems Integration (USI), and Army Systems Integration (ASI), as well as doctrine, organization, training, materiel, leadership and education, personnel, facilities and policy (DOTMLPF-P) impacts, AEC evaluates ballistics survivability and lethality, adversarial assessments\/threat computer network operations, cooperative vulnerability and penetration assessments (CVPA), and electronic warfare (EW) (attack, protection, and support) in support of the National Defense Authorization Act (NDAA) 2016 Section 1647, establishment of Cybersecurity and Electromagnetic Affects (CEMA). AEC manages, plans,\nand executes Information Assurance (IA) operational assessments during annual Combatant Command and Army Service exercises in support of the congressionally mandated Office of the Secretary of Defense Director, Operational Test and Evaluation (OSD DOT&E) assessment, and performs the operational test agency (OTA) duties for the Ballistic Missile Defense System.\n\nThis PE funds direct civilian labor and minimum non-labor requirements to include: Temporary Duty (TDY), personnel training, career development, supplies and equipment, hardware, software, and other external Other Government Agency (OGA) support as well as methodology development required to evaluate emerging technologies and instrumentation requirements.\n\nAEC consists of seven directorates (Aviation-Fires Evaluation Directorate; BMD Evaluation Directorate (funded by the MDA); C4ISR Evaluation Directorate; Mounted Systems Evaluation Directorate; Readiness and Analytics Evaluation Directorate (RAED); Soldier Evaluation Directorate; and Survivability Evaluation Directorate) and a lean headquarters element as AEC receives staff services from the ATEC HQ.  The AEC primary competencies are:  Identify what decision makers need to know; plan and direct test and evaluation strategies; evaluate operational effectiveness, suitability, survivability and safety; and provide senior leadership unbiased advice on Army programs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AEC"
                                    },
                                    "Description": {
                                        "val": "AEC provides integrated technical and operational evaluations and continuous evaluation of assigned weapon systems and major automated information systems for major milestone decisions, materiel changes, and materiel releases in support of the Army Acquisition Executive and force development.  AEC develops the evaluation strategy, designs technical and operational tests, and evaluates the test results to address the combat effectiveness, suitability, survivability, and safety factors pertinent to the decision process for hundreds of systems\/programs across the Army, other Services, and Agencies.  AEC prepares integrated System Evaluation Plans and conducts integrated technical and operational evaluations for all assigned systems, assisting the Chief of Staff of the Army decision making process by supporting the AROC processes as well as provide support to the AFC through the CFT concept.  In support of Overseas Contingency Operations (OCO) and other real-world events, AEC continues to provide Capability & Limitation Reports and safety verification documents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "56.529"
                                            },
                                            "Text": {
                                                "val": "Covered operational costs for AEC including civilian pay and non-labor costs (approximately 94% of AEC's total budget is civilian labor). Assisted AFC in developing operational relevant, total system focused COIC that can be evaluated. Developed and applied new techniques in data mining, data visualization, and presentation of large data sets. Researched and developed evaluation metrics for new and emerging technologies such as artificial intelligence, signature management, hypersonics, directed energy, and human cognition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "60.439"
                                            },
                                            "Text": {
                                                "val": "Cover operational costs for AEC including civilian pay and non-labor costs (approximately 94% of AEC's total budget is civilian labor). Assist United States Army Training And Doctrine Command in developing operational relevant, total system focused critical operational issues and criteria that can be evaluated. Develop and apply new techniques in data mining, data visualization and presentation of large data sets. Continue research and develop evaluation metrics for new and emerging technologies such as signature management and human cognition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "63.141"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "63.141"
                                            },
                                            "Text": {
                                                "val": "Will continue to cover operational costs for AEC including civilian pay and non-labor costs (approximately 94% of AEC's total budget is civilian labor). Assist AFC in developing operationally relevant, total system focused COIC that can be evaluated.  Develop and apply new techniques in data mining, data visualization and presentation of large data sets.  Continue research and develop evaluation metrics for new and emerging technologies such as artificial intelligence, signature management, hypersonics, directed energy, and human cognition."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase funds civilian personnel to provide support for capabilities development process as well as CFT efforts to support the Army modernization strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA Section 825 Major Defense Acquisition Program (MDAP) Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA Section 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.003"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.376"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}