{
    "id": "2021-TheJointStaff-PB-0400-JBOOK-b056833476895c25f3d654254d7859ace944c4038bb330c82c22f01164508c70-0",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-TJS-U_RDTE_JustificationBook_The_Joint_Staff_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_The_Joint_Staff_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604826J"
        },
        "ProgramElementTitle": {
            "val": "Joint C5 Capability Development, Integration, and Interoperability Assessments"
        },
        "R1LineNumber": {
            "val": "107"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "68.968"
            },
            "PriorYear": {
                "val": "22.435"
            },
            "CurrentYear": {
                "val": "20.062"
            },
            "BudgetYearOne": {
                "val": "19.190"
            },
            "BudgetYearOneBase": {
                "val": "19.190"
            },
            "BudgetYearTwo": {
                "val": "19.445"
            },
            "BudgetYearThree": {
                "val": "20.988"
            },
            "BudgetYearFour": {
                "val": "20.740"
            },
            "BudgetYearFive": {
                "val": "20.771"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Lead command, control, communications, computers, and cyber (C5) assessments, analyses, capability development, and joint fires command and control (C2) interoperability efforts required to achieve an effective, integrated, and interoperable joint force.  Efforts include C5 requirements determination, C5 architectures development and integration, C5 data standardization, joint fires C2 interoperability, and C5 integration and interoperability assessments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.435"
                },
                "CurrentYear": {
                    "val": "20.062"
                },
                "BudgetYearOne": {
                    "val": "20.274"
                },
                "BudgetYearOneBase": {
                    "val": "20.274"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "22.435"
                },
                "CurrentYear": {
                    "val": "20.062"
                },
                "BudgetYearOne": {
                    "val": "19.190"
                },
                "BudgetYearOneBase": {
                    "val": "19.190"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.084"
                },
                "BudgetYearOneBase": {
                    "val": "-1.084"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Reductions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.084"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.084"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Changes from FY 2020 to FY 2021:\n(DWR) The FY 2021 funding request was reduced by $1,064K during the Secretary of Defense’s Defense-Wide Review (DWR) reform effort to account for change in requirements and contract savings resulting in less funds needed.  \nAdditional $20K reduction based on economic assumptions for non-pay, non-fuel purchase inflation."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "C5 Assessments and Analyses"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "35.980"
                        },
                        "PriorYear": {
                            "val": "11.648"
                        },
                        "CurrentYear": {
                            "val": "9.275"
                        },
                        "BudgetYearOne": {
                            "val": "9.303"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.303"
                        },
                        "BudgetYearTwo": {
                            "val": "9.292"
                        },
                        "BudgetYearThree": {
                            "val": "10.687"
                        },
                        "BudgetYearFour": {
                            "val": "10.462"
                        },
                        "BudgetYearFive": {
                            "val": "10.493"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Conduct analysis and assessment activities to inform and enhance joint warfighter capabilities in support of national security requirements. Provide timely, facts-based findings and recommendations to DoD decision-making processes that validate operational requirements and fund interoperable capabilities. Conduct interoperability assessments and analyses that evaluate capability and interoperability of fielded and emerging command, control, communications, computers, and cyber (C5), and systems in response to operational issues and shortfalls.  Conduct integration assessment efforts focused on emerging capabilities in wireless devices and security, operational and tactical command and control, networking, satellite communications, advanced secure digital datalinks, and allied\/coalition data exchanges."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C5 Assessments and Analyses"
                                    },
                                    "Description": {
                                        "val": "Support the Chairman’s statutory requirement to advise the Secretary of Defense on development of joint command, control, communications and cyber capability, including integration and interoperability of such capability through requirements, integrated architectures, data standards and assessments.  Also supports the Chairman's focus area of improving joint warfighting capability and the SECDEF's line of effort to strengthen alliances and attract new partners.  Interoperability is assessed and integrated solutions are developed to improve C5 system performance by providing recommendations based on operational architectures and evolving standards and data products.  Combatant Commands, Services, Agencies and Allies\/Coalition partners are provided a laboratory, exercise and assessment venue for the warfighter and capability developer to identify and solve interoperability, integration, and cyber issues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.648"
                                            },
                                            "Text": {
                                                "val": "Conduct analysis, assessment, and integration activities to inform and enhance Joint warfighter capabilities in support of national security requirements. Provide timely, facts-based findings and recommendations for action through formal DoD decision-making processes used to validate operational requirements and apply funding to field integrated, interoperable capabilities. Conduct interoperability assessments, analyses, and integration that evaluate and enhance capability and interoperability of fielded and emerging command, control, communications, computers, and cyber (C5), and systems in response to operational needs and issues.  Conduct integration and integration assessment efforts focused on emerging capabilities in wireless devices and security, tactical command and control and networking, satellite communications, advanced secure digital datalinks, and coalition data exchanges. Employ a deployable capability supporting the collection and analysis of decision quality data for command and control operations from the operational to lowest tactical echelons of command.  Joint analysis supports capability development, acquisition, and systems employment decisions based on quantifiable performance in both actual and replicated operational environments. Projects include:\n\nCoalition Interoperability and Assurance Validation (CIAV) – CIAV assessments of US and coalition systems support in-theater operations by ensuring C5 system adequacy before their operational employment in the Afghan and Iraq areas of operations.  CIAV is also increasing efforts in the Pacific.  CIAV assessments validate complete and timely exchange of critical information and improve interoperability, enabling coalition forces to fight more effectively and efficiently.\n\nClassified reconfigurable operational wireless network – the integration, employment, and assessment of a single, rapidly deployed and configurable wireless network that carries multiple classifications. Network is suitable for tactical field settings, temporary installations, and fixed headquarters thereby addressing tactical, operational, and strategic requirements. Employs National Security Agency approved communications security and provides secure communications faster with less hardware and overhead.\n \nJoint fires support joint mission thread interoperability assessment – assess joint and coalition fire support command and control systems digital (machine-to-machine) interoperability and provide findings and observations.\n\nAdvanced tactical cellular (4G\/LTE) integration – multiple efforts to increase the availability of 4G\/LTE to tactical forces.  Addresses communications security, smart-phone battlefield apps, and 4G\/LTE survivability in contested and austere environments. \n\nBold Quest (BQ) 2019 coalition interoperability demonstrations – support the design, plan, and execution of the BQ events which address close air support, counter UAS, IFF testing, and cyber effects on operations for U.S. forces and coalition partners.  Support includes accredited exercise networks, associated C2 systems, and data collection and analysis capabilities.\n \nJoint expeditionary integration capabilities – integrate, refine, and accelerate the migration of Special Operating Forces (SOF) battle-proven capabilities to general purpose forces in accordance with governing instructions. Rapid migration of SOF “best practices” provides greater capability to general purpose forces and enhances interoperability with SOF and coalition partners. The capabilities include integrated secure radio networks, tactical data links, tactical cellular, enroute satellite communications, enhanced situational awareness, fratricide prevention, and a more efficient kill-chain. \n\nBattlefield intelligence trusted network environment – the integration and assessment of an enterprise environment featuring a single, aggregated intelligence sharing capability for multiple partner nations that does not compromise respective national networks or domains.\n\nJoint Planning Services (JPS) – operational assessment of the JPS pilot will determine if the combatant commanders and Service operational planning requirements would be met by JPS.  JPS is intended to enable planners to develop and maintain complex strategic\/contingency plans in a dispersed, collaborative, cross-functional joint, interagency, intergovernmental, multinational environment.  JPS should also provide rapid access to authoritative, geospatially-enabled planning data and tools and efficient and expeditious information dissemination.\n\nMode 5 analysis – Plan and execute analysis events at various live venues (such as RED FLAG or BOLD QUEST) in support of certification of Service Mode 5 IFF capabilities.\n\nUSCENTCOM counter-UAS (C-UAS) support – Conduct analysis activities both at CONUS C-UAS events and in active operational theaters to evaluate effectiveness of rapidly fielded C-UAS systems. Results will inform follow-on fielding and rapid procurement decisions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.275"
                                            },
                                            "Text": {
                                                "val": "Conduct quantifiable analysis, assessment, and integration activities in both actual and replicated operational environments to inform and enhance C5I Joint warfighter capabilities in support of capability development, acquisition, and systems employment decisions. Conduct interoperability assessments, analyses, and integration through rapidly reconfigurable C5 laboratories replicating joint and coalition system of systems operational environments that can respond to emerging warfighter needs and issues. Employ a deployable assessment capability supporting the collection and analysis of decision quality data for command and control operations from the operational to lowest tactical echelons of command, in field conditions, in real time to provide immediate feedback on the data being collected. Projects include:\n\nCyber Guard (CG)\/Cyber Flag (CF) - Provide assessment and technical support to cyber exercises to include C2 information systems, while conducting assessments of cyber effects on systems integrated into the DoD Information Network.\n\nTrusted Network Environment - Support cross domain security solution that provides cross domain collaborative services (e-mail with attachments, chat, VoIP, and file share) between US SIPRNET, coalition bi-lateral and multilateral networks that does not compromise respective national networks or domains.\n\nCounter-UAS (CUAS) – Data collection and analysis during RTD&E test events as well as in support of urgent operational needs in active operational theaters. Analysis covers all aspects of CUAS defense, including lethal engagements. \n\nSmall Unit Situational Awareness – Support DARPA Squad-X and related efforts to enhance Joint\/Coalition small unit situational awareness and lethality with quantitative\/qualitative field assessments.  Efforts include assessments of GPS-denied navigation aids, unmanned systems performance, command of kinetic\/non-kinetic engagements, and employment of expert systems\/artificial intelligence systems at small unit level.\n\nBold Quest (BQ) 2020 Coalition Interoperability Demonstrations – Support the design, plan, and execution of the BQ events which address close air support, Mission Partner Environment (MPE) \/ Federated Mission Networking (FMN) development\/assessments, counter UAS, IFF testing, and cyber effects on operations for U.S. forces and coalition partners.  Support includes accredited exercise networks, associated C2 systems, and data collection and analysis capabilities. \n\t\nJoint Tactical Integration - Integrate, refine, and accelerate the migration of Special Operating Forces (SOF) battle-proven capabilities to rapidly improve the Joint warfighting capabilities and lethality of general purpose forces in accordance with governing instructions. Capabilities include integrated secure radio networks, tactical data links, tactical cellular, enroute satellite communications, enhanced situational awareness, fratricide prevention, and a more efficient kill-chain.\n\t\nCoalition Interoperability and Assurance Validation (CIAV) - Assess US and coalition systems support in-theater operations by ensuring C5 capabilities adequacy before current operational employment in the Afghan and Iraq areas of operations.  Conduct CIAV projects in the INDOPACOM AOR.  CIAV assessments improve interoperability and joint warfighting capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.303"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.303"
                                            },
                                            "Text": {
                                                "val": "Support National Military Strategy and Globally Integrated Operations (GIO) by conducting quantifiable analysis, assessment, and integration activities that inform and enhance Joint warfighter capabilities and interoperability.  Activities utilize actual and replicated operational environments and networks to conduct capability development, support joint and coalition experimentation, and support acquisition and systems employment decisions. Continue to address warfighter needs across all domains by conducting activities in rapidly reconfigurable C5ISR laboratories replicating joint and coalition system of systems operational environments as well as in operational venues such as exercises. Employ a deployable assessment capability supporting the collection and analysis of decision quality data for command and control operations from the operational to lowest tactical echelons of command, in field conditions, in real time to provide immediate feedback on the data being collected. Projects include:\n\nBold Quest (BQ) 2021 Coalition Interoperability Demonstrations – Support the design, plan, and execution of the BQ events which address close air support, Mission Partner Environment (MPE) \/ Federated Mission Networking (FMN) development\/assessments, counter Unmanned Aircraft Systems (UAS), Identification, Friend or Foe (IFF) testing, and cyber effects on operations for U.S. forces and coalition partners.  Support includes accredited exercise networks, associated C2 systems, and data collection and analysis capabilities. \n\t\nCyber Guard (CG)\/Cyber Flag (CF) - Provide assessment and technical support to cyber exercises to include C2 information systems, while conducting assessments of cyber effects on systems integrated into the DoD Information Network.\n\nCounter-UAS (CUAS) – Data collection and analysis during RTD&E test events as well as in support of urgent operational needs in active operational theaters. Analysis covers all aspects of CUAS defense, including lethal engagements. \n\nJoint Tactical Integration - Integrate, refine, and accelerate the migration of Special Operating Forces (SOF) battle-proven capabilities to rapidly improve the Joint warfighting capabilities and lethality of general purpose forces in accordance with governing instructions. Capabilities include integrated secure radio networks, tactical data links, tactical cellular, enroute satellite communications, enhanced situational awareness, fratricide prevention, and a more efficient kill-chain.\n\nCoalition Interoperability and Assurance Validation (CIAV) - Assess US and coalition systems support in-theater operations by ensuring C5 capabilities adequacy before current operational employment in the Afghan and Iraq areas of operations.  Conduct CIAV projects in the INDOPACOM area of responsibility.  \n\nJoint Network Integration Environment – Integrate advanced C5 technologies to improve the capabilities and resiliency of US Force Korea’s warfighting networks. Improve information sharing between U.S., Republic of Korea, and planned mission partner forces. \n\nJoint All-Domain Command and Control – Provide the joint hub for an integrated wide-area experimental network and conduct supporting interoperability assessments and integration activities. Contribute to wargames, exercises and experiments that explore current and future warfighting C2 concepts with coalition partners including Mission Partner Environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "(DWR) The FY 2021 funding request was reduced by $184K during the Secretary of Defense’s Defense-Wide Review (DWR) reform effort to account for change in requirements and contract savings resulting in less funds needed."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Biannual review of C4\/Cyber resources includes an examination of the current and future Budget\/Spend Plan, Lines of Effort, Acquisition Strategy and current Execution.\n\nThe award of a Multi Award Contract (MAC) seeks efficiencies in the performance of requirements for C4\/Cyber and Information services, and promotes contractor teaming to provide critical technical and management support.  The MAC approach also seeks to reduce the costs of current contract support through the elimination of multiple fees for service contracts, and through the competitive award of contract services."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Management and Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk, Suffolk, Eglin"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "35.980"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "11.648"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.275"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.303"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.303"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Joint C5I"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "C5 Assessments and Analyses"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "002"
                    },
                    "ProjectTitle": {
                        "val": "C5 Capability Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "20.263"
                        },
                        "PriorYear": {
                            "val": "5.787"
                        },
                        "CurrentYear": {
                            "val": "5.787"
                        },
                        "BudgetYearOne": {
                            "val": "5.119"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.119"
                        },
                        "BudgetYearTwo": {
                            "val": "5.342"
                        },
                        "BudgetYearThree": {
                            "val": "5.340"
                        },
                        "BudgetYearFour": {
                            "val": "5.341"
                        },
                        "BudgetYearFive": {
                            "val": "5.341"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "C5 capability development functions as the DoD requirements lead for the joint command and control family of programs, Joint cyber, and requirements lead for mission partner environment (MPE). The program also develops joint C4 architectures, joint common systems functions, joint mission threads, leads analysis and reviews architectures and standards in joint capability development systems. C5 development enables warfighter access to authoritative data sources and improves data interoperability by establishing common C2 data and service standards."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C5 Capability Development"
                                    },
                                    "Description": {
                                        "val": "Lead C2 capability development and integration in order to achieve an interdependent joint force. Supports Chairman's focus to improve joint warfighter capability and enhance global integration. This will be accomplished through four focus areas: capability development, C4 architectures, data and services, and interoperability and integration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.787"
                                            },
                                            "Text": {
                                                "val": "Capability Development – analyze and coordinate the Department’s FY 2021-2025 C2 integrated priority lists and capability gap assessment for JROC approval. Develop and coordinate annual Joint C2 FY 2020 and FY 2021 operational priorities for JROC approval. Facilitate Nuclear C3 requirements through the JROC process for C4\/Cyber-aligned capabilities.  Enhance C2 requirements creation, validation, and management through the Net-enabled Requirements Identification Database (NRID) and Decision Support Tool (DST) suite, and development and management of aligned JCIDS capability development documents. Provide requirements management and operational focus to test and field the Global Command and Control System-Joint (GCCS-J) version 6.0 and begin development of its follow-on GCCS-J Enterprise (GCCS-JE) cloud-accessible solution utilizing Agile\/DevOps acquisition methodologies.  Ensure warfighter demands for a functional denied-disconnected, intermittent, low-bandwidth capability at the Combined\/Joint Task Force-level are adequately understood and addressed by the capability developer.  Ensure capability needs are addressed for 1) Command and Control of the Information Environment (C2IE) transition and enhancement, 2) Joint Force Capability Catalog\/Global Laydown Server (JFCC\/GLS)\/ORION development and sustainment, and 3) Joint Planning Services (JPS) materiel development and transition.\n\nC4 Architectures - provide architecture and joint mission thread development and analysis efforts as required to support the Chairman's directed focus areas and Chief Information Officer (CIO) lines of operations. Provide architectures and analytical support as required to the Chairman's Joint Military Net Assessment. Conduct analysis and validate architectures and engineering designs for continued implementation of the Joint Information Environment (JIE). Update the warfighter mission area (WMA) architecture development standards to improve WMA architecture portal usability. Continue to improve the quality of and expand the amount of the C4\/Cyber portfolio architecture information available on the WMA architecture portal. Conduct analyses and develop architectures and metrics for JCIDS capability requirement documents.\n\nData and Services – develop, promote, and integrate warfighter data and services requirements, standards, technical specifications, and policy to improve warfighter interoperability and information sharing with joint, mission partners, and other U.S. government departments and agencies. Perform and lead proof of concept activities of the North Atlantic Treaty Organization (NATO) core data framework and the National Information Exchange Model (NIEM) with selected communities of interest, such as robotics and autonomous systems, to achieve coalition interoperability and demonstrate operational effectiveness for the Mission Partner Environment and for the Federated Mission Networking domain. Continue to align and standardize emerging tactical data link, symbology (including cyber symbology) and messaging standards with enterprise information sharing. Support and guide the maturation of and implementation of NIEM in the interagency, joint and coalition domains as the common enterprise level interoperability information exchange standard for new and updated IT services. \n\nIntegration and interoperability – lead mission partner environment (MPE) implementation and support cyber priorities across DoD by performing analysis, conducting assessments and supporting materiel developers. Review and monitor the continued development of the MPE information system to ensure it meets the operational requirements of the Combatant Commands and Services and complements the greater MPE initiative. Continue to shape NATO future mission networking implementation to ensure it remains aligned with MPE, including related capability development. Support development and maturation of DOD enterprise cyber-range environment command and control information system to support US and coalition cyber force readiness, cyber defense of coalition networks, integration, interoperability, and defensibility of mission partner environment federated networks. Coordinate and lead non-overseas contingency operations-funded coalition interoperability events across the geographic Combatant Commands."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.787"
                                            },
                                            "Text": {
                                                "val": "Capability Development – Analyze and coordinate the Department’s FY 2022-2026 C2 integrated priority lists and capability gap assessment for JROC approval. Develop and coordinate annual Joint C2 FY 2021 and FY 2022 operational priorities for JROC approval. Enhance C2 requirements validation and management through the Net-enabled Requirements Identification Database (NRID) and Decision Support Tool (DST) suite, and development and management of aligned JCIDS capability development documents. Provide requirements management and operational focus to develop and field the Global Command and Control System-Joint Enterprise (GCCS-JE) cloud-accessible solution utilizing Agile\/DevOps acquisition methodologies.  Additionally, participate in quarterly Program Increment planning session for Agile\/DevOps development of GCCS-JE.  Ensure warfighter demands for a functional denied-disconnected, intermittent, low-bandwidth capability at the Combined\/Joint Task Force-level are adequately understood and addressed by the capability developer.  Ensure joint capability needs are addressed for:\n\n(1) Nuclear C3 requirements for C4\/Cyber-aligned capabilities\n\n(2) Command and Control of the Information Environment (C2IE) \n\n(3) Joint Force Capability Catalog\/Global Laydown Server (JFCC\/GLS)\/ORION\n\n(4) Joint Planning Services (JPS) modernization and sustainment\n\n(5) Multi-domain Battle C2 initial prototype capability development. Integrate missile warning enhancements identified in VCJCS Competitive Area Study into GCCS-J. Collaborate with J2 and OSD(I) to identify\/prioritize Intelligence Support to C2 requirements for materiel solution development.\n\nC4 Architectures - Provide architecture and joint mission thread development and analysis products as required to support the Chairman's directed focus areas and Chief Information Officer (CIO) lines of operations (e.g. operational context for Artificial Intelligence). Provide architecture and analysis as required in support of Chairman's Priorities (e.g. Joint Military Net Assessment, Coalition Interoperability). Conduct analysis and validate architectures and engineering designs for continued implementation of the Joint Information Environment (JIE). Update the Joint Common Service\/System Function List and Warfighter Mission Area (WMA) architecture development standards to improve WMA architecture integration and interoperability. Continue to improve the quality of and expand the amount of the FCB portfolio architectures available on the WMA architecture portal. Conduct analyses and develop architectures and metrics for JCIDS capability requirement documents.\n\nData and Services – Develop, promote, and integrate warfighter data and services requirements, standards, technical specifications, and policy to improve warfighter interoperability and information sharing with joint, mission partners, and other U.S. government departments and agencies. Perform and lead proof of concept activities of the North Atlantic Treaty Organization (NATO) core data framework and the National Information Exchange Model (NIEM) with selected communities of interest, such as robotics and autonomous systems, to achieve coalition interoperability and demonstrate operational effectiveness for the Mission Partner Environment and for the Federated Mission Networking domain including one complex demonstration with NATO and one Service partners. Continue to lead, align and standardize emerging tactical data link, symbology (including cyber symbology) and messaging standards with enterprise information sharing. Support and guide the maturation of and implementation of NIEM in the interagency, joint and coalition domains as the common enterprise level interoperability information exchange standard for new and updated IT services. Support standardization of common warfighter Identity Access Management, robust cyber security, standardized interfaces and common data tagging to promote warfighter interoperability. Support joint command and control governance and requirements documents development (Information Support Plan) to ensure data and service equities are properly represented on behalf of the warfighter.\n\nInteroperability and Integration - Lead mission partner environment (MPE) implementation and support coalition cyber priorities across DoD by performing analysis, conducting assessments and supporting materiel developers.  Review and monitor the continued development of the MPE information system to ensure it meets the operational requirements of the Combatant Commands and Services and complements the greater MPE initiative. Continue to shape North Atlantic Treaty Organization (NATO) federated mission networking (FMN) implementation to ensure it remains aligned with MPE, including related capability development. Participate in the Combined Communications-Electronics Board to ensure interoperability among the Five Eyes nations (Canada, New Zealand, Australia, UK and U.S.).  Coordinate and lead Coalition Interoperability Assurance and Validation (CIAV) interoperability mission-based assessments across the geographic Combatant Commands.  Lead the NATO-sponsored Coalition Warrior Interoperability Exploration, Experimentation, Examination, Exercise’s FMN Focus Area to ensure standardized, effective development of Joining, Membership, and Exit Instructions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.119"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.119"
                                            },
                                            "Text": {
                                                "val": "Capability Development - Analyze\/coordinate out-year C2 integrated priority lists, capability gaps, and Joint C2 operational priorities. Create C2 requirements in concert with DoD's Digital Modernization Strategy. Specifically, address GCCS-J replacement by GCCS-JE to include robust functionality during disconnected operations. Pursue joint capability development\/integration for Joint All Domain C2 (JADC2), C2IE, JFCC\/GLS\/ORION, JPS, Personnel Recovery and Missile Warning IAW SECDEF direction.\n\nC5 Architectures - Provide architecture, mission thread, and mission-based analysis development and analysis products as required to support the Chairman's directed focus areas and Chief Information Officer (CIO) lines of operations. Conduct analysis and validate warfighting requirements architectures and engineering designs for continued implementation of the Joint Information Environment (JIE). Update the Joint Common Service\/System Function List and Warfighter Mission Area (WMA) Architecture Development Standard to improve WMA architecture integration and interoperability. Continue to improve and expand the quality and amount of architecture information and data available for analysis and reuse on the WMA architecture portal. Conduct analyses and develop architectures and metrics for JCIDS C5 capability requirement documents. \n\nData and Services – Develop, promote, and integrate common enterprise data and services requirements, standards, technical specifications, and policy to improve Joint All Domain C2 interoperability and information sharing with Joint, interagency and coalition mission partners. Perform and lead proof of concept activities, including cloud-based data lakes that enables Artificial Intelligence and cybersecurity standardization of the National Information Exchange Model (NIEM) and the North Atlantic Treaty Organization (NATO) Core Data Framework (NCDF) with selected Joint All Domain C2 communities of interest, including robotics and autonomous systems. Conduct one Joint All Domain C2 complex proof of concept demonstration with NATO with interested Services, Agencies and coalition partners to improve warfighter interoperability and enhance operational effectiveness. Continue to lead, align and standardize emerging Joint All Domain C2 tactical data link, symbology (including cyber symbology) and messaging standards to support common enterprise-level information sharing. Continue to support standardization of common warfighter Identity Access Management, robust cyber security, standardized interfaces and common data tagging to promote Joint All Domain C2 interoperability. \n\nCoalition Interoperability - International lead for the Coalition Interoperability Assurance and Validation (CIAV) providing interoperability mission-based assessments across the geographic Combatant Commands.  Continue to lead mission partner environment (MPE) implementation and support coalition cyber priorities across DoD by leading the MPE cyber security efforts and supporting the federated mission networking (FMN) cyber security working group.  Continue to shape North Atlantic Treaty Organization (NATO) federated mission networking (FMN) implementation to ensure it remains aligned with MPE, including related capability development. Provide support to the Combined Communications-Electronics Board to ensure interoperability among the Five Eyes nations (Canada, New Zealand, Australia, UK and U.S.).  Lead the NATO-sponsored Coalition Warrior Interoperability Exploration, Experimentation, Examination, Exercises (CWIX) FMN Focus Area to ensure standardized, effective development of Joining, Membership, and Exit Instructions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "(DWR) The FY 2021 funding request was reduced by $648K during the Secretary of Defense’s Defense-Wide Review (DWR) reform effort to account for change in requirements and contract savings resulting in less funds needed.\nAdditional $20K decrease due to revised economic assumptions."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Biannual review of C4\/Cyber resources includes an examination of the current and future Budget\/Spend Plan, Lines of Effort, and Acquisition Strategy.\n\nThe award of a Multi Award Contract (MAC) seeks efficiencies in the performance of requirements for C4\/Cyber and Information services, and promotes contractor teaming to provide critical technical and management support.  The MAC approach also seeks to reduce the costs of current contract support through the elimination of multiple fees for service contracts, and through the competitive award of contract services."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Managemnt and Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk, Suffolk"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "20.263"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.787"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.787"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.119"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.119"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "C5 Capability Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "C5 Capability Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "003"
                    },
                    "ProjectTitle": {
                        "val": "Joint Fires C2 Interoperability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "12.725"
                        },
                        "PriorYear": {
                            "val": "5.000"
                        },
                        "CurrentYear": {
                            "val": "5.000"
                        },
                        "BudgetYearOne": {
                            "val": "4.768"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.768"
                        },
                        "BudgetYearTwo": {
                            "val": "4.811"
                        },
                        "BudgetYearThree": {
                            "val": "4.961"
                        },
                        "BudgetYearFour": {
                            "val": "4.937"
                        },
                        "BudgetYearFive": {
                            "val": "4.937"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Lead interoperability efforts across DoD and partner nations at the operational and tactical level for mission partner operations, fire support, combat identification (CID), and friendly force tracking (FFT) capabilities. Conduct joint fire support, joint close air support and CID-FFT action plans to fulfill CJCS-directed, General Officer\/Flag Officer (GOFO) level responsibilities. Conduct Joint Fire Support Executive Steering Committee (JFS ESC) standardization team accreditation visits to U.S. and partner nation schoolhouses to ensure memorandum of agreement signatories are accomplishing schoolhouse training in compliance with the memoranda."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Fires C2 Interoperability"
                                    },
                                    "Description": {
                                        "val": "These efforts directly support Chairman, Joint Chiefs of Staff (CJCS) guidance to increase interoperability with allies and partners, to more effectively counter trans-regional threats.  Supports Chairman's focus area of improving joint warfighting capability and the SECDEF's line of effort to strengthen alliances and attract new partners.  Execute Joint Staff-sponsored Bold Quest systems-of-systems interoperability assessment, including integration of cyber capabilities with command and control of conventional and Special Operations Force missions from a multinational perspective at the tactical level. Lead the Joint Fire Support Executive Steering Committee (JFS ESC), composed of Flag\/General Officer representatives and supporting staffs from the U.S. Services, Special Operations Command and 21 partner nations. Those nations include NATO nations, Australia, Republic of Korea and key Gulf State allies. Also lead the Combat Identification – Friendly Force Tracking Executive Steering Committee (CID-FFT ESC), focused on more effective and efficient combat operations and reduced potential for friendly fire incidents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Plan and execute Joint Staff-sponsored Bold Quest 2019 capability demonstration and assessment, focused on interoperability for joint and coalition fires. Bold Quest data and assessments inform US and Partner Nation investment in multiple capability areas: combat identification, friendly force tracking, digitally aided close air support and fires, integrated air and missile defense, coalition intelligence surveillance and reconnaissance, and cyber.  These efforts directly support the National Military Strategy, the CJCS’ global integration objectives and the Combatant Commanders conventional and SOF international engagement programs. Continue leading accreditation visits of current JFS ESC member programs and provided staff assistance for development of close air support-related training and certification programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Plan and execute Joint Staff-sponsored Bold Quest 2020 capability demonstration and assessment, focused on interoperability for joint and coalition fires. Bold Quest data and assessments inform U.S. and Partner Nation investment in multiple capability areas: combat identification, friendly force tracking, digitally aided close air support and fires, integrated air and missile defense (Mode 5 Identify Friend or Foe), coalition intelligence surveillance and reconnaissance, integrated interoperable simulations, and cyber.  These efforts directly support the National Military Strategy, the CJCS’ global integration objectives and the Combatant Commanders conventional and SOF international engagement programs. Continue leading accreditation visits of current JFS ESC member programs and provide staff assistance visits for development of close air support-related training and certification programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.768"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.768"
                                            },
                                            "Text": {
                                                "val": "Plan and execute Joint Staff-sponsored Bold Quest 2021 capability demonstration and assessment, focused on interoperability for joint and coalition fires underpinned by Mission Partner Environment (MPE) concepts. Bold Quest data and assessments inform U.S. and Partner Nation investment in multiple capability areas: combat identification, friendly force tracking, digitally aided close air support and fires, integrated air and missile defense (Mode 5 Identify Friend or Foe), coalition intelligence surveillance and reconnaissance, integrated interoperable simulations, and cyber.  These efforts directly support the National Military Strategy, the CJCS’ global integration objectives and the Combatant Commanders conventional and SOF international engagement programs. Continue leading accreditation visits of current JFS ESC member programs and provide staff assistance visits for development of close air support-related training and certification programs. Continue leading the CID-FFT ESC and JFS ESC in order to address capability shortfalls\/gaps, analyze and recommend integrated joint and coalition solutions to warfighter issues."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "(DWR) The FY 2021 funding request was reduced by $232K during the Secretary of Defense’s Defense-Wide Review (DWR) reform effort to account for change in requirements and contract savings resulting in less funds needed."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Biannual review of C4\/Cyber resources includes an examination of the current and future Budget\/Spend Plan, Lines of Effort and Acquisition Strategy.\n\nThe award of a Multi Award Contract (MAC) seeks efficiencies in the performance of requirements for C4\/Cyber and Information services, and promotes contractor teaming to provide critical technical and management support.  The MAC approach also seeks to reduce the costs of current contract support through the elimination of multiple fees for service contracts, and through the competitive award of contract services."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Management amd Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "12.725"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.768"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.768"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Joint Fires C2 Interoperability"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Joint Fires C2 Interoperability"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}