{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-31",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603833D8Z"
        },
        "ProgramElementTitle": {
            "val": "Engineering Science and Technology (S&T)"
        },
        "R1LineNumber": {
            "val": "63"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "64.549"
            },
            "PriorYear": {
                "val": "18.895"
            },
            "CurrentYear": {
                "val": "19.376"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The reductions to Engineering Science and Technology reflect a decrement from the Defense Wide Review, a realignment of resources into the Systems Engineering (SE) Program Element (0605142D8Z) to support enhanced engineering expertise and assessments for mission-oriented prototypes focused on modernization priorities, and a reduction for other DoD priorities."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) advances engineering state of the practice, and complex defense systems challenges through development of engineering capabilities to improve acquisition quality.  Engineering science and technology, including systems engineering (SE) research, supports the cost-effective acquisition of complex systems.\n\nThis PE increases lethality and supports Department business reform (National Defense Strategy Lines of Effort 1 and 3 respectively).  Improvements to the Department's systems engineering capabilities ensure we quickly and affordably field a lethal Joint Force by addressing dependencies in system and mission capabilities, rapidly evolving technologies, lifecycle considerations, and resource limitations in the face of dynamic threats and missions.  \n\nIn FY 2021, DoD Modeling and Simulation Management Office (MSMO) funding Modeling and Simulation (M&S) activities will transition to Systems Engineering (Program Element 0605142D8Z).\n\nThe Systems Engineering Research Center (SERC) is a University Affiliated Research Center (UARC) established in 2008 as a strategic resource to conduct systems research and improve the Department’s ability to develop and deploy complex weapon systems.  The SERC consists of a network of 22 research universities from across the U.S. working collaboratively to bring the best academic talent in the nation to bear on DoD’s systems engineering research problems.  During FY 2021, SERC funding will be reduced to realign activities to the Department’s modernization priorities.  The SERC will complete R&E funded projects started in prior fiscal years and R&E will establish a business model to sustain the SERC’s network of universities for utilization by other DoD components.  In addition, following the realignment of FY 2021 resources, approximately $2.000 million of Systems Engineering (0605142D8Z) resources will be used to sustain SERC operations for continued support of Service funded projects. \n\nThe Engineered Resilient Systems (ERS) project reduces the risk in development of future weapon systems and ensures warfighter success through better-informed acquisition decisions.  ERS integrates high-fidelity, physics-based modeling with advanced analytic tools to enable rapid design and analysis of current and future weapon systems.  Through the use of high-performance computing, optimized computational tools, and improved processes and methods, ERS enables faster evaluation of system performance, systems-of-systems analysis, and system evaluation within operationally relevant environments to complement and reduce costly physical testing.  In order to focus ERS efforts on the Department’s modernization priorities, ERS project funding will transition in FY 2021 to Systems Engineering (Program Element 0605142D8Z).  With further ERS advances from a development project to an enduring support capability, this shift will better align with the purpose of research funded by projects associated with Systems Engineering.  This change directly orients the previously developed capabilities to address modernization efforts driven by the National Defense Strategy."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.371"
                },
                "CurrentYear": {
                    "val": "19.376"
                },
                "BudgetYearOne": {
                    "val": "19.511"
                },
                "BudgetYearOneBase": {
                    "val": "19.511"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.895"
                },
                "CurrentYear": {
                    "val": "19.376"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.476"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-19.511"
                },
                "BudgetYearOneBase": {
                    "val": "-19.511"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.473"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment of Engineering Resources"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-11.628"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-11.628"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Reduction for Defense Wide Review"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-4.883"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.883"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.007"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.007"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Adjustment to support other DoD priorities"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.993"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.993"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Defense-Wide Review: The FY 2021 funding request was reduced by $4.883 million during DWR to realign funds for higher priority DoD missions.\n\nFY 2021 also included a realignment of $11.628 million to Systems Engineering (Program Element 0605142D8Z) to support enhanced engineering expertise and assessments for mission-oriented prototypes that address modernization priorities, a $2.993 million reduction to support other DoD priorities, and a $0.007 million reduction for economic assumptions."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "401"
                    },
                    "ProjectTitle": {
                        "val": "DoD Modeling and Simulation Management Office"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.565"
                        },
                        "PriorYear": {
                            "val": "4.608"
                        },
                        "CurrentYear": {
                            "val": "4.701"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2021, DoD Modeling and Simulation Management Office transitions to Systems Engineering (Program Element 0605142D8Z)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Office of the Under Secretary of Defense for Research and Engineering (OUSD(R&E)) designated the DoD Modeling and Simulation Management Office (MSMO) to be the focal point and advocate for Defense M&S to enhance the Defense modeling and simulation (M&S) Enterprise by (1) enabling cooperation and collaboration in identifying, developing and sustaining modeling and simulation solutions; and (2) promoting technology solutions, including common M&S architectures, standards, and services that improve interoperability, reuse, and cost effectiveness of DoD M&S.  \n\nMSMO is responsible for:\n• Planning, coordinating, and managing funds to support enterprise-level joint and cross-cutting M&S activities that guide the Defense M&S Community to achieve the DoD Strategic Vision for M&S.\n• Bringing together M&S stakeholders to advise and assist on finding solutions for removing the barriers to interoperability, reuse, commonality, efficiency, and effectiveness.\n• Developing, coordinating, and advocating for policy\/guidance, technology, standards, best practices, and strategic planning processes that promote interoperability and reuse across the Department.\n \nMSMO also serves as DoD’s:\n• Focal point and advocate for coordinating M&S information exchanges and interactions within DoD, with other U.S. Government departments and agencies, international allies, industry, and academia to promote sharing of information and practices, synergy of efforts, and M&S as a key enabler of all organizations’ missions.\n• Lead Standardization Activity (LSA) for managing M&S standards and methodologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DoD Modeling and Simulation Management Office (MSMO)"
                                    },
                                    "Description": {
                                        "val": "MSMO, as the OUSD(R&E)-designated focal point for Defense modeling and simulation (M&S), is responsible for maintaining and enhancing policies, standards, technology, and collaboration to ensure the efficiency and effectiveness of the M&S that supports the full range and scope of DoD missions and operations.\n\nFunding for MSMO in this Program Element will go to zero in FY 2021.  FY 2020 will be used to transition the MSMO capabilities into the general body of systems engineering policy and practice as well as focus on other research and engineering priorities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.608"
                                            },
                                            "Text": {
                                                "val": "FY 2019 Plans: \nIntegrated Defense Analytic Capability:\n• Demonstrate limited prototype, develop and standardize a capability for incorporating Intelligence into analysis for acquisition decision issues using Blue and Red models in an appropriate simulation environment in a joint concept.\n• Expand Community of Practice focusing on high-fidelity, joint mission simulation capabilities to enable acquisition professionals and warfighters to leverage these capabilities and enable reuse of databases, tools, and documentation.\n\nPolicy and Guidance:\n• Publish a DoD M&S Guidebook to guide the Department’s planning for and investing in M&S capabilities and tools.\n• Reissue overarching DoD policy- Convert DoD Directive 5000.59 to DoD Instruction 5000.59.\n• Assist Services and Defense Agencies in development of their Verification, Validation, and Accreditation (VV&A) plans.\n\nStandards:\n• Serve as the Lead Standardization Activity for M&S Standards and Methodologies, and\/or lead and participate in Defense Standardization Program Office and Joint Enterprise Standards Committee activities and International standards activities such as NATO Standardization Agreements for M&S.\n• Enhance the Defense M&S Reference Architecture with additional patterns identified through user feedback.\n\nTechnology:\n• Develop, enhance, and advocate the M&S enterprise suite of tools to improve joint and cross-cutting M&S capabilities.\n• Chair M&S Community of Interest, Cyber M&S Technical Working Group, and M&S Architecture Working Group.\n• Perform technology watch\/horizon scanning related to M&S emerging capabilities to provide investment shaping and strategic direction.\n• Guide and support the Defense Science Board Task Force on Gaming, Exercises, and Modeling & Simulation (GEMS)through outreach, information and knowledge.\n\nCollaboration:\n• Work with Defense stakeholders, continue and refine Department-wide M&S gaps monitoring and reduction capability.\n• Continue to leverage investment in M&S Catalog tools to expand reuse and interoperability among Defense M&S communities.\n• Work with USSOCOM and Simulator Interoperability Senior Steering Group to assess USSOCOM, other Combatant Commands, and Service needs for Simulator Interoperability.\n\n• Represent U.S. interests in International M&S activities:\n  - Collaborate with the NATO M&S Group (NMSG) and participate in NMSG task groups.\n  - US\/UK Stocktake Future Operational Environment\n  - Coordinate The Technical Cooperation Program (TTCP) Virtual Interoperability Prototyping and Research Environment (VIPRE) development with 5-Eyes partners\n• Collaborate with interagency organizations, as required."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.701"
                                            },
                                            "Text": {
                                                "val": "Policy and Guidance:\n• Update M&S guidance as needed for the Defense Acquisition Guidebook and Verification, Validation, and Accreditation Recommended Practice Guide.  \n\nStandards:\n• Serve as the Lead Standardization Activity for M&S Standards and Methodologies, and\/or lead and participate in Defense Standardization Program Office and Joint Enterprise Standards Committee activities and International standards activities such as NATO Standardization Agreements for M&S.\n• Enhance the Defense M&S Reference Architecture with additional patterns identified through user feedback.\n• Transition and align M&S standards activities to USD(R&E) digital, mission and systems engineering activities or other organizations, as needed.\n\nTechnology:\n• Transition the M&S enterprise suite of tools used to improve joint and cross-cutting M&S capabilities to USD(R&E) digital, mission, and systems engineering activities or other Defense partners, as needed.\n• Chair M&S Community of Interest and other M&S related working groups with a focus on the OUSD(R&E) priorities; provide Assistant Directors with M&S data and recommendations on Department capabilities relative to their priority.\n\nCollaboration:\n• Work with Defense stakeholders and continue to refine Department-wide M&S gaps monitoring and reduction capability.\n• Work with USSOCOM and Simulator Interoperability Senior Steering Group to execute implementation of the OUSD(R&E)-signed Decision Memorandum.\n• Represent U.S. interests in International M&S activities as required.\n• Collaborate with interagency organizations, as required."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The DoD Modeling and Simulation Management Office will transition to Systems Engineering (Program Element 0605142D8Z) in FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2021, funding for DoD Modeling and Simulation Management Office is reduced and the effort transitions to Systems Engineering (Program Element 0605142D8Z)."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "402"
                    },
                    "ProjectTitle": {
                        "val": "Systems Engineering Research Center"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.311"
                        },
                        "PriorYear": {
                            "val": "4.905"
                        },
                        "CurrentYear": {
                            "val": "4.900"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2021, funding for the Systems Engineering Research Center is reduced and realigned to Systems Engineering (Program Element 0605142D8Z) to support Integration, Technology, and Tools."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Systems Engineering Research Center (SERC) is a University Affiliated Research Center (UARC) established in 2008 as a strategic resource to conduct systems research and improve the Department’s ability to develop and deploy complex weapon systems.  \n\nThe SERC's network of universities is led by the Stevens Institute of Technology, and includes the Air Force Institute of Technology, Auburn University, Carnegie Mellon University, Georgetown University, Georgia Institute of Technology, Massachusetts Institute of Technology, Missouri University of Science and Technology, Naval Postgraduate School, North Carolina Agricultural and Technical State University, Old Dominion University, Pennsylvania State University, Purdue University, Texas A&M University, University of Alabama, University of Maryland, University of Massachusetts, University of South Florida, University of Southern California, University of Virginia, Virginia Polytechnic Institute, and Wayne State University.  These universities work collaboratively to bring the best talent in the nation to bear on DoD’s systems engineering research problems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Engineering Research Center"
                                    },
                                    "Description": {
                                        "val": "The SERC is a DoD UARC which conducts University-based research that directly supports DoD’s National Defense Strategy through development of new systems engineering methods, processes, and tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.905"
                                            },
                                            "Text": {
                                                "val": "Continue to enhance engineering methods, processes and tools (MPTs) to improve in the following areas:\n\n• Systems Engineering Transformation: transform current systems engineering methods to enable rapid, concurrent and \nscalable definition and affordable development of flexible systems that are responsive to changing threats and missions;\n  – Develop and apply formal methods for resilient systems design to control unmanned aerial vehicle operations.  \n\n• Enterprises and Systems of Systems: create foundational methods to develop and design enterprises and system of systems to provide an overwhelming competitive advantage over our adversaries;\n  – Develop and apply models to gauge expected results from composition of diverse, modular components and systems.\n\n• Trusted Systems: secure defense systems from cyber and other threats through systemic security and assurance approaches that complement incomplete current perimeter\/network defense methods;\n  – Development and trial applications of model-based system assurance methods.\n\n• Human Capital Development: speed the professional development of highly capable systems engineers and technical leaders in the Department and the Defense Industrial Base.\n  – Develop technical report identifying methods for organizations to improve their engineering workforce along with the expected benefits.\n\nTogether, these new methods will accelerate the delivery of critical mission capabilities and technologies, such as autonomy and machine learning, in the face of a dynamic cyber adversary."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.900"
                                            },
                                            "Text": {
                                                "val": "In FY 2020, the SERC will continue to enhance engineering methods, processes and tools by conducting research aligned with the National Defense Strategy, in order to improve mission capabilities in the following areas:\n\n• Systems Engineering Transformation: transform current systems engineering methods to enable rapid, concurrent and scalable definition and affordable development of flexible systems that are responsive to changing threats and missions;\n - Develop and apply trade-space analysis methods to balance dynamic requirements and emerging technologies to improve mission success.\n\n• Enterprises and Systems of Systems: create foundational methods to develop and design enterprises and system of \nsystems to provide an overwhelming competitive advantage over our adversaries;\n  – Develop and apply enterprise model to measure factors impacting use digital engineering methods to acquire DoD’s weapon systems, and gauge the resulting mission benefits.\n\n• Trusted Systems: secure defense systems from cyber and other threats through systemic security and assurance approaches that complement incomplete current perimeter\/network defense methods;\n  – Develop risk-based algorithms and tools for static analysis of software, integrating attack databases and well-known vulnerabilities to prioritize mitigation activities.\n\n• Human Capital Development: speed the professional development of highly capable systems engineers and technical leaders in the Department and the Defense Industrial Base.\n  – Develop systems engineering competencies in undergraduate engineers though capstone design projects that provide novel solutions to warfighter problems.\n\nTogether, these new methods will accelerate the delivery of critical mission capabilities and technologies, such as autonomy and machine learning, in the face of a dynamic cyber adversary."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The level of effort decreases between FY 2020 and FY 2021 to align application of systems engineering methods, processes, and tools for Mission Engineering, Systems Engineering and National Defense Strategy modernization areas."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "403"
                    },
                    "ProjectTitle": {
                        "val": "Engineered Resilient Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "32.673"
                        },
                        "PriorYear": {
                            "val": "9.382"
                        },
                        "CurrentYear": {
                            "val": "9.775"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Engineered Resilient Systems (ERS) funding and mission realigns to Systems Engineering (Program Element 0605142D8Z) in FY 2021 to support enhanced engineering expertise and assessments for mission-oriented prototypes that address modernization priorities."
                        },
                        "ProjectMissionDescription": {
                            "val": "ERS integrates high-fidelity, physics-based modeling with advanced analytic tools to enable rapid design and analysis of current and future weapon systems.  Through the use of high-performance computing, optimized computational tools, and improved processes and methods, ERS enables faster evaluation of system performance, systems-of-systems analysis, and system evaluation within operationally relevant environments to complement and reduce costly physical testing.  ERS project funding will transition in FY 2021 to Systems Engineering (Program Element 0605142D8Z), with further ERS research funded by projects associated with the modernization priorities.  This change directly orients the previously developed capabilities to address modernization efforts driven by the National Defense Strategy.\n\nERS products are engineering design visualization and tool integration frameworks that integrate physics-based models and engineering tools to greatly improve the ability to perform tradespace and requirements analysis, optimize designs, and evaluate system performance.\n\nERS leverages multi-fidelity physics-based models developed by the S&T community to inform the acquisition decision process, e.g., increased\/easier use of high-performance computing, analyses of massive data sets, and lifecycle cost sensitivity analysis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineered Resilient Systems (ERS)"
                                    },
                                    "Description": {
                                        "val": "The ERS project directly supports the DoD modernization priorities by delivering computational engineering tools for performance analysis, modeling and simulation, tradespace assessment, and data analysis and visualization.  These engineering tools support in-depth analyses that validate new technology solutions during critical acquisition engineering activities prior to major acquisition milestones."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.382"
                                            },
                                            "Text": {
                                                "val": "Set-Based Design: Improve and test primary framework for ERS next-generation tradespace analysis tools with data storage, statistical analysis, and advanced visualization techniques; develop model integration technologies to retain tradespaces and other early conceptual design artifacts; and develop linkage between system requirements and tradespace analysis, (e.g., multi-domain analysis of Air Force fixed-wing and missile design alternatives).\n\nComputational Engineering: Develop design process automation to rapidly incorporate new and existing high-fidelity models into the analysis of existing and proposed weapon systems; develop and demonstrate advanced parametric design and optimization tools to create credible acquisition models; develop computational environments that facilitate the use of high-performance computing infrastructure within the engineering design and analysis processes, (e.g., increasing the number of propeller designs evaluated for subsurface propulsion).\n\nLarge-Scale Data Analytics: Leverage physical test datasets and national investments in artificial intelligence, machine learning, and deep learning technologies in order to produce concept prognostic and diagnostic tools for lifecycle analyses; begin exploration of the deployment of algorithms and tools trained with artificial intelligence and machine learning techniques to DoD platforms, (e.g., large scale data analysis of rotorcraft prognostics and health management data to inform sustainment decisions)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.775"
                                            },
                                            "Text": {
                                                "val": "During FY 2020, ERS research will focus on reducing the decision risk associated with hypersonic and directed energy weapon systems.  ERS will also continue efforts to enable the use of artificial intelligence for design and analysis of future weapon platforms.  Further, ERS will work to transition from Engineering S&T funded activities to requirements directly funded by DoD’s modernization priorities.  \n\nSpecifically, ERS will advance research in the following areas: \n\n• Automated Engineering Processes: develop and deliver a decision-support environment that enables set-based design, optimization, tradespace analysis, and visualization of data from DoD platforms; and incorporate techniques to increase reuse of data, models, software tools, and analyses, e.g., developing methods and tools for multi-domain analysis of hypersonics vehicles.\n\n• Integrated High-Fidelity Simulations: develop and evolve computational tools to support parametric design environments; use high-performance computing to speed analyses; and integrate multiple disciplines into ERS workflows such as high-fidelity fluid dynamics, structural mechanics, and\/or other performance determination models.\n\n• High-Performance Data Analytics: evolve data engineering techniques to improve storage, labeling, and analysis of vast operational datasets from existing weapon systems; demonstrate machine learning methods to gain insight from weapon system data; and explore the use of artificial intelligence and machine learning techniques to assist humans in the design of new weapon systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "ERS transitions in FY 2021 to Systems Engineering (Program Element 0605142D8Z)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "ERS transitions in FY 2021 to Systems Engineering (Program Element 0605142D8Z)."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}