{
    "id": "2021-Army-PB-2040-JBOOK-2ce7b76ca8f41dbc06183380f90728d4a8e40b9122c9effab5b4a02fdffb364e-23",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0606003A"
        },
        "ProgramElementTitle": {
            "val": "CounterIntel and Human Intel Modernization"
        },
        "R1LineNumber": {
            "val": "209"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "2.636"
            },
            "CurrentYear": {
                "val": "2.925"
            },
            "BudgetYearOne": {
                "val": "5.200"
            },
            "BudgetYearOneBase": {
                "val": "1.063"
            },
            "BudgetYearOneOCO": {
                "val": "4.137"
            },
            "BudgetYearTwo": {
                "val": "5.778"
            },
            "BudgetYearThree": {
                "val": "4.012"
            },
            "BudgetYearFour": {
                "val": "3.997"
            },
            "BudgetYearFive": {
                "val": "4.027"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Counterintelligence (CI) and Human Intelligence (HUMINT) Modernization Program Element (PE) supports ongoing rejuvenation and development of new critical CI and HUMINT systems, applications, tools, equipment, and capabilities necessary to defeat foreign intelligence, international terrorist, and insider threats while enhancing our HUMINT collection capability. The required tools provide Army and DoD leadership, commanders, and warfighters the intelligence necessary for making advantageous operational planning, policies, and timely decisions. Modernization of these systems is a core component of ensuring overmatch on current and future battlefields. Beginning in Fiscal Year (FY) 2019, funding for these efforts was transferred to PE 0606003 \/ Project FI9 (Counter Intel and Human Intel Modernization) from PE 0303028A (INTEL SPT TO FORCE XXI) \/ Project FG2 (Counterintelligence & Human Intel Modernization)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.636"
                },
                "CurrentYear": {
                    "val": "2.925"
                },
                "BudgetYearOne": {
                    "val": "2.064"
                },
                "BudgetYearOneBase": {
                    "val": "2.064"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.636"
                },
                "CurrentYear": {
                    "val": "2.925"
                },
                "BudgetYearOne": {
                    "val": "5.2"
                },
                "BudgetYearOneBase": {
                    "val": "1.063"
                },
                "BudgetYearOneOCO": {
                    "val": "4.137"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "3.136"
                },
                "BudgetYearOneBase": {
                    "val": "-1.001"
                },
                "BudgetYearOneOCO": {
                    "val": "4.137"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.136"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.001"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "4.137"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease due to transition to sustainment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "FI9"
                    },
                    "ProjectTitle": {
                        "val": "Counterl Intel and Human Intel Modernization"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.636"
                        },
                        "CurrentYear": {
                            "val": "2.925"
                        },
                        "BudgetYearOne": {
                            "val": "5.2"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.063"
                        },
                        "BudgetYearOneOCO": {
                            "val": "4.137"
                        },
                        "BudgetYearTwo": {
                            "val": "5.778"
                        },
                        "BudgetYearThree": {
                            "val": "4.012"
                        },
                        "BudgetYearFour": {
                            "val": "3.997"
                        },
                        "BudgetYearFive": {
                            "val": "4.027"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Counterintelligence (CI) and Human Intelligence (HUMINT) Modernization Program Element (PE) supports ongoing rejuvenation and development of new critical CI and HUMINT systems, applications, tools, equipment, and capabilities necessary to defeat foreign intelligence, international terrorist, and insider threats while enhancing our HUMINT collection capability. The required tools provide Army and DoD leadership, commanders, and warfighters the intelligence necessary for making advantageous operational planning, policies, and timely decisions. Modernization of these systems is a core component of ensuring overmatch on current and future battlefields. Beginning in Fiscal Year (FY) 2019, funding for these efforts was transferred to PE 0606003 \/ Project FI9 (Counter Intel and Human Intel Modernization) from PE 0303028A (INTEL SPT TO FORCE XXI) \/ Project FG2 (Counterintelligence & Human Intel Modernization).\n\nBASE Line of Effort:\nCI Support to Force Protection (CIFP) ($1,063K) provides for updating the Army's Threat Management Information Sharing System, the Army Counterintelligence Operations Portal (ACOP), and partnering with other Service CI entities on a joint CI analysis system development project.  Will support development and testing of software code integrating existing and new algorithms to multiple data source to record, identify, sort, and prioritize behaviors.  \n\nOCO Lines of Effort:\nThe Joint Service Counter C4ISR Initiative ($1,000K) conducts technical analysis and research focused on centers of gravity within the C4ISR architecture of adversary weapon systems that enable successful kinetic and non-kinetic engagements.  The Army will use the intelligence provided from this effort to inform the development against key adversary weapon systems. \n\nEmerging GEOINT Collection Integration ($887K) provides rapid integration of emerging GEOINT capabilities and analysis techniques significantly ahead of the traditional integration timelines.  The 513th MI BDE has been given access to pre-release algorithms and capabilities, and can begin, test, development, and validation activities years prior to traditional processes.  This capability allows GEOINT focused CME support to identify difficult CT issues and deliver appropriate capabilities needed today in every theater.  Each MIB-T that provides GEOINT support will leverage the capability, and its applicability is world-wide.  The project funds software and testing to extract, analyze, and validate brand new and emerging classified data sources. \n\nIdentity Intelligence Analytic Repository (I2AR) ($1,250K) is the Department's only automated information system for linking biometric and forensics data with associate information and intelligence data to create the Biometrically Enabled Watchlist (BEWL) and other intelligence analytic products.  These efforts will increase the efficiency in which intelligence analysts can make  linkage between identities discovered thro7ugh the use of biometrics and forensics by DoD and derogatory information and intelligence. \n\nPursuit and Exploitation (P&E) ($1,000K) provides operational gear to support operational needs requirements by filling known intelligence gaps for force deployed.  The equipment also provide advancements and risk reduction for current and future system and Programs of Record (PoR).  The P&E efforts also aims to improve the support to Long Range Precision Fires (LRPF) that requires an increase in the range of detection, identification, and geolocation of adversarial signals of interest.  There is also a need to continue to decrease size, weight, power, and cost in order to give the Army more flexibility for employment.  This funding provides software and material necessary to upgrade existing systems and improve support to LRPF and cyber Electronic Warfare Activities.  These efforts help ensure capabilities remain relevant in delivering timely, actionable intelligence and targeting to facilitate decision making at the tactical edge.  The equipment also provide advancements and risk deduction for current and future systems and Program of Record."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army's Threat Management Informtion Sharing System"
                                    },
                                    "Description": {
                                        "val": "The Counterintelligence (CI) and Human Intelligence (HUMINT) Modernization Program Element (PE) supports ongoing rejuvenation and development of new critical CI and HUMINT systems, applications, tools, equipment, and capabilities necessary to defeat foreign intelligence, international terrorist, and insider threats while enhancing our HUMINT collection capability.  The required tools provide Army and DoD leadership, commanders, and warfighters the intelligence necessary for making advantageous operational planning, policies, and timely decisions.  Modernization of these systems is a core component of ensuring overmatch on current and future battlefields.  Beginning in Fiscal Year (FY) 2019, funding for these efforts was transferred to PE 0606003\/Project F19 (Counter Intel and Human Intel Modernization) from PE 0303028A (Intel Spt to Force XXI)\/Project FG2 (Counterintelligence & Human Intel Modernization)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.636"
                                            },
                                            "Text": {
                                                "val": "Updated the Army's Threat Management Information Sharing System."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.925"
                                            },
                                            "Text": {
                                                "val": "Funding supports development and testing of software code integrating existing and new algorithms to analyze multiple data sources to record, identify, sort and prioritize behaviors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.063"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.063"
                                            },
                                            "Text": {
                                                "val": "Will provide for updating of the Army's Threat Management Information Sharing System.  Will support development and testing of software code integrating existing and new algorithms to analyze multiple data source to record, identify, sort, and prioritize behaviors indicative of espionage, national security compromises, and other foreign and insider threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No impact"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C4ISR"
                                    },
                                    "Description": {
                                        "val": "The Joint Service Counter C4ISR Initiative conducts technical analysis and research focused on centers of gravity within the C4ISR architecture of adversary weapon systems that enable successful kinetic and non-kinetic engagements.  The Army will use the intelligence provided from this effort to inform the development of offensive cyber and advanced electronic warfare capabilities against adversaries."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Continue the development of offensive cyber"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding remains stable."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GEOINT"
                                    },
                                    "Description": {
                                        "val": "GEOINT Collection Integration provides rapid integration of emerging GEOINT capabilities and analysis techniques significantly ahead of the traditional integration timelines.  the 513th MI BDE has been given access to pre-release algorithms and capabilities, and can begin test, development, and validation activities years prior to traditional processes.  This capability allows GEOINT focused CME support to identify difficult CT issues and deliver appropriate capabilities needed today in every theater.  Each MIB-T that provides GEOINT support will leverage the capability, and its applicability is world-wide. The project funds software and testing to extract, analyze, and validate brand new and emerging classified data sources."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.887"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.887"
                                            },
                                            "Text": {
                                                "val": "Focused CME support to identify difficult CT issues and deliver appropriate capabilities needed today in every theater."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No impact"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Identity Intelligence Analytic Repoitory (I2AR)"
                                    },
                                    "Description": {
                                        "val": "Identity Intelligence Analytic Repository (I2AR) is the Department's only automated information system for linking biometric and forensic data with associate information and intelligence data to create the Biometrically Enabled Watchlist (BEWL) and other intelligence analytic products.  These efforts will increase the efficiency in which intelligence analysts can make linkage between identities discovered through the use of biometrics and forensics by DoD and derogatory information and intelligence."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.25"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "1.25"
                                            },
                                            "Text": {
                                                "val": "Increase the efficiency in which intelligence analysts can make linkage between identities discovered through the use of biometrics and forensics by DoD and derogatory information and intelligence."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No impact"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pursuit and Exploitation"
                                    },
                                    "Description": {
                                        "val": "Provides operational gear to support operational needs requirements by filling intelligence gaps for forces deployed.  The equipment also provides advancements and risk reduction for current and future systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Provides operational gear to support operational needs requirements by filling intelligence gaps for forces deployed.  The equipment also provides advancements and risk reduction for current and future systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "These efforts ensur capabilities remain relevant in delivering timely, actionable intelligence."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}