{
    "id": "2021-AirForce-PB-3620F-MJBOOK-0-0-35f9ea1af972068bade2db5522abb7585a23438b167099bf9cb1d89421e6c574-36",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-SPACE-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3620F",
        "appropriation_name": "Research, Development, Test & Evaluation, Space Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1206423SF"
        },
        "ProgramElementTitle": {
            "val": "Global Positioning System III - Operational Control Segment"
        },
        "R1LineNumber": {
            "val": "37"
        },
        "MdapCode": {
            "val": "456"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3620F"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Space Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "481.999"
            },
            "BudgetYearOneBase": {
                "val": "481.999"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "406.136"
            },
            "BudgetYearThree": {
                "val": "290.873"
            },
            "BudgetYearFour": {
                "val": "124.617"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "1303.625"
            }
        },
        "ProgramElementNote": {
            "val": "This program, BA 07, PE 1206423SF, project 67A021, OCX Block 3F, is a new start."
        },
        "ProgramElementMissionDescription": {
            "val": "In FY 2021, PE 1206423F, Global Positioning System III - Operational Control Segment efforts were transferred to Appropriation 3620, Research, Development, Test & Evaluation, Space Force, PE 1206423SF, Global Positioning System III - Operational Control Segment from Appropriation 3600, Budget Activity 07 due to the creation of a new Appropriation for Space Force.\n\nThe Global Positioning System (GPS) is a space based Positioning, Navigation and Timing (PNT) distribution system which operates through all weather. GPS supports both civil and military users in air, space, sea and land operations. GPS is a satellite-based radio navigation system that serves military and civil users worldwide. GPS users process satellite signals to determine accurate position, velocity and time. GPS must comply with Title 10 United States Code (USC) Sec 2281 which requires that the Secretary of Defense (SECDEF) ensures the continued sustainment and operation of GPS for military and civilian purposes, and 51 USC Sec 50112, which requires that GPS complies with certain standards and facilitates international cooperation.\n\nProgram Element (PE) 1206423SF funds Research, Development, Test and Evaluation (RDT&E) for the GPS Next Generation Operational Control System (OCX), the upgrade to OCX called OCX Block 3F to incorporate Regional Military Protection (RMP), command and control functionality for GPS III Follow-on (GPS IIIF) satellites, and the GPS Enterprise Integrator (EI). OCX acquisition was established to 1) provide command and control of legacy and GPS III satellites, 2) incorporate situational awareness to support Navigation Warfare (NAVWAR) and signal monitoring, 3) enable mission capability upgrades to support a warfighter effects-based approach to operations, and 4) integrate Department of Defense (DoD) information assurance and cybersecurity controls and capabilities. OCX Block 3F will upgrade OCX with new capabilities to synchronizes with GPS IIIF Space Segment capabilities. GPS EI is responsible for architecture and system definition (the analysis and definition, management, maintenance, and evolution of the GPS Enterprise requirements and interface technical documents) as well as for the planning, execution, and fielding of the GPS Enterprise.\n\nOCX funds support efforts such as engineering studies and analyses, architectural engineering studies, trade studies, technology needs forecasting, modernization initiatives, systems engineering, system development, resolving obsolescence issues, test and evaluation efforts, and mission operations. These activities support upgrades and product improvements for military and civil applications necessary to enable efforts to protect United States (U.S.) Military and Allies' use of GPS. Additionally, funds ensure OCX efforts meet current and future Joint Requirements Oversight Council (JROC) approved required capabilities. \n\nOCX Block 3F will upgrade OCX with new capabilities to synchronize with GPS IIIF Space Segment and Military GPS User Equipment (MGUE) Increment 2 capabilities. This includes advanced concept development such as systems analysis, modernized control segment development, modernization\/deployment of 17 monitoring stations, mission planning development, training simulators, integrated logistics support products, test resources, systems engineering required to meet the Government's obligations to the international, military and civil communities, and system requirements verification. OCX Block 3F will maintain backward compatibility to support the legacy constellation develop solutions necessary to command, control and monitor GPS IIIF, to include advance collection and integration of RMP high power regional M-code signals, rapid warfighter effects and support to GPS auxiliary payloads.\n\nThe GPS Enterprise consists of Space, Ground Control, Nuclear Detonation (NUDET) Detection System (NDS) and User Equipment Segments. The Government is responsible for the integration of the GPS Segments such that they provide worldwide GPS capability to support the warfighter and over a billion national security, civil, Allied, and commercial GPS users.\n\nThe GPS EI project includes the efforts associated with the Government's prime contract tasks necessary to accomplish critical integrating function with the three GPS enterprise material segments along with the logistics, operational and transition communities. The GPS EI maintains the GPS current architecture and system definition, controls and validates interfaces, ensures compatibility of Generation II and III systems, and develops\/manages plans for execution and fielding of the GPS Enterprise.  Further, GPS EI provides modeling, simulation, and technical analyses of impacts for Government directed enterprise level trades among the GPS segments leading\nto definition, management, maintenance, and evolution of the GPS Enterprise requirements and interface technical documents to build and ensure the integrity of the enterprise technical baseline, and perform system requirements verification. \n\nIn addition, the GPS EI project funds the technical evolution, risk reduction, enterprise-level testing and delivery of all GPS Enterprise capabilities. Examples for Generation II include electronic protection; for Generation III, additional anti-jamming protection and additional civil signals. To accomplish this, GPS EI delivers Test and Verification capabilities, Requirements and Interface Management, and Systems Integration support across the Space, Control, and User Segments. In this capacity, GPS EI is responsible for managing this cross-program work to provide these and other capabilities.\n\nGPS EI's analyses guides Government decisions to ensure efficient and effective synchronization and execution across all Generation II and III GPS programs. For Enterprise-wide integration to be successful, the GPS EI: works with the GPS and NDS prime contractor teams to develop plans for early risk reduction System Integration Demonstrations to ensure system interfaces and functionality meet user and system requirements; ensures all equipment and documentation is ready when needed; integrates and analyzes enterprise schedules; and conducts formal test and verification, including Requirement Verification Plans and System Test Plans and Procedures. GPS EI performs all these efforts across all GPS programs in all acquisition phases. The Government owns the GPS Enterprise system requirements and integration, and highly leverages the GPS EI team to eliminate the need to fund a development prime contractor to perform these functions. This enhances Government control, oversight and program accountability.\n\nThe FY 2021 funding request was reduced by $6.448 million to account for the availability of prior year execution balances.\n\nSpace acquisition must respond with speed and agility to emerging adversary threats. Space & Missile Systems Center (SMC) is transforming the organization and implementation of space acquisition to an enterprise approach, maximizing innovation and resiliency, leveraging international, commercial, and mission partnerships, and managing program\/project priorities according to an integrated unclassified\/classified enterprise space architecture. Expanding the appropriate acquisition authorities and contract mechanisms to deliver capability sooner, SMC will strategically execute experimentation, prototyping, risk reduction, and other efforts to develop new or repurpose capabilities.\n\nThis PE may include necessary civilian pay expenses required to manage, execute, and deliver OCX weapon system capability. The use of such program funds would be in addition to the civilian pay expenses budgeted in PEs 1206392SF and 1206398SF.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "481.999"
                },
                "BudgetYearOneBase": {
                    "val": "481.999"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "481.999"
                },
                "BudgetYearOneBase": {
                    "val": "481.999"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "481.999"
                                },
                                "BudgetYearOneBase": {
                                    "val": "481.999"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2021: +$481.999M; funds starting in FY 2021 were transferred from RDT&E, Air Force to RDT&E, Space Force."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "67A021"
                    },
                    "ProjectTitle": {
                        "val": "OCX"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "421.664"
                        },
                        "BudgetYearOneBase": {
                            "val": "421.664"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "341.216"
                        },
                        "BudgetYearThree": {
                            "val": "290.873"
                        },
                        "BudgetYearFour": {
                            "val": "124.617"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1178.370"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This program, BA 07, PE 1206423SF, project 67A021, OCX Block 3F, is a new start."
                        },
                        "ProjectMissionDescription": {
                            "val": "GPS is a space based PNT distribution system which operates through all weather. This project funds the research and development for OCX. This includes, but is not limited to, advanced concept development, systems engineering and analysis, modernized control segment and mission planning development, modernization\/deployment of 17 monitoring stations, training simulators, integrated logistics support products, and test resources.\n\nOCX acquisition was established to: 1) provide command and control of legacy and GPS III satellites; 2) incorporate situational awareness to support NAVWAR and signal monitoring; 3) enable mission capability upgrades to support a warfighter effects-based approach to operations; and 4) integrate DoD information assurance and cybersecurity controls and capabilities. OCX funds will support efforts such as engineering studies and analyses, architectural engineering studies, trade studies, technology needs forecasting, technology development, systems engineering, system development, test and evaluation efforts and mission operations in support of upgrades and product improvements for military and civil applications necessary to support efforts to protect U.S. military and Allies' use of GPS. Additionally, funds will ensure efforts to meet current and future JROC approved required capabilities. \n\nOCX Block 0 (through Iteration 1.5) is the Launch and Control System (LCS) intended to conduct Launch and Early Orbit (LEO) operations and the on-orbit checkout of all GPS III satellites. OCX Block 0 is a subset of OCX Block 1.\n\nOCX Block 1 (adds Iterations 1.6, 1.7 and 2.1 to Block 0) fields the operational capability to control all legacy satellites and civil signals (L1C\/A), military signals (L1P(Y), L2P(Y)) as well as the GPS III satellites and the modernized civil signal (L2C) and the aviation safety-of-flight signal (L5). In addition, Block 1 will field the basic operational capability to control the modernized military signals (L1M and L2M M-Code), and the globally compatible signal (L1C). It also fully meets information assurance\/cyber defense requirements.\n\nOCX Block 2 fields the advanced operational capability to control the advanced features of the modernized military signals (L1M and L2M M-Code). Blocks 1 & 2 are being delivered concurrently as a result of the Oct 2016 Nunn-McCurdy review.\n\nOCX Block 3F will modify OCX Blocks 1 and 2 to field new capabilities in support of the GPS III Follow-On (GPS IIIF) production program and incorporate Regional Military Protection (RMP) to handle future threats. OCX Block 3F will upgrade OCX with new capabilities to synchronizes with GPS IIIF Space Segment and Military GPS User Equipment (MGUE) Increment 2 capabilities. OCX Block 3F will maintain backward compatibility with the existing capabilities to support the legacy GPS constellation and integrate into Block 1 and 2 and future efforts to support GPS IIIF. The OCX Block 3F effort will develop solutions necessary to command, control, and monitor GPS IIIF spacecraft and include advance collection and integration of RMP high-power regional Military Code (M-Code) signals, rapid warfighter effects, and support to GPS IIIF auxiliary payloads (including Search and Rescue (SAR), Nuclear Detonation (NUDET) Detection System (NDS)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "OCX Development"
                                    },
                                    "Description": {
                                        "val": "Development of GPS OCX system to launch GPS III, operate a mixed GPS II and GPS III constellation, and provide for a robust Information Assurance system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "308.403"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "308.403"
                                            },
                                            "Text": {
                                                "val": "Complete Iteration 1.7 and 2.1 integration and test activities. Continue contractor support of the Block 0 baseline that is supporting GPS III satellite launch and checkout. Complete system level Site Acceptance Testing (SAT). Complete system maturity demonstrations, known as TRROs, in support of transition from the legacy OCS to OCX. Continue software and hardware obsolescence remediation and replacement of obsolete IBM servers. Begin and complete system acceptance and DD250. Begin interim contractor support activities. Rapidly respond to implement system resiliency and situational awareness necessary to operate in the contested space domain. Activities may include, but are not limited to program office support, studies, technical analysis, experimentation, prototyping, etc."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OCX Block 3F"
                                    },
                                    "Description": {
                                        "val": "OCX Block 3F will upgrade OCX Block 1 & 2 with new capabilities in support of GPS IIIF and incorporate RMP to handle future threats. OCX Block 3F will maintain backward compatibility to support the legacy constellation develop solutions necessary to command, control and monitor GPS IIIF, to include advance collection and integration of RMP high power regional M-code signals, rapid warfighter effects and support to GPS auxiliary payloads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "72.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "72.600"
                                            },
                                            "Text": {
                                                "val": "Award OCX Block 3F contract. Conduct requirements analysis and necessary systems engineering to start the development and test planning leading to a sprint design review in mid 2021 in order to upgrade the system simulator and implement all changes required to the OCX baseline to support GPS IIIF SV."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 is a new start for OCX Block 3F."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technical Support"
                                    },
                                    "Description": {
                                        "val": "Development of the Standardized Space Trainer (SST) to provide GPS III operator training. Development of Enterprise Mission Planning Systems. Facilities upgrades for Control Stations and associated equipment and servers. Systems Engineering (SE) including Technical Mission Analysis (TMA), Modernization SE and Technical Support, and Test and Evaluation (T&E)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.661"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.661"
                                            },
                                            "Text": {
                                                "val": "Complete work on the SST and development demonstration of capabilities. Continue data collection, and tuning of the monitoring stations equipment and OMSRE. Begin technical support of Transition Risk Reduction Operations (TRROs) and Integrated System Test."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE,AF 07 PE 1203265F"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "139.180"
                                        },
                                        "CurrentYear": {
                                            "val": "42.440"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "181.620"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE,SF 07 PE 1203265SF"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "10.777"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.777"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.296"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.598"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.382"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.722"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "30.775"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE,AF 05 PE 1203269F"
                                    },
                                    "Title": {
                                        "val": "GPS III Follow-On"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "412.202"
                                        },
                                        "CurrentYear": {
                                            "val": "462.875"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "875.077"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE,SF 05 PE 1203269SF"
                                    },
                                    "Title": {
                                        "val": "GPS III Follow-On"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "263.496"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "263.496"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "267.542"
                                        },
                                        "BudgetYearThree": {
                                            "val": "294.706"
                                        },
                                        "BudgetYearFour": {
                                            "val": "286.279"
                                        },
                                        "BudgetYearFive": {
                                            "val": "177.074"
                                        },
                                        "CostToComplete": {
                                            "val": "1167.479"
                                        },
                                        "TotalCost": {
                                            "val": "2456.576"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SPAF 01 Line Item GPSIII"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "69.386"
                                        },
                                        "CurrentYear": {
                                            "val": "31.466"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "100.852"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SPSF 01 Line Item GPSIII"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "20.122"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.122"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.302"
                                        },
                                        "BudgetYearThree": {
                                            "val": "19.312"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.868"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.883"
                                        },
                                        "CostToComplete": {
                                            "val": "92.808"
                                        },
                                        "TotalCost": {
                                            "val": "163.295"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SPAF 01 Line Item GPS IIIF"
                                    },
                                    "Title": {
                                        "val": "GPS III Follow-On"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "414.625"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "414.625"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SPSF 01 Line Item GPS IIIF"
                                    },
                                    "Title": {
                                        "val": "GPS III Follow-On"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "627.796"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "627.796"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "634.821"
                                        },
                                        "BudgetYearThree": {
                                            "val": "640.782"
                                        },
                                        "BudgetYearFour": {
                                            "val": "920.657"
                                        },
                                        "BudgetYearFive": {
                                            "val": "750.853"
                                        },
                                        "CostToComplete": {
                                            "val": "3230.317"
                                        },
                                        "TotalCost": {
                                            "val": "6805.226"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Air Force is pursuing a \"Block\" approach for OCX in order to respond to warfighter capability requirements. The strategy calls for capability (e.g., better signal maintainability, Unified S-Band (USB), Search and Rescue (SAR) GPS, and near-real time Command and Control (C2)), on-ramps for the follow-on contract for GPS III Space Vehicles (SVs) (starting no earlier than SV11) which will require updates to the OCX ground segment. Enterprise studies will ensure GPS Enterprise\nsynchronization across space and ground segments. Acquisition strategy for OCX Block 3F is currently in work however program office is targeting a tailored ACAT II program with a targeted award in FY 2021."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Phase B OCX Block 1 & 2 Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aurora, CO"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "280.853"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "280.853"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "622.320"
                                                    },
                                                    "TotalCost": {
                                                        "val": "903.173"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4413.394"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Block 3F Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "72.600"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "72.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "72.600"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Technical Mission Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "15.394"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "15.394"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "46.182"
                                                    },
                                                    "TotalCost": {
                                                        "val": "61.576"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Enterprise SE&I"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TASC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.865"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.865"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "20.595"
                                                    },
                                                    "TotalCost": {
                                                        "val": "27.460"
                                                    },
                                                    "TargetValue": {
                                                        "val": "88.187"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Modernization\/SE & Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.313"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.313"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.313"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Standard Space Trainer (SST)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Sonalyst, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Waterford, CT"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.500"
                                                    },
                                                    "TargetValue": {
                                                        "val": "34.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Enterprise Mission Planning"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton Eng Services"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.800"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.800"
                                                    },
                                                    "TargetValue": {
                                                        "val": "33.700"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GPS OCX T&E"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.654"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.654"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.654"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GPS OCX FFRDC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.132"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.132"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "21.396"
                                                    },
                                                    "TotalCost": {
                                                        "val": "28.528"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "12.613"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "12.613"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "45.213"
                                                    },
                                                    "TotalCost": {
                                                        "val": "57.826"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Other Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.940"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.940"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.940"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "OCX"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Block 0 Interim Contractor Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "System Acceptance Test (SAT)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Block 1\/2 DD 250"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "OCX Block 1 Ready to Operate (RTO)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OCX Block 3F"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Contract Award"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Design Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Software Factory Ready Use"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Acquisition strategy for OCX Block 3F is currently in work. However, program office is targeting a tailored ACAT II program with a targeted contract award 2QFY21, design review 3QFY21, 4QFY21 OCX3F Software Factory Ready for Use."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "67A025"
                    },
                    "ProjectTitle": {
                        "val": "GPS Enterprise Integrator"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "60.335"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.335"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "64.920"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "125.255"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The GPS Joint Program Office established and maintains the technical baseline and is responsible for the successful fielding of all the GPS Segments (space, control, and user). In order to successfully execute these responsibilities, GPS Enterprise Integrator (EI) creates an enterprise architecture, integrates segment products, verifies the enterprise requirements are adequately met, develops and implements various Systems Engineering documents, defines methods of verification, conducts integrated system test and test analysis, develops and manages the Enterprise technical baseline which reflect multiple stakeholder requirements; Stakeholders include the Department of Defense (DoD), foreign governments, industry, and the general public, (through four public interface specifications). Furthermore, GPS EI ensures GPS capabilities meet the warfighter's, civil agencies', commercial entities', international treaties', and over four billion global GPS users' needs. Moreover, GPS EI is responsible for delivering a reliable PNT signal capability to military operators, the civil user community, and international partners. In addition, GPS EI validates the system performance in various mission threat scenarios during its development as well as, provides in-depth technical expertise to enhance government control, oversight and program accountability. GPS EI is also responsible for all aspects of schedule and technical alignment across the GPS segments (space, control, and user). \n\nMore specifically, GPS EI is responsible for technical baseline management, integration, synchronizing, testing, and verifying GPS III, OCX, Military Global Positioning System User Equipment (MGUE), M-Code Early Use (MCEU) and Contingency Operations (COps). Additionally, GPS EI is responsible for creating and managing plans that provide early exercise of the products under development, compatibility analysis, and inter-segment testing. The inter-segment tests are required to prove OCX interoperability with GPS III satellites and modernized user equipment. More importantly, it ensures backwards compatibility with GPS Block II satellites and legacy user equipment. The GPS EI also manages the process through which the JROC validated requirements are matured and flowed down to the system segments, while remaining consistent with various interfaces. This enables the GPS system to meet Title 10 of the USC, Sec 2281, mandated GPS capabilities, and various other obligations to the international community that provide inter-operable PNT signals. \n\nGPS EI also supports the Government Joint Program Office's GPS spectrum protection at international forums such as the International Telecommunications Union. Such support consists of advocating on behalf of the United States (U.S.) Government when negotiating with foreign partners. In addition, GPS EI provides technical expertise to maintain relationships with other U.S. government agencies that include the Federal Aviation Administration (FAA), National Geospatial-Intelligence Agency (NGA), National Aeronautics and Space Administration (NASA), Departments of State (DOS), Transportation (DoT), Homeland Security (DHS), and Commerce (DOC). GPS EI Spectrum also ensures GPS priority for eight essential spectrum signals, including those required for civil air navigation and safety of life. Spectrum Protection prevents encroachment from commercial or foreign entities, which results in the preservation of warfighter's reliable signal. As a result, military operations and the integrity of the global economic infrastructure are protected.\n \nGPS EI also provides the GPS enterprise expertise in System Safety, Enterprise level System Security Engineering covering Acquisition Systems Program Security (i.e., personnel, industrial, operations, information, sensitive compartmented information, communication, and physical), Program Protection, Foreign Disclosure, Public Release reviews, Mission System Certification and Accreditation, and Enterprise Cybersecurity. GPS EI is accountable for the development, execution, and analysis of OCX, cybersecurity, and associated test cases necessary to deliver a secure operational system.\n\nThe FY 2021 funding request was reduced by $6.448 million to account for the availability of prior year execution balances."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "GPS Enterprise Integrator"
                                    },
                                    "Description": {
                                        "val": "The integration and technical baseline control of all elements of the GPS system (space\/control\/user) in support of both military and civil users.  Test and verification of integrated system performance in preparation for operational test and evaluation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "60.335"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "60.335"
                                            },
                                            "Text": {
                                                "val": "Conduct government security test of OCX block 1 and test planning using simulators to verify test procedures and determine readiness for testing with live assets of OCX Block 1, and GPS III, (IST 3-1) in preparation for an integrated test for OCX that includes OCX Block 1, the full GPS satellite constellation with GPS III, and MGUE available on all four service lead platforms (IST 3-2).  In addition, perform OCX adversarial cyber tests, M-code live sky and support OCX operational test.  Support MGUE increment one Operational Testing (IST 3-3) on all four service lead platforms.  Support delivery and testing for SMPS 5C update that allows full tasking for M-Code and OCX compatibility. Initiate planning for IST 3-4 to verify functionality of MGUE increment 2 and M-Code handheld receivers.  Transition MCEU (IST 2-6) from Operational Test activities into operations.  Align enterprise to seamlessly transition control of the GPS constellation from OCS to OCX.  Support launch and on- orbit checkout testing of SVs 06-07. Support planning and execution of test events for SVs 08.  Conduct modeling and simulation to verify capability of GPS IIIF to operate in a contested environment.  Continue cybersecurity tests across all GPS segments (space\/control\/user).  Develop technical specifications for operation of Regional Military Protection (RMP).  Continue to conduct tests and analyses to protect GPS users from interference sources that threaten performance of GPS receivers. Participate in international GNSS forums to advocate for GPS regulatory and technical interests. Rapidly respond to implement system resiliency and situational awareness necessary to operate in the contested space domain. Activities may include, but are not limited to program office support, studies, technical analysis, experimentation, prototyping, etc."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE,SF 04 PE 1203164SF"
                                    },
                                    "Title": {
                                        "val": "NAVSTAR Global Positioning System (User Equipment) (Space)"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "390.704"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "390.704"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "340.178"
                                        },
                                        "BudgetYearThree": {
                                            "val": "283.663"
                                        },
                                        "BudgetYearFour": {
                                            "val": "212.735"
                                        },
                                        "BudgetYearFive": {
                                            "val": "54.066"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "1196.616"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE,SF 07 PE 1203265SF"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "10.777"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.777"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.296"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.598"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.382"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.722"
                                        },
                                        "CostToComplete": {
                                            "val": "61.861"
                                        },
                                        "TotalCost": {
                                            "val": "92.636"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE,SF 05 PE 1203269SF"
                                    },
                                    "Title": {
                                        "val": "GPS III Follow-On"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "263.496"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "263.496"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "267.542"
                                        },
                                        "BudgetYearThree": {
                                            "val": "294.706"
                                        },
                                        "BudgetYearFour": {
                                            "val": "286.279"
                                        },
                                        "BudgetYearFive": {
                                            "val": "177.074"
                                        },
                                        "CostToComplete": {
                                            "val": "1167.479"
                                        },
                                        "TotalCost": {
                                            "val": "2456.576"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE,SF 07 PE 1203913SF"
                                    },
                                    "Title": {
                                        "val": "NUDET Detection System"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "29.157"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "29.157"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "25.456"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.714"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "135.654"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SPSF 01 Line Item GPSIII"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "20.122"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.122"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.302"
                                        },
                                        "BudgetYearThree": {
                                            "val": "19.312"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.868"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.883"
                                        },
                                        "CostToComplete": {
                                            "val": "92.679"
                                        },
                                        "TotalCost": {
                                            "val": "163.309"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SPSF 01 GPS IIIF"
                                    },
                                    "Title": {
                                        "val": "GPS III Follow-On"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "627.796"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "627.796"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "634.821"
                                        },
                                        "BudgetYearThree": {
                                            "val": "640.782"
                                        },
                                        "BudgetYearFour": {
                                            "val": "920.657"
                                        },
                                        "BudgetYearFive": {
                                            "val": "750.853"
                                        },
                                        "CostToComplete": {
                                            "val": "3230.317"
                                        },
                                        "TotalCost": {
                                            "val": "6805.226"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE,AF 07 1203164F"
                                    },
                                    "Title": {
                                        "val": "NAVSTAR Global Positioning System (User Equipment) (Space)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "236.789"
                                        },
                                        "CurrentYear": {
                                            "val": "187.355"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "557.384"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE,AF 07 1203913F"
                                    },
                                    "Title": {
                                        "val": "NUDET Detection System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "21.578"
                                        },
                                        "CurrentYear": {
                                            "val": "49.300"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "70.878"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE,AF 07 1203265F"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "139.180"
                                        },
                                        "CurrentYear": {
                                            "val": "42.440"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "181.620"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE,AF 05 1203269F"
                                    },
                                    "Title": {
                                        "val": "GPS III Follow-On"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "412.202"
                                        },
                                        "CurrentYear": {
                                            "val": "447.875"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "860.077"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "In accordance with a \"back to basics\" acquisition approach and the exercise of strong oversight of development contractors, the Air Force is required to exercise complete ownership of the architecture, system definition, technical baseline, and integration of the GPS space, ground, and user segments. While this complex inter- segment integration is traditionally performed by a prime contractor under a systems development contract, for GPS, this approach requires the government to be the integrator. To execute this responsibility, the government leverages systems engineering and integration expertise from both Federally Funded Research and Development Center (FFRDC) contractors and a Systems Engineering & Integration (SE&I) contractor. The GPS EI function of the SE&I contractor is currently funded within this PE. The SE&I effort was originally procured in 2007 through a full and open competition, as was the new follow-on SE&I contract awarded in 2015. The SE&I follow-on strategy builds in year over year cost reductions as requirements stabilize. In FY 2023, the GPS EI effort will transition from PE 1206423SF to PE 1203269SF."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GPS EI Enterprise SE&I"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TASC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "22.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "22.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "24.246"
                                                    },
                                                    "TotalCost": {
                                                        "val": "46.246"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Technical Mission Analysis 1"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aerospace"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.476"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.476"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "7.560"
                                                    },
                                                    "TotalCost": {
                                                        "val": "18.036"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Technical Mission Analysis 2"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.762"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.762"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "13.870"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.632"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI MRTA\/MSTA"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Draper  Labs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cambridge, MA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.502"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.502"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.607"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.109"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Cybersecurity"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.220"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.220"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "7.835"
                                                    },
                                                    "TotalCost": {
                                                        "val": "15.055"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Additonal Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.193"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.193"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.260"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.453"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GPS EI FFRDC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.165"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.165"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.175"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.340"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.487"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.487"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "4.943"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.430"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Other Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.530"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.530"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.424"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.954"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "GPS III AFL"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "GPS III SV05 Available for Launch"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GPS III SV06 Available for Launch"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GPS III SV07 Available for Launch"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GPS III SV08 Available for Launch"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "IST"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "IST Preparation and Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "IST 3-3\/MGUE Verification Testing (Phase II-IV)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "IST 2-6\/MCEU Verification Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "IST 3-1\/GPS III and OCX Verification Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "IST 3-2\/OCX, GPS III, and MGUE Verification testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "M-Code Early Use"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SMPS Updates (v5B3 and v5C)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Preparation and Support for OCS to OCX transition"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Support OCX Block 1 Ready to Transition to Operations (RTO)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}