{
    "id": "2021-Navy-PB-1319-JBOOK-29075b3c2af92ab5fcca1096cf65ecac9cc771240d227e79d45bc59626cdea42-10",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602651M"
        },
        "ProgramElementTitle": {
            "val": "JT Non-Lethal Wpns Applied Res"
        },
        "R1LineNumber": {
            "val": "11"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "6.137"
            },
            "CurrentYear": {
                "val": "6.346"
            },
            "BudgetYearOne": {
                "val": "6.343"
            },
            "BudgetYearOneBase": {
                "val": "6.343"
            },
            "BudgetYearTwo": {
                "val": "6.468"
            },
            "BudgetYearThree": {
                "val": "6.600"
            },
            "BudgetYearFour": {
                "val": "6.732"
            },
            "BudgetYearFive": {
                "val": "6.866"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The DoD Non-Lethal Weapons (NLW) Program was established by the FY96 National Defense Authorization Act. The Office of the Secretary of Defense designated the Commandant of the Marine Corps (CMC) as the DoD NLW Executive Agent (EA). The EA exercises centralized responsibility for joint research and development of non-lethal weapons and technology through the Joint Non-Lethal Weapons Program (JNLWP). The Office of the Under Secretary of Defense for Acquisition and Sustainment (A&S) serves as the OSD Principal Staff Assistant and oversees, in consultation with the Under Secretary of Defense for Policy, the DoD NLW Executive Agent.\n\nThe efforts described in this Program Element (PE) reflect science and technology (S&T) investment decisions by the Joint Non-Lethal Weapons Integrated Product Team, a multi-service flag level corporate board that provides executive oversight and management for the JNLWP for the CMC. This direction is based on the requirements and capabilities sought by the Services and the Coast Guard, as identified in the DoD's Non-Lethal Weapons Joint Capabilities Based Assessment Document. This coordinated joint S&T development approach addresses mutual capability gaps and assures the most relevant non-lethal technologies, capabilities and equipment are provided to the operating forces while eliminating duplicative service S&T investment. These applied research initiatives feed non-lethal capabilities which directly support the National Defense Strategy (NDS) objective of strategic competition by providing options to the joint force in pursuit of national objectives in legal or policy constrained scenarios, as well as complementing the use of lethal effects in complex combat scenarios, for example, in urban environments with large civilian populations. Ongoing NLW studies, analyses and exercise efforts with NATO and Allies also support NDS objectives to strengthen alliances and partnerships. Resulting capabilities facilitate a fully integrated non-lethal competency as a complement to lethal firepower, providing force application options for below lethal threshold engagements.\n\nThis program funds the applied research, study, assessment, and demonstration of technologies that could provide a non-lethal capability or target effect. Investment areas include applied research related to: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-materiel missions; non-lethal acoustic and optical technologies; advanced non-lethal materials (including materials for vehicle\/vessel stopping and counter-facility applications); associated human effects and effectiveness for new non-lethal stimuli; injury potential and effectiveness of directed energy, electric incapacitation, ocular, and acoustic based non-lethal technologies; and developing models of crowd behavior and dynamics.\n\nThis PE funds Applied Research, which is the systematic study to understand the means to meet a recognized and specific need. Most of the work in this PE can be classified between Technology Readiness Level (TRL) 2 (technology concept and\/or application formulation) and TRL 4 (component and\/or breadboard validation in laboratory environments).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.299"
                },
                "CurrentYear": {
                    "val": "6.346"
                },
                "BudgetYearOne": {
                    "val": "6.343"
                },
                "BudgetYearOneBase": {
                    "val": "6.343"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.137"
                },
                "CurrentYear": {
                    "val": "6.346"
                },
                "BudgetYearOne": {
                    "val": "6.343"
                },
                "BudgetYearOneBase": {
                    "val": "6.343"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.162"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.162"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: no significant change\nTechnical: no significant change\nSchedule: no significant change"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "JT Non-Lethal Wpns Applied Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "6.137"
                        },
                        "CurrentYear": {
                            "val": "6.346"
                        },
                        "BudgetYearOne": {
                            "val": "6.343"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.343"
                        },
                        "BudgetYearTwo": {
                            "val": "6.468"
                        },
                        "BudgetYearThree": {
                            "val": "6.600"
                        },
                        "BudgetYearFour": {
                            "val": "6.732"
                        },
                        "BudgetYearFive": {
                            "val": "6.866"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the applied research, study, assessment, and demonstration of technologies that could provide a non-lethal capability or target effect.  Investment areas include applied research related to: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-materiel missions; non-lethal acoustic and optical technologies; advanced non-lethal materials (including materials for vehicle\/vessel stopping and counter-facility applications); associated human effects and effectiveness for new non-lethal stimuli; injury potential and effectiveness of directed energy, electric stun, ocular, and acoustic based non-lethal technologies; and developing models of crowd behavior and dynamics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "(U) Joint Non-Lethal Weapons"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.137"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.346"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research and investigation of emergent technologies and effects with the potential to address non-lethal counter-personnel and counter-materiel capability gaps.  Some examples of counter-personnel research include optimizing known NLW effectiveness and discovery of new human target behavioral effects which mitigate these Joint Requirements Oversight Counsel-approved joint non-lethal effects capability-gaps.  Other examples are the assessment and study of new NLW technologies related to: (1) increasing the range of current NLWs; (2) increasing their duration of effect; and (3) increasing the volume of fire associated with NLWs.  This includes developing longer range, more compact: (1) NL sound and light devices; (2) smaller, lighter, and more power efficient high power microwave systems; and (3) developing new non-lethal laser induced plasma weapons for long range counter-personnel and counter-materiel applications.  The objective is to further reduce non-lethal directed energy weapon system size, weight, power consumption, thermal cooling requirements and overall system cost while increasing counter-personnel and counter-materiel capabilities.  Continue applied research to characterize new non-lethal phenomena and assess new target human effects and weapon effectiveness, including development of dose response and injury correlates for new NLW technologies.  Continue concept exploration of novel NLW capabilities for integration into future escalation of force platforms.  Transition results to higher levels of technology development and demonstration as feasibility is determined."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.343"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.343"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue research and investigation of intermediate force effects and emergent technologies with the potential to further address the Joint Requirements Oversight Council (JROC)-approved non lethal counter-personnel and counter-materiel capability gaps. Specifically, explore new non-lethal effects and evaluate alternative innovative applications of existing technologies to address future non-lethal capability needs as escalation of force platforms. Some examples of counter-personnel research include further optimization of non-lethal human effects, and enhanced understanding of human target behavioral effects. \n\nConduct applied research to characterize non-lethal phenomena and to assess target human effects and weapon effectiveness, including the development of dose response and injury correlates for new Non-Lethal Weapons (NLW) technologies. Other research includes the assessment and study of new intermediate force technologies related to NLW effectiveness and behavioral response, such as advancing the understanding of Flash Bang effects on humans to support novel non-explosive alternatives to pyrotechnic non-lethal devices. Some examples of counter-materiel research include the investigation of novel intermediate force capabilities for increased delivery and employment options for applications such as vehicle and vessel stopping, and the further optimization of intermediate force materials for integration into future escalation of force platforms. Other research includes feasibility and design studies for high peak power radio frequency directed energy sources and other high power microwave directed energy technologies (e.g., lasers, millimeter-waves) with extended range applications and longer duration of effect. Other examples of counter-materiel research include the investigation and conceptual design of high power microwave technologies to enable improved reduce overall size, weight, power consumption, thermal cooling requirements, and overall system costs (SWaP-C) performance. Results will support the transition of viable technologies to higher levels of development and demonstration to further mitigate the JROC-approved joint non-lethal effects capability-gaps."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}