{
    "id": "2021-AirForce-PB-3600-JBOOK-127ae6e85843ddc6871072af4dec97bbf1550cf5a3bf0eaf2a4d125ea55ea6dc-39",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V2-U_RDTE_JustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "1206730F"
        },
        "ProgramElementTitle": {
            "val": "Space Security and Defense Program"
        },
        "R1LineNumber": {
            "val": "77"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "45.542"
            },
            "CurrentYear": {
                "val": "56.385"
            },
            "BudgetYearOne": {
                "val": "56.311"
            },
            "BudgetYearOneBase": {
                "val": "56.311"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "68.655"
            },
            "BudgetYearThree": {
                "val": "79.558"
            },
            "BudgetYearFour": {
                "val": "80.530"
            },
            "BudgetYearFive": {
                "val": "50.618"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "45.542"
                },
                "CurrentYear": {
                    "val": "56.385"
                },
                "BudgetYearOne": {
                    "val": "56.414"
                },
                "BudgetYearOneBase": {
                    "val": "56.414"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "45.542"
                },
                "CurrentYear": {
                    "val": "56.385"
                },
                "BudgetYearOne": {
                    "val": "56.311"
                },
                "BudgetYearOneBase": {
                    "val": "56.311"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.103"
                },
                "BudgetYearOneBase": {
                    "val": "-0.103"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.103"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.103"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "64A025"
                    },
                    "ProjectTitle": {
                        "val": "Space Protection Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "45.542"
                        },
                        "CurrentYear": {
                            "val": "56.385"
                        },
                        "BudgetYearOne": {
                            "val": "56.311"
                        },
                        "BudgetYearOneBase": {
                            "val": "56.311"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "68.655"
                        },
                        "BudgetYearThree": {
                            "val": "79.558"
                        },
                        "BudgetYearFour": {
                            "val": "80.530"
                        },
                        "BudgetYearFive": {
                            "val": "50.618"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This Program Element funds the Department of Defense (DoD)\/Air Force component of the Space Security and Defense Program (SSDP). The SSDP is a Joint DoD and Office of the Director of National Intelligence (ODNI) organization established to function as the center of excellence for options and strategies (materiel, non- materiel, cross-Title, cross-domain) leading to a more resilient and enduring National Security Space (NSS) Enterprise. The SSDP operates under the authority of the Deputy Secretary of Defense (DEPSECDEF) and Principal Deputy Director of National Intelligence (PDDNI) to lead and collaborate on space protection vulnerability, susceptibility, and mitigation assessments of NSS services for the purpose of identifying, assessing, validating and introducing protection solutions into existing requirements, budgeting, acquisition, technology development and operational development processes. This unique mission provides an ongoing and crucial core protection competency that advances specific projects\/activities (including non-kinetic techniques) to deliver comprehensive, economical and actionable solutions for both programmatic and operational domains.\n\nThe SSDP scope spans multiple space missions and stakeholders including the DoD, Intelligence Community (IC), civil, commercial, and international space entities that support NSS missions in both peacetime and throughout all phases of conflict. It is focused on being responsive to NSS stakeholders in providing technical and operational assessments of emergent threat concepts, and developing near-term and far-term plans to address strategies, threats, and vulnerabilities. Specific SSDP Projects are structured\/designed to have an impact across all time horizons; near-term focused efforts to complicate adversary operations, mid-term focused efforts to improve system and enterprise survivability, and long-term focused efforts to render adversary capabilities ineffective.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver SSDP capability leading to a more resilient and enduring NSS enterprise.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 1206392F and 1206398F.\n\nThis effort is in Budget Activity 4, Advanced Component Development and Prototypes (ACD&P), because efforts are necessary to evaluate integrated technologies, representative modes or prototype systems in a high fidelity and realistic operating environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Protection and Survivability"
                                    },
                                    "Description": {
                                        "val": "SSDP organizes, plans, and executes specific projects in three focus areas: Enterprise Capabilities & Solutions; Mission Area Protection Concepts & Architectures; and Operational Tactics, Experiments & Prototypes. Enterprise Capabilities & Solutions projects focus on identifying and advocating for NSS enterprise-level protection requirements and architecture updates\/modifications, informing\/assisting policy-makers and analyzing policy to enhance the space protection posture across the NSS Enterprise. Mission Area Protection Concepts & Architectures projects constitute Protect and Defend (P&D) efforts focused on specific mission areas and\/or systems. These projects entail the specific technical efforts, activities and engagements supporting capability and architecture development in mission areas such as Space Control, Command and Control (C2), Satellite Communication (SATCOM), Position-Navigation and Timing (PNT), Missile Warning (MW), Space Situational Awareness (SSA), Indications and Warning (I&W), and Intelligence - Surveillance - Reconnaissance (ISR). Finally, Operational Tactics, Experiments & Prototypes projects leverage operations expertise, experimentation and prototyping to improve operational capabilities and develop, refine, document and demonstrate Tactics, Techniques and Procedures (TTPs), Concepts of Operation (CONOPS), and associated C2 functions. Some of these projects hold the potential to leave-behind residual operational prototypes\/capabilities when partnered with the appropriate mission organization. Additionally, these projects will support development of TTPs and CONOPS for protection solutions developed by SSDP partners across the NSS Enterprise.  Projects in all three areas will include non-kinetic solutions for protecting specific capabilities and the NSS Enterprise."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "45.542"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "56.385"
                                            },
                                            "Text": {
                                                "val": "FY2020 projects are designed and proposed in response to emerging, validated adversary threats and the associated mission priorities of the DoD and IC.  While these efforts are responsive to the emerging and changing threat climate, they remain purposeful in furthering the integration of DoD & IC space protection efforts through technical engineering-based analysis, modeling & simulation (M&S), and operator engagement; delivering targeted analysis, policy recommendations, and initiatives across the full spectrum of the program's chartered activities.  Specifically, project prioritization and content was informed by tailored threat characterizations, drawn from IC reporting and internal technical analysis, to account for potential evolutionary threat developments and to ensure the enduring effectiveness of proposed threat mitigation solutions.  The threat characterizations were then decomposed to identify potential vulnerabilities for exploitation by the specific projects ensuring the application of resources against the highest-priority projects and most impactful threat mitigation efforts.  For FY2020 in support of Enterprise Capabilities & Solutions efforts the program will utilize Modeling, Simulation & Analysis (MS&A) tools to:  Rapidly assess outcomes of integrated space and terrestrial scenarios for a variety of architectures to understand how protection options impact the outcome of a multi-domain scenario;  design and execute demonstrations and changes necessary for tactically relevant SSA; integrate lower-cost, non-traditional data sources and determine their value for the protect and defend mission; execute initial work looking at protection scenarios for Proliferated Low Earth Orbit (PLEO) systems; and ensure activities track with National guidance on the proper protection for high profile next-generation, multi-mission, on-orbit experiments.  Additionally, in support of the Mission Area Protection Concepts & Architectures focus area, the program will:  demonstrate the capability to analyze mission specific architectures for their resilience attributes; develop a library of effective responses to adversary actions to speed decision making and improve response results for specific mission systems; and provide resilience recommendations to program offices, and enterprise\/system requirements definition efforts in order to align resilience strategies with acquisition strategies.  Finally, for Operational Tactics, Experiments & Prototypes projects, the program will:  develop force packages for Combatant Commanders providing them a first-of-its-kind ability to employ multiple options across all phases of conflict vs. specific adversary capabilities; leverage existing data-science software integration approaches to enable Operational Level Space C2 Courses of Action (COA) planning and quantitative analysis of COA results; demonstrate how this approach allows for quick prototyping of new tools, easy synchronization of existing tools, and risk reduction prior to transition of prototypes to programs of record; further development of a learning environment to rapidly close C2 technology knowledge gaps, develop a multi-domain C2 prototype\/test environment and identify\/refine C2 performance metrics and standards; and develop Tactics, Techniques and Procedures (TTPs) to take full advantage of planned and programmed future capabilities along with the necessary technical detail to support their integration into Combatant Commander plans (once fielded).  In addition to these and other planned activities, the program will utilize in-depth technical analysis, and tailored M&S to deliver actionable, timely and efficient protection solutions in response to emerging and time-sensitive high-priority DoD & IC space initiatives and evolving NSS Enterprise needs.  Many of these activities will be executed with our mission partners, either in-house or in their facilities, to ensure the best application and use of toolsets, expertise and technology"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "56.311"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "56.311"
                                            },
                                            "Text": {
                                                "val": "FY2021 program activities will focus on in-depth technical analysis utilizing tailored modeling & simulation (M&S) complemented by focused warfighter\/operator engagements in support of both pre-planned and emergent NSS protection analysis, experimentation and prototyping goals.  The program will be responsive to time sensitive and evolving enterprise requirements throughout the year while maintaining momentum on addressing enduring and projected space protect and defense requirements at both the system and enterprise levels.  Specific program projects are selected based on a deep understanding of the threat enabled by the program's extensive ties to the larger NSS and Intelligence Community (IC).  The program will use the IC's foundational assessments, combined with engineering analysis, to craft threat characterizations; capturing both current and evolved\/future capabilities which are tailored to inform SSDP's priorities and associated project activities.  These tailored products will support studies, experiments, and analysis to identify potential opportunities to counter threats across their operational envelopes.  The program will then evaluate the effectiveness of exploiting these opportunities, alone or in layered packages, against the projected threats.  Finally, based on this analysis, the program will initiate in-house, or with a mission partner, projects to exploit and combine these opportunities into a set of layered activities with the intended effect of countering adversary threats.  Specific to FY2021, Enterprise Capabilities & Solutions projects will utilize the program's broad and robust physics-based M&S capabilities, its maturing campaign and enterprise level rapid analysis capabilities, and its experienced cadre of analysts to:  Examine planned DOD and IC programs, experiments and demonstrations to provide protection recommendations to preserve U.S. capabilities; mature analysis capabilities focused on evaluating protection options for PLEO systems, and their impact on the space and multi-domain campaigns; recommend architecture and policy solutions\/changes to optimize the deployment of new capabilities to deliver critical warfighting effects to include the necessary C2; influence policy and guidance across the NSS enterprise while advancing towards more resilient future architectures; and explore early phase reversible protect and defend Electronic Warfare (EW) related capabilities to provide greater flexibility and freedom of maneuver to win the space fight. FY2021 Operational Tactics, Experiments & Prototypes projects will incorporate C2, SSA, and Space Control concepts, planned capabilities and TTPs into relevant\/targeted prototyping and experimentation activities to:  Mature and shape CONOPS for programed\/anticipated systems through rigorous analysis informed by experimentation and prototyping (both in-house and with\/through mission partners); develop force packages for Combatant Commanders providing multiple options across all phases of conflict vs. specific adversary capabilities supported by tools allowing for operational level space C2 Course of Action (COA) planning informed by quantitative analysis of COA results; and incorporate objectives to demonstrate Title 10\/50 space protection coordination, explore data fusion and, potentially, include the integration of commercial tools and services.  The program will accomplish these goals through in-depth technical analysis utilizing in-house high-fidelity M&S tools, physics-based models, selective partnering with national labs, and advanced data studies and experimental data analytics along with other means\/methods as required to deliver actionable, timely and efficient protection solutions.  This deliberate variation in approach allows the program to tailor its efforts to the unique challenges and needs of each project and provide the analytical rigor essential for informing experiment\/prototype selection and design to ensure the highest possible return on investment and mission impact.  The program's FY2021 projects will have the combined impact of continuing to mature and enhance the protection-oriented tools, policies, requirements and programs necessary to maintain and accelerate progress towards achieving resilience across the NSS enterprise.  In the face of an increasingly complex and contested space environment, this capacity and capability is central to national security space protection efforts and is a critical advancement for staying abreast and ahead of both current and next-generation threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "All contracts funded in this program element will be awarded using competitive procedures to the maximum extent possible.  The program consists of numerous small projects."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Space Protection and Survivability"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "40.240"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "50.893"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "50.133"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "50.133"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Support and Infrastructure (Gov't PMA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.738"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.589"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.995"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.995"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Oversight, Advisory and other Technical Support (Contractor PMA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.564"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.903"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.183"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.183"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Space Protection and Survivability"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Enterprise Capabilities Solutions"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Mission Area Protection Concepts and Architectures"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Operational Tactics, Experiments and Prototypes"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}