{
    "id": "2021-Navy-PB-1319-MJBOOK-1-0-744c7ee94c2cc798fbfd935e35baade9caa8a86b67e6f22ecedd75220314848f-27",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603597N"
        },
        "ProgramElementTitle": {
            "val": "Automated Test & Analysis"
        },
        "R1LineNumber": {
            "val": "54"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "60.830"
            },
            "PriorYear": {
                "val": "36.563"
            },
            "CurrentYear": {
                "val": "42.653"
            },
            "BudgetYearOne": {
                "val": "4.797"
            },
            "BudgetYearOneBase": {
                "val": "4.797"
            },
            "BudgetYearTwo": {
                "val": "9.729"
            },
            "BudgetYearThree": {
                "val": "9.299"
            },
            "BudgetYearFour": {
                "val": "8.272"
            },
            "BudgetYearFive": {
                "val": "8.437"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The FY 2021 funding request was reduced by $2.978 million to account for the availability of prior year execution balances.\n\nIn FY 2016, OPNAV N94 implemented a Naval enterprise approach to Automated Test and Analysis (ATA). ATA expands the automated test methods currently in use (Automated Test and Re-Test (ATRT)), adds new methods of testing and use of automated test technologies, and standardizes automated test practices, methods and tools. Examples from FY16 include but are not limited to improvements to Link-16 Non-C2 data collection, essential Mission Planning, Service Oriented Architecture Framework, AEGIS Enterprise Solution Enhancements, Strike Force Interoperability testing and Control System Restoration and Validation. In addition, funding supports the development of enterprise level strategies to apply ATA technologies to software-intensive acquisition programs. The FY 2015 ATRT project was funded on Program Element 0603597N: \"Automated Test and Re-Test\". Starting in FY16 and through the out-years, the project is renamed \"Automated Test and Analysis\" on Program Element 0603597N."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "37.931"
                },
                "CurrentYear": {
                    "val": "7.653"
                },
                "BudgetYearOne": {
                    "val": "7.775"
                },
                "BudgetYearOneBase": {
                    "val": "7.775"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "36.563"
                },
                "CurrentYear": {
                    "val": "42.653"
                },
                "BudgetYearOne": {
                    "val": "4.797"
                },
                "BudgetYearOneBase": {
                    "val": "4.797"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.368"
                },
                "CurrentYear": {
                    "val": "35.000"
                },
                "BudgetYearOne": {
                    "val": "-2.978"
                },
                "BudgetYearOneBase": {
                    "val": "-2.978"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "35.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.368"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.975"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.975"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.003"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY21: Funding reduced by $2.978 million to account for the availability of prior year execution balances."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "16.406"
                        },
                        "PriorYear": {
                            "val": "28.942"
                        },
                        "CurrentYear": {
                            "val": "35.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "80.348"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "In response to CNO initiatives, NAVSEA 05H, under the sponsorship of OPNAV N96, in 2008 began developing tools and executing projects for NAVSEA programs in support of \"Automated Test and Re-Test\". In 2014, CNO\/ASN RDA implemented an \"Enterprise\" approach to automated testing to foster increased automated test tool use and collaboration between Navy SYSCOMs. PE 0603582N Project 9B88, \"Automated Test and Re-Test,\" under OPNAV N96 was modified and moved in FY2016 to \"Automated Test and Analysis\" (ATA) under PE 0603597N under OPNAV N94. ATA expands the automated test methods currently in use (Automated Test and Re-Test (ATRT)), adds new methods of testing and use of automated test technologies, and standardizes automated test practices, methods and tools. In addition, funding supports the development of enterprise level strategies to apply ATA technologies to Navy software-intensive acquisition programs."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase (ATA)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "28.942"
                                        },
                                        "Text": {
                                            "val": "With a Program Increase to Project Unit (PU) C449 of $30M received in FY 2019, ATA was able to provide support for the following efforts:\n\n- Program Management\n- Infrastructure Development\n- Capability Enhancements\n- Tools\/Product Integration\n- Capability Demonstrations\n\nThese efforts supported development of techniques\/tools\/solutions maturing automated test and analysis capabilities supporting NAVY Digital Transformation Initiatives.  These efforts supported development of automatic techniques\/tools\/solutions to achieve NAVSEA Digital Transformation Initiatives to include DevSecOps, Agile software development, C2C24 (Compile to Combat in 24), System of Systems Virtualization, Digital Engineering, MBSE (Model Based System Engineering), AEGIS Virtual Twin, ONR Cloud Development Environment, and Capabilities Based\/Mission Based T&E. \n\n*Program Management efforts established a governance process to manage the projects across the Navy SYSCOMs and provide forums for technical exchanges amongst the projects.  \n*Infrastructure Development efforts established a virtual DevSecOps with automatic testing and analysis tools within a cloud environment for US Navy.\n*Capability Enhancement efforts proved the application of Automated Test and Analysis in several contexts, including Systems of Systems Analysis;  Cybersecurity, and a DevSecOps environment.\n*Tools\/Product Integration efforts proved out providing the Automated Test and Re-Test Tool suite as Application-As-A-Service within a cloud environment\n*Capability Demonstrations proved out the ability to use digital models and integrate in a Live, Virtual, and Constructive allowing Automated Testing and Analysis"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ONR CTE"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "35.000"
                                        },
                                        "Text": {
                                            "val": "Planned efforts will focus on the continued develop of the Automated Test and Analysis Infrastructure within the Cloud and ensuring that processes\/tools\/models are interoperable with other Digital Transformation efforts and products.  This will include adapting tools and processes into a common architecture and framework, demonstrating that interoperability, and finally applying and demonstrating these capabilities within Navy operational environments in systems of systems mission contexts. \n\n*Program Management efforts will provide governance across the Navy, technically manage the efforts, and ensure collaboration across projects and programs. \n*Infrastructure Development efforts will continue development of the virtual DevSecOps within a cloud environment and will add connecting classified nodes in a distributed environment. \n*Capability Enhancement efforts will expand the ability of Automated Test and Analysis tools to be interoperable with other digital transformation tools and products..\n*Tools\/Product Integration efforts proved out providing the Automated Test and Re-Test Tool suite as Application-As-A-Service within a cloud environment\n*Capability Demonstrations will continue efforts to integrate digital models in a Live, Virtual, and Constructive environment but expand to prove interoperability of digital models developed against a common framework.  These capability demonstrations will target systems of systems testing in Navy Mission environments with the goal of providing decision quality design decisions earlier in the development process."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The ATA program solicits automated test tool projects from all qualified sources that show the potential to significantly reduce the time to complete critical testing, increase productivity or system robustness, improve and speed test analysis, and identify commonalities for reuse in testing of Naval acquisition programs. All valid submitted projects will be evaluated for potential funding. Projects selected will typically be funded for one year, in which time they must demonstrate their ability to significantly reduce the time to complete critical testing, improve and speed test analysis, or find and correct critical design flaws in testing of Naval acquisition programs. Successful project artifacts will be advertised and made available across the Naval enterprise for acquisition program consideration, modification, and use."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Transfer of FY19 Automated Test and Analysis (ATA) from NAVSEA to ONR in the amount of $13,642,000 so funding can be directly executed to \nfocus on the development, and edge deployment, of distributed combat system capabilities enabling the CNOs concept for distributed maritime operations. The prototype Cloud-To-Edge (CTE) environment will allow for secure combat system development, automated test and analysis, scalable distributed simulation and a seamless push to afloat, and airborne, edge infrastructure allowing the Navys designated user community to make software updates while maintaining, or eliminating, the need for an Authority to Operate (ATO). The collective infrastructure includes the cloud, software development tools, curation, security management, secure vendor access, cyber security oversight, and the deployed edge infrastructure is called the CTE environment."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Innovative Defense Technologies (IDT)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ballston, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.797"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.285"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "19.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "35.582"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NIWC Pacific"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.383"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.383"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Marine Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not Specified"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.450"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.450"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVAIR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lakehurst NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.095"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.267"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.362"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various NSWCs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.328"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.328"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFLCMC\/AZS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscomb AFB"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.478"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.478"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFIT : Wright-"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "AFB, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.203"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.203"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVSEA HQ"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.265"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.265"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ONR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "13.642"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "18.642"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SYSCOMS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.500"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DELTA Resources, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.155"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.155"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2021PB_0603597N_9999_FILE1.PNG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Proj 9999"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "FY19 Project 1: SoS Virtualization (follow-on to FY18 SOS Virtualization effort):"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY19 Project 2: Aegis Virtual Twin:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY19 Project 3:ONR  Cloud Development Environment:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY20 CTE Program Magt\/ Governance Process\/ Technical Exchanges:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY20 CTE Infrastructure Development:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY20 CTE Capability Enhancements:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY20 CTE Tools\/Product Integration:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY20 CTE Capability Demonstrations:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY20 CTE \/ AEGIS Virtual Twin:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9B88"
                    },
                    "ProjectTitle": {
                        "val": "Automated Test and Analysis"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "44.424"
                        },
                        "PriorYear": {
                            "val": "7.621"
                        },
                        "CurrentYear": {
                            "val": "7.653"
                        },
                        "BudgetYearOne": {
                            "val": "4.797"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.797"
                        },
                        "BudgetYearTwo": {
                            "val": "9.729"
                        },
                        "BudgetYearThree": {
                            "val": "9.299"
                        },
                        "BudgetYearFour": {
                            "val": "8.272"
                        },
                        "BudgetYearFive": {
                            "val": "8.437"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "In FY 2016, OPNAV N94 implemented a Naval enterprise approach to Automated Test and Analysis (ATA). ATA expands the automated test methods currently in use (Automated Test and Re-Test (ATRT)), adds new methods of testing and use of automated test technologies, and standardizes automated test practices, methods and tools. Examples from FY16 include but are not limited to improvements to Link-16 Non-C2 data collection, essential Mission Planning, Service Oriented Architecture Framework, AEGIS Enterprise Solution Enhancements, Strike Force Interoperability testing and Control System Restoration and Validation. In addition, funding supports the development of enterprise level strategies to apply ATA technology to the software-intensive acquisition programs. The FY 2015 ATRT project was funded in Program Element 0603597N under Project Unit 9B88: \"Automated Test and Re-Test\". Starting in FY16 and through the out-years, the project is renamed \"Automated Test and Analysis\" in Program Element 0603597N under Project Unit 9B88."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Automated Test and Analysis"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.621"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.653"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "ATA projects will be selected based on their impact towards achieving the Navy's digital transformation and digital engineering strategy goals. This will continue to improve upon and leverage previous automated test and analysis investments while also pursuing system virtualization projects similar to Aegis Virtual Twin.  Project will reevaluate selected ATA FY 2019 proposals for improving technologies in FY 2020 and potential collaboration in development. FY 2020 plans will also build upon the results and lessons learned from the FY 2018 and FY 2019 selection process for improved ATA program planning, selection, execution and analysis. The Navy intends to continue improvements in the quality of end products, reducing the time to plan, evaluate, analyze and\/or report testing requirements, identify cost avoidance and determine the reduction in total ownership costs for each ATA project. The Navy will also determine enterprise solutions that significantly reduce test and evaluation man-hours, positively impact fleet training, and improve test plans and procedures. \n\nThe Navy will continue: \no Assessing undersea warfare capabilities or fleet modernization and future Navy testing competencies\n o Evaluating best practices and research capabilities for platform network resiliency and system function validation\n o Determining common elements through ATA analysis and reporting across multiple SYSCOMs and identifying synergies in development, implementation and training \no Augmenting both surface and air Mission Planning for requirements traceability. \n\nSpecific topics include but are not limited to:\no Automating Test Framework for Operations Centers or Service Oriented Architectures\n o Continuing advanced Combat System development\/enhancements (SSDS and AEGIS) \no Testing of shipboard navigation or mechanical systems and tactical data links analysis (Link-16)\n o Integrating test and analyses among various Strike Force Interoperability platforms \no Implementing test planning\/manager improvements"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.797"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.797"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "ATA projects will be selected based on their impact towards achieving the Navy's digital transformation and digital engineering strategy goals. This will continue to improve upon and leverage previous automated test and analysis investments while also pursuing system virtualization projects similar to Aegis Virtual Twin.  Project will reevaluate selected ATA FY 2019 proposals for improving technologies in FY 2020 and potential collaboration in development. FY 2020 plans will also build upon the results and lessons learned from the FY 2018 and FY 2019 selection process for improved ATA program planning, selection, execution and analysis. The Navy intends to continue improvements in the quality of end products, reducing the time to plan, evaluate, analyze and\/or report testing requirements, identify cost avoidance and determine the reduction in total ownership costs for each ATA project. The Navy will also determine enterprise solutions that significantly reduce test and evaluation man-hours, positively impact fleet training, and improve test plans and procedures. \nThe Navy will continue: \no Assessing undersea warfare capabilities or fleet modernization and future Navy testing competencies\n o Evaluating best practices and research capabilities for platform network resiliency and system function validation\n o Determining common elements through ATA analysis and reporting across multiple SYSCOMs and identifying synergies in development, implementation and training \no Augmenting both surface and air Mission Planning for requirements traceability. \n\nSpecific topics include but are not limited to:\no Automating Test Framework for Operations Centers or Service Oriented Architectures\n o Continuing advanced Combat System development\/enhancements (SSDS and AEGIS) \no Testing of shipboard navigation or mechanical systems and tactical data links analysis (Link-16)\n o Integrating test and analyses among various Strike Force Interoperability platforms \no Implementing test planning\/manager improvements"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to rate adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The ATA program solicits automated test tool projects from all qualified sources that show the potential to significantly reduce the time to complete critical testing, increase productivity or system robustness, improve and speed test analysis, and identify commonalities for reuse in testing of Naval acquisition programs. All valid submitted projects will be evaluated for potential funding. Projects selected will typically be funded for one year, in which time they must demonstrate their ability to significantly reduce the time to complete critical testing, improve and speed test analysis, or find and correct critical design flaws in testing of Naval acquisition programs. Successful funded projects and artifacts will be advertised and made available across the Naval enterprise for acquisition program consideration, funding, and use."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Innovative Defense Technologies (IDT)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ballston, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "31.989"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.078"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.951"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.434"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.434"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "42.452"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPAWAR Pacific"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.753"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.174"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.070"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.497"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Marine Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not Specified"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.833"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.833"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVAIR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lakehurst NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.669"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.003"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.022"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various NSWCs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "NSWC DD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.845"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.246"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.220"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.230"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.230"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.541"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFIT"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Wright-Patterson AFB, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.500"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.043"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.073"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.040"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.040"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.656"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Automated Test & Analysis"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DELTA Resources, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.835"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.080"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.336"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.243"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.243"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2021PB_0603597N_9B88_FILE1.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2021PB_0603597N_9B88_FILE2.PNG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Proj 9B88"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "FY19 Project 1:ATA Library:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY19 Project 2: Collaborative Software Armory (CSA) Phase II:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY19 Project 3:  Joint-Communications Engineering, Development, and Integration (JEDI) MUOS Automated Call System (JMACS):"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY19 Project 4: Common Data Link:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY19 Project 5: Aegis Virtual Twin:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY19 Project 6: STAT COE:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Annual Startup Projects for ATA Implementation:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY20: Assessing undersea warfare capabilities or fleet modernization and future Navy testing competencies:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY20: Evaluating best practices and research capabilities for platform network resiliency and system function validation:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY20: Assess common architecture analysis and reporting across SYSCOMS and identify  synergies in development, implementation and training:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY20: Augment  both surface and air Mission Planning for requirements traceability:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY21: Assessing undersea warfare capabilities or fleet modernization and future Navy testing competencies:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY21: Evaluating best practices and research capabilities for platform network resiliency and system function validation:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY21: Assess common architecture analysis and reporting across SYSCOMS and identify  synergies in development, implementation and training:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Digital Transformation - Program Magt\/ Governance Process\/ Technical Exchanges:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Digital Transformation- Infrastructure Development:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Digital Transformation - Capability Enhancements:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Digital Transformation - Tools\/Product Integration:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Digital Transformation -  Capability Demonstrations:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}