{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-9035d21372bc28631c31031b85da2fbd962d290bf8d6ca6eecbc49021508de49-95",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0305199D8Z"
        },
        "ProgramElementTitle": {
            "val": "Net Centricity"
        },
        "R1LineNumber": {
            "val": "236"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "91.935"
            },
            "PriorYear": {
                "val": "16.189"
            },
            "CurrentYear": {
                "val": "21.384"
            },
            "BudgetYearOne": {
                "val": "21.793"
            },
            "BudgetYearOneBase": {
                "val": "21.793"
            },
            "BudgetYearTwo": {
                "val": "17.708"
            },
            "BudgetYearThree": {
                "val": "18.484"
            },
            "BudgetYearFour": {
                "val": "20.094"
            },
            "BudgetYearFive": {
                "val": "20.555"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "16.742"
                },
                "CurrentYear": {
                    "val": "21.384"
                },
                "BudgetYearOne": {
                    "val": "20.066"
                },
                "BudgetYearOneBase": {
                    "val": "20.066"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.189"
                },
                "CurrentYear": {
                    "val": "21.384"
                },
                "BudgetYearOne": {
                    "val": "21.793"
                },
                "BudgetYearOneBase": {
                    "val": "21.793"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.553"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.727"
                },
                "BudgetYearOneBase": {
                    "val": "1.727"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.550"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Financing Cancelled Account"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "DWR"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.253"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.253"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.020"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.020"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Increase Level Of Effort"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY19: SIBR\/STTR Reduction -0.550 million.\nFY19: Reprogramming FY19 Financing Cancelled Account Reduction -0.003 million.\nFY21:The FY 2021 funding request was reduced by $2.253 million during DWR to account for a reduction in studies and contract savings resulting in less funds needed.\nFY21: Defense-Wide Economic Assumptions -.020 million.\nFY21: The FY 2021 funding request was increased by $4.00 million, resulting in an increased level of effort."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "199"
                    },
                    "ProjectTitle": {
                        "val": "GIG Evaluation Facilities (GIG-EF) and GIG Enterprise-Wide Systems Engineering Advisory Activities"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "91.935"
                        },
                        "PriorYear": {
                            "val": "16.189"
                        },
                        "CurrentYear": {
                            "val": "21.384"
                        },
                        "BudgetYearOne": {
                            "val": "21.793"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.793"
                        },
                        "BudgetYearTwo": {
                            "val": "17.708"
                        },
                        "BudgetYearThree": {
                            "val": "18.484"
                        },
                        "BudgetYearFour": {
                            "val": "20.094"
                        },
                        "BudgetYearFive": {
                            "val": "20.555"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Funds will be used to provide technical analysis, systems engineering and capability management oversight of programs, projects, initiatives and activities to maximize the Department’s return on investment in information technology resources and affect a comprehensive approach for assessing and procuring critical information systems from initial design, through development to capability delivery in support of improved systems performance and military operations. Emphasis is placed on the information transport, information assurance\/cyber security, network and spectrum management, command and control (C2) applications, systems and services, information sharing capabilities, commercial mobile devices (CMD), applications and infrastructure, and enterprise services activities focused on the development, integration, testing and technical assessment of capabilities and applications in joint and coalition warfighter support environments.  Resources support collaborative efforts to demonstrate the interoperability and performance requirements of command, control, and communications (C3) capabilities and programs.  This program is funded under Budget Activity 7, Operational System Development.\n\n     This project provides the resources necessary to implement net centric processes and authoritative analytic methods that provide the capability to synchronize interdependent C3 capabilities across all layers (ground, air, space, maritime, cyberspace) of the joint information environment (JIE), to forecast and achieve a balance in supply and demand for network capacity, and field effective capabilities more rapidly and efficiently as an enabler for C3 capabilities applications and services.  Resources are required to transform current networks and information infrastructure into an operationally unified and architecturally diverse and secure joint information environment that will provide end-to-end communications transport layer, computing networks, and mission application capabilities that are optimized and integrated with all other joint capability areas with a focus on the tactical edge faced with disconnected, intermittent, and latency (DIL) environments.  There will be technical assessments, modeling and simulation, and analysis of the Joint space communications layer, Joint aerial network layer, contested communications on the move, Position Navigation and Timing (PNT), C2 mission applications, commercial mobile devices, and information sharing capabilities.  These funds provide the capability for the warfighter to manage and deconflict radio frequencies through ground, air, and space communication networks.  The funds will be used to develop and synchronize information assurance and mission assurance capabilities with other joint information environment capabilities to provide secure access to information and services (e.g. Cryptographic Modernization Management plan).\n\n     In addition, funding will continue to be used to support the Defense Information System's Agency's (DISA) and Services' interoperable improvement efforts and processes in the development of common standards and protocols.  This effort includes the Joint Interoperability Enhancement Process (IEP) that allows operators, engineers, and program managers to verify capabilities and identify issues in a design with Joint \/Allied units prior to system fielding, or with fielded systems to identify required systems changes for systems upgrade planning.  DISA and the Joint Forces Combatant Command lead the effort to transform the current standards and interoperability management tools to a common set of Joint network-enabled standards to ensure adherence to the DoD Information Network (DODIN) enterprise-wide technical baseline and for implementation of future Tactical Data Link (TDL) capabilities. These joint standards, protocols, and processes will be used for implementation and testing to ensure the TDL capabilities are synchronized with the development and integration timelines of other planned network-enabled DODIN initiatives.  The threats to the networking waveforms and the Joint NC migration will also be looked at in cooperation with the Intelligence agencies.  In support of the National Defense Strategy (NDS), rebuilding the warfighting readiness of the Joint Force (Lethality); Net Centricity improves strategic and tactical C2 and Communications, CIO is actively supporting the services to accelerate modernization of Command and Control and Communication (C3) systems.  As outlined in the NDS, the return of great power competition elevates the requirement for the Joint Force to dominate a highly contested conflict.  DoD cannot assume the same robust, uninterrupted, tactical-to-strategic command and control network will remain intact against a peer-level adversary.  Rather than existing across a single domain, these new network paths must leverage space, air, land, surface, sub-surface, and cyber to ensure redundancy against attack.  To build confidence in our communication ability in a contested theater, DoD must make targeted investments that increase communication resiliency.  This resilient architecture leverages multiple waveforms carried across space, air, land, surface, sub-surface and cyber minimizes periods that C2 will be degraded when communicating in a highly contested environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Net Centricity Plans and Accomplishments"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.189"
                                            },
                                            "Text": {
                                                "val": "–\tContinue technical assessment\/refine commercial wireless policy guidance to support CMD strategy implementation; continue assessments of the effects of cybersecurity policies.\n–\tContinue to refine CMD certification processes, Mobile Application Management (MAM)\/Mobile Device Management (MDM) guidelines, and guidelines for personal user based enforcement; update approved product matrix for CMD.\n–\tContinue implementation assessments to refine mobile application and device strategies.\n–\tReview\/refine mobile application approval process guides, DoD Mobile PKI guides, and procedure for the Electronic Flight Bag (EFB).\n–\tContinue technical and business case analyses for Commercial mobile devices and voice encryption.\n–\tUpdate the Radio and Communication Security modernization plan for tactical radios.  Assess Service implementation. \n–\tContinue analysis to update the CJTF Architecture to reflect Component C4II capability plans. \n–\tContinue development of interoperable Land Mobile Radio (LMR) standards to support public safety communications.\n–\tContinue analysis to of LMR policy implementation; refine procedures to support LMR implementation in the DoD.\n–\tContinue analysis of Waveform Development and Management in the DoD.  \n–\tContinue analysis to maintain authoritative list of DoD-approved waveforms and supporting repository to maintain waveform baseline.\n–\tContinue technical analysis on methods for securing ISR data over wireless platforms and extended encryption of these devices, conduct implementation assessments through UAS encryption data calls.\n–\tContinue technical analysis and support for Protected, Wideband, Narrowband, and Commercial SATCOM.  Assess strategy alignment.\n–\tUpdate SATCOM Synchronization Architectures for Protected, Wideband, Narrowband and Commercial SATCOM capabilities. \n–\tContinue compliance reviews of select programs; identify shortfalls in program bandwidth supportability planning and analysis and provide recommendations for corrective action.\n–\tContinue efforts to implement SATCOM Gateway Right-sizing approaches to optimize SATCOM gateways across the defense enterprise.  \n–\tContinue technical\/requirements analysis and feasibility assessments for implementing legacy narrowband solutions for MUOS payload.\n–\tContinue analysis to support implementation approaches for JIPM alternatives.\n–\tConduct follow-on analysis in support of the Protected SATCOM AoA recommendations and preferred alternative.\n–\tContinue support for the WCS AOA and follow-on analysis.\n–\tContinue technical analysis to improve DoD utilization of Commercial SATCOM capabilities.\n–\tConduct Airborne ISR (AISR) transport analysis of alternatives follow on analysis based on AoA recommendations and preferred alternatives.  Update AISR transport reference and solution architecture artifacts to support implementation.\n–\tContinue technical analysis of Coalition C2 and MNIS, analyze Coalition C2 functional requirements, strategic policy development and capability strategies to guide Mission Partner Environment (MPE) development.\n–\tContinue technical analysis of selected joint and Service C2 programs\/initiatives to promote enterprise approaches for data and services. \n–\tContinue technical analysis for the implementation of Common Mission Network Transport (CMNT) capability.\n–\tContinue technical analysis of MNIS programs and initiatives, related acquisition strategies, and functional requirements.\n–\tContinue analyses to address adoption and evolution of mission services as candidate enterprise services for the JIE.\n–\tConduct follow-on analysis to inform implementation of the EoA recommendations for the GCCS Family of Systems.\n–\tContinue analysis of capability needs to enable command and control across the JIE.  Evaluate Enterprise Operations Center architectures, and information requirements to support investment decisions in JIE C2 capabilities. \n–\tContinue analysis of requirements, capability gaps and integrated priority lists of all joint requirements for C4II capabilities to support DoD CIO engagement in the C4\/Cyber Functional Capability Board.\n–\tContinue wireless architecture and advanced technologies analysis to inform Department-wide policies and implementation of mobility solutions.\n–\tContinue technical analysis to support compliance oversight of waveform policies and technical profile specifications.\n–\tContinue efforts to refine communications policies and analysis technologies applicable to commercial mobile devices.\n–\tContinue DoD Commercial Mobility implementation and systems engineering analysis Defense Mobile Unclassified and Classified Capabilities (DMUC\/DMCC).\n–\tContinue analysis to support DMUC derived credentials implementation.\n–\tContinue analysis of LTE technology for DoD tactical use.\n–\tContinue technical analysis for Network Management (NM) interoperability, architecture and data artifacts.\n–\tContinue systems engineering and architecture analysis for JIE tactical processing nodes (TPNs).\n–\tContinue analysis to address implementation of TSVSIC for tactical radios.\n–\tContinue efforts to determine strengths, weaknesses, and uses of waveforms and network management capabilities; identified gaps; assesse new technologies in support of waveform and network management efforts.\n–\tContinue technical analysis to support implementation of the network management strategy and roadmap.\n–\tContinue development of data ontologies and NIEM compliant IEPDs for network management.\n–\tContinue technical analysis in support of C4II policies, plans, studies, roadmaps, and capability assessments.\n–\tContinue end-to-end analysis of the SATCOM environment; support technical evaluations of end-to-end capabilities.\n–\tContinue studies and analysis in support of the DoD CIO’s Mobile Device Strategy and Mobile Device Security Efforts.\n–\tContinue Hub-Based HF Communications Concept to provide protected high rate communications needed for long range connectivity in satellite-denied environments\n–\tContinue Wideband SATCOM AoA user demand projections develop planning decks and scenario guidance with Joint Staff\/J6 coordinated scenarios description paper and CAPE concurrence.\n–\tContinue oversight of Positioning, Navigation and Timing efforts and capability development through PNT Oversight Council and associated working groups. \n–\tContinue Space-Based Positioning, Navigation, and Timing (PNT) EXCOM collaboration on path forward to develop formal CPNT system requirements to support U.S. Critical Infrastructure.\n–\tContinue support for Interagency PNT efforts, including outreach, advocacy, and education.\n–\tContinue to lead development efforts of the annual Federal Radionavigation Plan (FRP).\n–\tContinue to provide secretariat support for the PNT Oversight Council, PNT Executive Management Board, and to lead associated PNT and navigation warfare working groups.\n–\tContinue to provide secretariat support to the C5 Leadership Board. \n–\tContinue PNT Trilateral MOA development (DoD, DOT, DHS) efforts.\n–\tContinue precise time dissemination Trilateral MOA (DoD, DoC, DHS) efforts.\n–\tContinue development of the roadmap for fielding Modernized GPS User equipment (MGUE).\n–\tContinue oversight and direction of efforts to develop and field resilient software assurance measures for MGUE.\n–\tContinue support for Multi-GNSS policy development.\n–\tContinue support and leadership role in NATO CaP2 efforts.  \n–\tContinue to support secure voice interoperability and desires to drive planning for UHF anti-jam (SATURN) planning through NATO channels.  \n–\tContinue technical analysis\/studies related to the migration of current applications and services to DoD Core Data Centers and support rationalization of applications for the JIE.\n–\tContinue technical analysis to support implementation of JIE capability upgrades and technical planning.\n–\tContinue studies and analysis to progress of JIE technical implementation actions. \n–\tContinue technical analysis and studies related to SDN as an approach to network normalization and security.\n–\tContinue Joint IEP analysis for Link 16 and work on adding Variable Message Format (VMF), Link 11\/22, Multifunction Advanced Data Link (MADL), and Common Data Link (CDL) through the FYDP.\n–\tContinue technical and policy assessments to enable TDL migration.\n–\tContinue efforts to finalize Joint MIL-SPEC for CDL and initiate documentation for MADL in coordination with JSF team.\n–\tContinue support for Allied and Coalition interoperability efforts including NATO migration plan, JSF partner interoperability, US\/Swedish MIEA, and integration of US and foreign communications and C2 systems.\n–\tAssess developing waveform technologies for improving the robustness and scalability of current TDL networks.\n–\tContinue efforts to refine and implement gateway right sizing options; evaluate RF terminal solutions and baseband equipment suites including the number and types of equipment needed to meet the future needs of the war fighter.  Coordinate and facilitate Teleport Program Office oversight initiatives. \n–\tContinue analysis to evolve SATCOM networks toward EOIP modem architecture.  Continue support of video dissemination and two-way GBS capabilities to inform follow on implementation across the Department.\n–\tContinue analysis for the SATCOM International Standards Committee (SISC).  Participate in the development of US lead Standardized Agreements (STANAGS) and provide a technical review of other nation's STANAG's for accuracy, completeness, and feasibility.  \n–\tContinue efforts to evaluate and implement acquisition strategies for U.S. support to NATO SATCOM post 2019.\n–\tContinue technical analysis and facilitate execution of the SATCOM Systems Engineering Group (SSEG).\n–\tContinue efforts to review, assess, and process DISN Tech Refresh plans for CIO approval.  \n–\tCoordinate, facilitate, and record DISN Quarterly reviews to assessed progress and issues in transport and network infrastructure, unified capabilities and network management.\n–\tContinue efforts to maintain JIE Infrastructure Framework and synchronization roadmap to track  infrastructure deployment or implementation.\n–\tContinue acquisition like review of JIE objectives, plans, technical approaches, schedules and cost factors to support technical reviews of JIE implementation.\n–\tSupport the development of business case activities as required.\nDevelop guidance (e.g., information system security engineering guidance) and programming recommendations to ensure the integration of Trusted Systems Networks concepts and processes into the acquisition and maintenance of DoD information systems, enclaves, and services, including the purchase and integration of tactical communication commodities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.384"
                                            },
                                            "Text": {
                                                "val": "–\tContinue technical assessment\/refine commercial wireless policy guidance to support CMD strategy implementation; continue assessments of the effects of cybersecurity policies.\n–\tContinue to refine CMD certification processes, Mobile Application Management (MAM)\/Mobile Device Management (MDM) guidelines, and guidelines for personal user based enforcement; update approved product matrix for CMD.\n–\tContinue implementation assessments to refine mobile application and device strategies.\n–\tReview\/refine mobile application approval process guides, DoD Mobile PKI guides, and procedure for the Electronic Flight Bag (EFB).\n–\tContinue technical and business case analyses for Commercial mobile devices and voice encryption.\n–\tUpdate the Radio and Communication Security modernization plan for tactical radios.  Assess Service implementation. \n–\tContinue analysis to update the CJTF Architecture to reflect Component C4II capability plans. \n–\tContinue development of interoperable Land Mobile Radio (LMR) standards to support public safety communications.\n–\tContinue analysis to of LMR policy implementation; refine procedures to support LMR implementation in the DoD.\n–\tContinue analysis of Waveform Development and Management in the DoD.  \n–\tContinue analysis to maintain authoritative list of DoD-approved waveforms and supporting repository to maintain waveform baseline.\n–\tContinue technical analysis on methods for securing ISR data over wireless platforms and extended encryption of these devices, conduct implementation assessments through UAS encryption data calls.\n–\tContinue technical analysis and support for Protected, Wideband, Narrowband, and Commercial SATCOM.  Assess strategy alignment.\n–\tUpdate SATCOM Synchronization Architectures for Protected, Wideband, Narrowband and Commercial SATCOM capabilities. \n–\tContinue compliance reviews of select programs; identify shortfalls in program bandwidth supportability planning and analysis and provide recommendations for corrective action.\n–\tContinue efforts to implement SATCOM Gateway Right-sizing approaches to optimize SATCOM gateways across the defense enterprise.  \n–\tContinue technical\/requirements analysis and feasibility assessments for implementing legacy narrowband solutions for MUOS payload.\n–\tContinue analysis to support implementation approaches for JIPM alternatives.\n–\tConduct follow-on analysis in support of the Protected SATCOM AoA recommendations and preferred alternative.\n–\tContinue support for the WCS AOA and follow-on analysis.\n–\tContinue technical analysis to improve DoD utilization of Commercial SATCOM capabilities.\n–\tConduct Airborne ISR (AISR) transport analysis of alternatives follow on analysis based on AoA recommendations and preferred alternatives.  Update AISR transport reference and solution architecture artifacts to support implementation.\n–\tContinue technical analysis of Coalition C2 and MNIS, analyze Coalition C2 functional requirements, strategic policy development and capability strategies to guide Mission Partner Environment (MPE) development.\n–\tContinue technical analysis of selected joint and Service C2 programs\/initiatives to promote enterprise approaches for data and services. \n–\tContinue technical analysis for the implementation of Common Mission Network Transport (CMNT) capability.\n–\tContinue technical analysis of MNIS programs and initiatives, related acquisition strategies, and functional requirements.\n–\tContinue analyses to address adoption and evolution of mission services as candidate enterprise services for the JIE.\n–\tConduct follow-on analysis to inform implementation of the EoA recommendations for the GCCS Family of Systems.\n–\tContinue analysis of capability needs to enable command and control across the JIE.  Evaluate Enterprise Operations Center architectures, and information requirements to support investment decisions in JIE C2 capabilities. \n–\tContinue analysis of requirements, capability gaps and integrated priority lists of all joint requirements for C3 capabilities to support DoD CIO engagement in the C4\/Cyber Functional Capability Board.\n–\tContinue wireless architecture and advanced technologies analysis to inform Department-wide policies and implementation of mobility solutions.\n–\tContinue technical analysis to support compliance oversight of waveform policies and technical profile specifications.\n–\tContinue efforts to refine communications policies and analysis technologies applicable to commercial mobile devices.\n–\tContinue DoD Commercial Mobility implementation and systems engineering analysis Defense Mobile Unclassified and Classified Capabilities (DMUC\/DMCC).\n–\tContinue analysis to support DMUC derived credentials implementation.\n–\tContinue analysis of 5G technology for DoD tactical use.\n–\tDevelop 5G standards engagement plan.\n–\tContinue technical analysis for Network Management (NM) interoperability, architecture and data artifacts.\n–\tContinue systems engineering and architecture analysis for JIE tactical processing nodes (TPNs).\n–\tContinue analysis to address implementation of TSVSIC for tactical radios.\n–\tContinue efforts to determine strengths, weaknesses, and uses of waveforms and network management capabilities; identified gaps; assesse new technologies in support of waveform and network management efforts.\n–\tContinue technical analysis to support implementation of the network management strategy and roadmap.\n–\tContinue development of data ontologies and NIEM compliant IEPDs for network management.\n–\tContinue technical analysis in support of C3 policies, plans, studies, roadmaps, and capability assessments.\n–\tContinue end-to-end analysis of the SATCOM environment; support technical evaluations of end-to-end capabilities.\n–\tContinue studies and analysis in support of the DoD CIO’s Mobile Device Strategy and Mobile Device Security Efforts.\n–\tContinue Hub-Based HF Communications Concept to provide protected high rate communications needed for long range connectivity in satellite-denied environments\n–\tContinue Wideband SATCOM AoA user demand projections develop planning decks and scenario guidance with Joint Staff\/J6 coordinated scenarios description paper and CAPE concurrence.\n–\tContinue oversight of Positioning, Navigation and Timing efforts and capability development through PNT Oversight Council and associated working groups. \n–\tContinue Space-Based Positioning, Navigation, and Timing (PNT) EXCOM collaboration on path forward to develop formal CPNT system requirements to support U.S. Critical Infrastructure.\n–\tContinue support for Interagency PNT efforts, including outreach, advocacy, and education.\n–\tContinue to lead development efforts of the annual Federal Radionavigation Plan (FRP).\n–\tContinue to provide secretariat support for the PNT Oversight Council, PNT Executive Management Board, and to lead associated PNT and navigation warfare working groups.\n–\tContinue to provide secretariat support to the C5 Leadership Board. \n–\tContinue PNT Trilateral MOA development (DoD, DOT, DHS) efforts.\n–\tContinue precise time dissemination Trilateral MOA (DoD, DoC, DHS) efforts.\n–\tContinue development of the roadmap for fielding Modernized GPS User equipment (MGUE).\n–\tContinue oversight and direction of efforts to develop and field resilient software assurance measures for MGUE.\n–\tContinue support for Multi-GNSS policy development.\n–\tContinue support and leadership role in NATO CaP2 efforts.  \n–\tContinue to support secure voice interoperability and desires to drive planning for UHF anti-jam (SATURN) planning through NATO channels.  \n–\tContinue technical analysis\/studies related to the migration of current applications and services to DoD Core Data Centers and support rationalization of applications for the JIE.\n–\tContinue technical analysis to support implementation of JIE capability upgrades and technical planning.\n–\tContinue studies and analysis to progress of JIE technical implementation actions. \n–\tContinue technical analysis and studies related to SDN as an approach to network normalization and security.\n–\tContinue Joint IEP analysis for Link 16 and work on adding Variable Message Format (VMF), Link 11\/22, Multifunction Advanced Data Link (MADL), and Common Data Link (CDL) through the FYDP.\n–\tContinue technical and policy assessments to enable TDL migration.\n–\tContinue efforts to finalize Joint MIL-SPEC for CDL and initiate documentation for MADL in coordination with JSF team.\n–\tContinue support for Allied and Coalition interoperability efforts including NATO migration plan, JSF partner interoperability, US\/Swedish MIEA, and integration of US and foreign communications and C2 systems.\n–\tAssess developing waveform technologies for improving the robustness and scalability of current TDL networks.\n–\tContinue efforts to refine and implement gateway right sizing options; evaluate RF terminal solutions and baseband equipment suites including the number and types of equipment needed to meet the future needs of the war fighter.  Coordinate and facilitate Teleport Program Office oversight initiatives. \n–\tContinue analysis to evolve SATCOM networks toward EOIP modem architecture.  Continue support of video dissemination and two-way GBS capabilities to inform follow on implementation across the Department.\n–\tContinue analysis for the SATCOM International Standards Committee (SISC).  Participate in the development of US lead Standardized Agreements (STANAGS) and provide a technical review of other nation's STANAG's for accuracy, completeness, and feasibility.  \n–\tContinue efforts to evaluate and implement acquisition strategies for U.S. support to NATO SATCOM.\n–\tContinue technical analysis and facilitate execution of the SATCOM Systems Engineering Group (SSEG).\n–\tContinue efforts to review, assess, and process DISN Tech Refresh plans for CIO approval.  \n–\tCoordinate, facilitate, and record DISN Quarterly reviews to assessed progress and issues in transport and network infrastructure, unified capabilities and network management.\n–\tContinue efforts to maintain JIE Infrastructure Framework and synchronization roadmap to track infrastructure deployment or implementation.\n–\tContinue acquisition like review of JIE objectives, plans, technical approaches, schedules and cost factors to support technical reviews of JIE implementation.\n–\tSupport the development of business case activities as required.\nDevelop guidance (e.g., information system security engineering guidance) and programming recommendations to ensure the integration of Trusted Systems Networks concepts and processes into the acquisition and maintenance of DoD information systems, enclaves, and services, including the purchase and integration of tactical communication commodities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.793"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.793"
                                            },
                                            "Text": {
                                                "val": "–\tContinue technical assessment\/refine commercial wireless policy guidance to support CMD strategy implementation; continue assessments of the effects of cybersecurity policies.\n–\tContinue to refine CMD certification processes, Mobile Application Management (MAM)\/Mobile Device Management (MDM) guidelines, and guidelines for personal user based enforcement; update approved product matrix for CMD.\n–\tContinue implementation assessments to refine mobile application and device strategies.\n–\tReview\/refine mobile application approval process guides, DoD Mobile PKI guides, and procedure for the Electronic Flight Bag (EFB).\n–\tDevelopment of an analytical model that facilitates rapid, safe, and operationally adequate access to the 1030\/1090MHz spectrum.\n–\tContinue technical and business case analyses for Commercial mobile devices and voice encryption.\n–\tUpdate the Radio and Communication Security modernization plan for tactical radios.  Assess Service implementation. \n–\tContinue analysis to update the CJTF Architecture to reflect Component C4II capability plans. \n–\tContinue development of interoperable Land Mobile Radio (LMR) standards to support public safety communications.\n–\tContinue analysis to of LMR policy implementation; refine procedures to support LMR implementation in the DoD.\n–\tContinue analysis of Waveform Development and Management in the DoD.  \n–\tContinue analysis to maintain authoritative list of DoD-approved waveforms and supporting repository to maintain waveform baseline.\n–\tContinue technical analysis on methods for securing ISR data over wireless platforms and extended encryption of these devices, conduct implementation assessments through UAS encryption data calls.\n–\tContinue technical analysis and support for Protected, Wideband, Narrowband, and Commercial SATCOM.  Assess strategy alignment.\n–\tUpdate SATCOM Synchronization Architectures for Protected, Wideband, Narrowband and Commercial SATCOM capabilities. \n–\tContinue compliance reviews of select programs; identify shortfalls in program bandwidth supportability planning and analysis and provide recommendations for corrective action.\n–\tContinue efforts to implement SATCOM Gateway Right-sizing approaches to optimize SATCOM gateways across the defense enterprise.  \n–\tContinue technical\/requirements analysis and feasibility assessments for implementing legacy narrowband solutions for MUOS payload.\n–\tContinue analysis to support implementation approaches for JIPM alternatives.\n–\tConduct follow-on analysis in support of the Protected SATCOM AoA recommendations and preferred alternative.\n–\tContinue support for the WCS AOA and follow-on analysis.\n–\tContinue technical analysis to improve DoD utilization of Commercial SATCOM capabilities.\n–\tConduct Airborne ISR (AISR) transport analysis of alternatives follow on analysis based on AoA recommendations and preferred alternatives.  Update AISR transport reference and solution architecture artifacts to support implementation.\n–\tContinue technical analysis of Coalition C2 and MNIS, analyze Coalition C2 functional requirements, strategic policy development and capability strategies to guide Mission Partner Environment (MPE) development.\n–\tContinue technical analysis of selected joint and Service C2 programs\/initiatives to promote enterprise approaches for data and services. \n–\tContinue technical analysis for the implementation of Common Mission Network Transport (CMNT) capability.\n–\tContinue technical analysis of MNIS programs and initiatives, related acquisition strategies, and functional requirements.\n–\tContinue analyses to address adoption and evolution of mission services as candidate enterprise services for the JIE.\n–\tConduct follow-on analysis to inform implementation of the EoA recommendations for the GCCS Family of Systems.\n–\tContinue analysis of capability needs to enable command and control across the JIE.  Evaluate Enterprise Operations Center architectures, and information requirements to support investment decisions in JIE C2 capabilities. \n–\tContinue analysis of requirements, capability gaps and integrated priority lists of all joint requirements for C3 capabilities to support DoD CIO engagement in the C4\/Cyber Functional Capability Board.\n–\tContinue wireless architecture and advanced technologies analysis to inform Department-wide policies and implementation of mobility solutions.\n–\tContinue technical analysis to support compliance oversight of waveform policies and technical profile specifications.\n–\tContinue efforts to refine communications policies and analysis technologies applicable to commercial mobile devices.\n–\tContinue DoD Commercial Mobility implementation and systems engineering analysis Defense Mobile Unclassified and Classified Capabilities (DMUC\/DMCC).\n–\tContinue analysis to support DMUC derived credentials implementation.\n–\tContinue analysis of 5G technology for DoD tactical use.\n–\tDevelop 5G standards engagement plan.\n–\tContinue technical analysis for Network Management (NM) interoperability, architecture and data artifacts.\n–\tContinue systems engineering and architecture analysis for JIE tactical processing nodes (TPNs).\n–\tContinue analysis to address implementation of TSVSIC for tactical radios.\n–\tContinue efforts to determine strengths, weaknesses, and uses of waveforms and network management capabilities; identified gaps; assesse new technologies in support of waveform and network management efforts.\n–\tContinue technical analysis to support implementation of the network management strategy and roadmap.\n–\tContinue development of data ontologies and NIEM compliant IEPDs for network management.\n–\tContinue technical analysis in support of C3 policies, plans, studies, roadmaps, and capability assessments.\n–\tContinue end-to-end analysis of the SATCOM environment; support technical evaluations of end-to-end capabilities.\n–\tContinue studies and analysis in support of the DoD CIO’s Mobile Device Strategy and Mobile Device Security Efforts.\n–\tContinue Hub-Based HF Communications Concept to provide protected high rate communications needed for long range connectivity in satellite-denied environments\n–\tContinue Wideband SATCOM AoA user demand projections develop planning decks and scenario guidance with Joint Staff\/J6 coordinated scenarios description paper and CAPE concurrence.\n–\tContinue oversight of Positioning, Navigation and Timing efforts and capability development through PNT Oversight Council and associated working groups. \n–\tContinue Space-Based Positioning, Navigation, and Timing (PNT) EXCOM collaboration on path forward to develop formal CPNT system requirements to support U.S. Critical Infrastructure.\n–\tContinue support for Interagency PNT efforts, including outreach, advocacy, and education.\n–\tContinue to lead development efforts of the annual Federal Radionavigation Plan (FRP).\n–\tContinue to provide secretariat support for the PNT Oversight Council, PNT Executive Management Board, and to lead associated PNT and navigation warfare working groups.\n–\tContinue to provide secretariat support to the C5 Leadership Board. \n–\tContinue PNT Trilateral MOA development (DoD, DOT, DHS) efforts.\n–\tContinue precise time dissemination Trilateral MOA (DoD, DoC, DHS) efforts.\n–\tContinue development of the roadmap for fielding Modernized GPS User equipment (MGUE).\n–\tContinue oversight and direction of efforts to develop and field resilient software assurance measures for MGUE.\n–\tContinue support for Multi-GNSS policy development.\n–\tContinue support and leadership role in NATO CaP2 efforts.  \n–\tContinue to support secure voice interoperability and desires to drive planning for UHF anti-jam (SATURN) planning through NATO channels.  \n–\tContinue technical analysis\/studies related to the migration of current applications and services to DoD Core Data Centers and support rationalization of applications for the JIE.\n–\tContinue technical analysis to support implementation of JIE capability upgrades and technical planning.\n–\tContinue studies and analysis to progress of JIE technical implementation actions. \n–\tContinue technical analysis and studies related to SDN as an approach to network normalization and security.\n–\tContinue Joint IEP analysis for Link 16 and work on adding Variable Message Format (VMF), Link 11\/22, Multifunction Advanced Data Link (MADL), and Common Data Link (CDL) through the FYDP.\n–\tContinue technical and policy assessments to enable TDL migration.\n–\tContinue efforts to finalize Joint MIL-SPEC for CDL and initiate documentation for MADL in coordination with JSF team.\n–\tContinue support for Allied and Coalition interoperability efforts including NATO migration plan, JSF partner interoperability, US\/Swedish MIEA, and integration of US and foreign communications and C2 systems.\n–\tAssess developing waveform technologies for improving the robustness and scalability of current TDL networks.\n–\tContinue efforts to refine and implement gateway right sizing options; evaluate RF terminal solutions and baseband equipment suites including the number and types of equipment needed to meet the future needs of the war fighter.  Coordinate and facilitate Teleport Program Office oversight initiatives. \n–\tContinue analysis to evolve SATCOM networks toward EOIP modem architecture.  Continue support of video dissemination and two-way GBS capabilities to inform follow on implementation across the Department.\n–\tContinue analysis for the SATCOM International Standards Committee (SISC).  Participate in the development of US lead Standardized Agreements (STANAGS) and provide a technical review of other nation's STANAG's for accuracy, completeness, and feasibility.  \n–\tContinue efforts to evaluate and implement acquisition strategies for U.S. support to NATO SATCOM.\n–\tContinue technical analysis and facilitate execution of the SATCOM Systems Engineering Group (SSEG).\n–\tContinue efforts to review, assess, and process DISN Tech Refresh plans for CIO approval.  \n–\tCoordinate, facilitate, and record DISN Quarterly reviews to assessed progress and issues in transport and network infrastructure, unified capabilities and network management.\n–\tContinue efforts to maintain JIE Infrastructure Framework and synchronization roadmap to track infrastructure deployment or implementation.\n–\tContinue acquisition like review of JIE objectives, plans, technical approaches, schedules and cost factors to support technical reviews of JIE implementation.\n–\tSupport the development of business case activities as required.\nDevelop guidance (e.g., information system security engineering guidance) and programming recommendations to ensure the integration of Trusted Systems Networks concepts and processes into the acquisition and maintenance of DoD information systems, enclaves, and services, including the purchase and integration of tactical communication commodities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding was re-phased due to a prior year reduction."
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Studies and Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "12.042"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.562"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.130"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.747"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.747"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technical Engineering Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "49.295"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.414"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.677"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.679"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.480"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.480"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.592"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.097"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.098"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.066"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.066"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.653"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.825"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.811"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "R&D Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.676"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.291"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.666"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "0305199D8Z_R4.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "*** SUBPROJECT TITLE ***"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "FY 2021 Projected Execution"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY 2022 Projected Execution"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY 2023 Projected Execution"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY 2024 Projected Execution"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FY 2025 Projected Execution"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}