{
    "id": "2021-AirForce-PB-3600-MJBOOK-1-0-4ccc939241b47239c36ee98d5519ce37a7e18b46d494a025321d2035cb3d38d7-94",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604759F"
        },
        "ProgramElementTitle": {
            "val": "Major T&E Investment"
        },
        "R1LineNumber": {
            "val": "132"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "213.273"
            },
            "CurrentYear": {
                "val": "106.663"
            },
            "BudgetYearOne": {
                "val": "208.680"
            },
            "BudgetYearOneBase": {
                "val": "208.680"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "207.845"
            },
            "BudgetYearThree": {
                "val": "152.044"
            },
            "BudgetYearFour": {
                "val": "159.017"
            },
            "BudgetYearFive": {
                "val": "155.705"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "216.844"
                },
                "CurrentYear": {
                    "val": "181.663"
                },
                "BudgetYearOne": {
                    "val": "164.005"
                },
                "BudgetYearOneBase": {
                    "val": "164.005"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "213.273"
                },
                "CurrentYear": {
                    "val": "106.663"
                },
                "BudgetYearOne": {
                    "val": "208.680"
                },
                "BudgetYearOneBase": {
                    "val": "208.680"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.571"
                },
                "CurrentYear": {
                    "val": "-75.000"
                },
                "BudgetYearOne": {
                    "val": "44.675"
                },
                "BudgetYearOneBase": {
                    "val": "44.675"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "36.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-111.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.571"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "44.675"
                                },
                                "BudgetYearOneBase": {
                                    "val": "44.675"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY19:  Approximate $3.6 million decrease due to SBIR taxes.\nFY20:  $75 million decrease:  $111 million representing the JSE Edwards ($43 million), JSE Nellis ($30 million), and the Eglin Cyberspace facility ($38M) DoD Lab Pilot Program construction projects transferred from Major T&E Investment, PE 0604759F, to the MILCON appropriation for execution.  $36 million add for Space Threat Test Infrastructure.\nFY21:  Approximate $45 million increase is a result of AF investment in space threat test infrastructure."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "664597"
                    },
                    "ProjectTitle": {
                        "val": "AF Test Investments"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "213.273"
                        },
                        "CurrentYear": {
                            "val": "106.663"
                        },
                        "BudgetYearOne": {
                            "val": "208.680"
                        },
                        "BudgetYearOneBase": {
                            "val": "208.680"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "207.845"
                        },
                        "BudgetYearThree": {
                            "val": "152.044"
                        },
                        "BudgetYearFour": {
                            "val": "159.017"
                        },
                        "BudgetYearFive": {
                            "val": "155.705"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This PE provides planning, improvements, and modernization for test capabilities within Air Force Test Center (AFTC) Major Range and Test Facility Base organizations:  96 Test Wing at Eglin AFB FL, the 412 Test Wing at Edwards AFB CA, and Arnold Engineering Development Complex (AEDC) at Arnold AFB TN. The 704th Test Group at Holloman AFB NM and the McKinley Climatic Lab at Eglin AFB are aligned under AEDC as part of the management consolidation of Ground test capabilities. Finally, this PE also provides funds to Air Force Space Command (AFSPC) and the AFSPC Space Warfighting Combined Test Force (CTF) at Peterson AFB, CO to establish, maintain, and equip a Space Range capability for Test and Evaluation of space weapon systems.\n\nThe improvement and modernization (I&M) requirements are defined through the AF Test Investment Planning & Programming (TIPP) Process. All projects have been reviewed through the Tri-Service Reliance Process (to communicate AF efforts to the other services and avoid unwarranted duplication of effort) and are documented in the Technology Development Acquisition Program (TDAP) database.  Each project has its own planning, development, equipment acquisition, equipment installation, and checkout phases which often require significant differences in funding from one year to the next.  As such, the changes in category funding from year to year does not necessarily indicate program growth, but rather a planned phasing of I&M efforts.  The test capabilities at these locations enable testing through all phases of weapon system acquisition, from system concept exploration through component and full-scale integrated weapon system test to operational test.\n\nThe 96 TW, at Eglin AFB FL, conducts and supports Developmental Test and Evaluation (DT&E) of non-nuclear air armaments; Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR) systems; target acquisition and weapon delivery systems; determines target\/test item spectral signatures; and provides cyber testing capabilities as part of the Avionics Cyber Range (ACR).\n\nThe 412th Test Wing, at Edwards AFB CA, conducts and supports DT&E and Operational Test and Evaluation (OT&E) of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery\/systems, and cargo handling systems.\n\nAEDC, at Arnold AFB TN, provides pre-flight reliability environmental test support for DoD aeropropulsion, flight systems, and space and missile programs.  The center has 53 test facilities providing:  aerodynamic testing of scale model aircraft, missiles, and space systems; testing of large and full-scale satellites, sensors, and space vehicles in a simulated space environment; altitude environmental testing for aircraft, missile, and spacecraft propulsion systems; testing of large-scale models such as space boosters together with their propulsion systems.  This capability includes the world's largest climatic laboratory, the McKinley Climatic Laboratory at Eglin AFB, which provides controlled all-weather condition testing of full scale systems.  The 704th TG at Holloman AFB, NM provides flight test and test support for joint, international and commercial customers in advanced avionics and weapons, inertial navigation systems, Global Positioning System (GPS) and other integrated aircraft and missile navigation systems.  They test subsonic through hypersonic ground performance of aircraft and missiles in a flight-representative, highly instrumented environment while also coordinating and scheduling all US Air Force test operations at White Sands Missile Range. The 704th TG OL-AC at Wright-Patterson AFB, OH provides independent developmental T&E in support of aircraft survivability and evaluation of full-scale aircraft landing gear, tires and brakes. They also provide an independent capability for component qualification.\n\nIn order to align the strategic capability goals set forth in the 2018 National Defense Strategy and the mission of the AFTC, program element funding has been assigned to these six mission area categories: T&E Range Asset Modernization, Hypersonics, Directed Energy, Cyberspace and Avionics Cyber, Autonomy, and Space Test Infrastructure.\n\n1) T&E Range and Test Asset Modernization refers to those capabilities required to acquire the ability to test long range, high-speed, highly-instrumented, high-data rate weapons in a crowded and restricted spectrum, while operating at multiple classification and cybersecurity levels.  Also included in this mission area is the ability to collect, analyze and store big data and the ability to do multi-domain testing across the enterprise with realistic threat scenarios at multiple classification level up to Special Access Program (SAP).\n\n2) Hypersonics refers to the ability to test and evaluate flight-representative hypersonic engines, materials, warheads and fuzes in all portions of the employment envelope and conduct flight testing both in simulation and open-air ranges with sufficient space, telemetry, photo-optics and Time Space Position Information (TSPI) to appropriately inform decision-makers fielding such systems.\n\n3) Directed Energy\/Electronic Combat acquires the ability to characterize irradiance and beam properties on aircraft, small UAVs and ground targets and create realistic environments to simulate adversary air defense capabilities in the year 2030.  Enables 5th-6th generation weapon testing\/tactics development in a threat-realistic Anti-Access Area Denial (A2AD) environment using a combination of indoor and open-air ranges.\n\n4) Cyberspace and Avionics Cyber is the advancement of cybersecurity\/resiliency test capability for network, C4ISR, and airborne weapon platforms and includes development of tools, techniques and hardware-in-the-loop capabilities focused on cybersecurity and cyber-resiliency.\n\n5) Autonomy refers to the ability to test autonomous aerial and ground systems with hundreds of independent vehicles.  Must be able to monitor system-under-test locations and states with the ability for soft and hard termination.  Must develop techniques and processes to test systems with artificial intelligence.\n\n6) Space Test Infrastructure refers to the development of a Space Combined Test Force and the development of technical capabilities, both terrestrial and space-based assets, in order to deploy an initial level of ability to test and evaluate the capability and resilience of DoD Space systems in a contested environment.\n\nThis program is in Budget Activity 6, RDT&E Management Support because this budget activity includes research, development, test and evaluation efforts and funds to sustain and\/or modernize the installations or operations required for general research, development, test and evaluation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "T&E Range and Test Asset Modernization"
                                    },
                                    "Description": {
                                        "val": "Description: T&E Range and Test Asset Modernization refers to those capabilities required to acquire the ability to test long range, high-speed, highly-instrumented, high-data rate weapons in a crowded and restricted spectrum, while operating at multiple classification and cybersecurity levels.  Ability to collect, analyze and store big data and ability to do multi-domain testing across the enterprise with realistic threat scenarios at multiple classification level up to Special Access Program (SAP)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "104.030"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "35.863"
                                            },
                                            "Text": {
                                                "val": "Continue planning and\/or executing of the following programs:  CRIIS Production, Network Telemetry Integration Program (NTIP) (formerly iSIS), Common Airborne Network Instrumentation System (CANIS), Modular Mission Control Room Upgrade (MMCRU), Voice Communication System Upgrade (VCSU), Improved C2 Test Operations Center (I - C2TOC), Airborne Sensor Data Correlation Project (ASDC), Improved Data Link (IDL) Hardware-in-the-loop systems (HITLS) - Gen 4 & 5, Next Generation Turbine Engine Test Capability (NGTETC), Improve Plant Reliability and Efficiency\/Transonic Aero Test Capability (IMTPC), Improve Large Model Supersonic Aerodynamic Ground T&E Capability (ILMSC) [formerly Tunnel 16S Reactivation], Advanced Engine Requirements for Power and Thermal Loads, High-speed Small Engine Test Capability (HSETC) (previously ASMEC-II), and the Gulf Range Enhancement (GRE) project."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "63.724"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "63.724"
                                            },
                                            "Text": {
                                                "val": "Continue planning and\/or executing of the following programs:  CRIIS Production, Network Telemetry Integration Program (NTIP) (formerly iSIS), Common Airborne Network Instrumentation System (CANIS), Modular Mission Control Room Upgrade (MMCRU), Voice Communication System Upgrade (VCSU), Improved C2 Test Operations Center (I - C2TOC), Airborne Sensor Data Correlation Project (ASDC), Improved Data Link HITLS - Gen 4 & 5, Multi-Level Security - Joint Collaborative Environment (MLS - JCE), Next Generation Turbine Engine Test Capability (NGTETC), Improve Plant Reliability and Efficiency\/Transonic Aero Test Capability (IMTPC), Improve Large Model Supersonic Aerodynamic Ground T&E Capability (ILMSC) [formerly Tunnel 16S Reactivation], Advanced Engine Requirements for Power and Thermal Loads, High-speed Small Engine Test Capability (HSETC) (previously ASMEC-II), High Pressure Air Additional Capacity (HPAAC), and the Gulf Range Enhancement (GRE) project."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase is associated with major equipment procurements planned for FY21 for NTIP, CANIS, MMCRU, VCSU, IMTPC, HPAAC and GRE."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hypersonics"
                                    },
                                    "Description": {
                                        "val": "Hypersonics refers to the ability to T&E flight-representative hypersonic engines, materials, warheads and fuzes in all portions of the employment envelope and conduct flight testing both in simulation and open-air ranges with sufficient space, telemetry, photo-optics and Time Space Position Information (TSPI) to appropriately inform decision-makers fielding such systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.400"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Planning and\/or executing of the Imaging Improvement and Modernization Program (I2MP)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.338"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.338"
                                            },
                                            "Text": {
                                                "val": "Continue planning and\/or executing of the Imaging Improvement and Modernization Program (I2MP)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Not applicable."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy\/Electronic Combat"
                                    },
                                    "Description": {
                                        "val": "Directed Energy\/Electronic Combat acquires the ability to characterize irradiance and beam properties on aircraft, small UAVs and ground targets and create realistic environments to simulate adversary air defense capabilities in the year 2030.  Enables 5th-6th generation weapon testing\/tactics development in a threat-realistic Anti-Access Area Denial (A2AD) environment using a combination of indoor and open-air ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.850"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.400"
                                            },
                                            "Text": {
                                                "val": "The current FY20 funding reflects a reduction due to the transfer of JSE Facility construction funding out of PE 0604759 to the MILCON appropriation.  JSE equipment acquisition and simulation development continues."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "89.033"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "89.033"
                                            },
                                            "Text": {
                                                "val": "Start of the Advanced Multispectral Development - Phase I (AMD-I) program and outfitting the JSE facilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase associated with procurement of technical equipment (i.e. domes, image generators, F-22\/35 Simulator Hardware and Helmets) and start integration activities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyberspace and Avionics Cyber"
                                    },
                                    "Description": {
                                        "val": "Cyberspace and Avionics Cyber is the advancement of cybersecurity\/resiliency test capability for network, C41SR and airborne weapon platforms and includes development of tools, techniques and hardware in the loop capabilities focused on cybersecurity and cyber-resiliency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.381"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "The current FY20 funding reflects a reduction due to transfer of Avionics Cyber Range (ACR) Facility construction funding out of PE 0604759 to MILCON appropriation. The Weapon System Cybersecurity (WSCS) Program tool program will continues execution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.410"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.410"
                                            },
                                            "Text": {
                                                "val": "FY21 funding will be used to equip the cyberspace facility as well continue the planning and execution of the Weapon System Cybersecurity (WSCS) Program tool development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase associated with Cyber Test Tool and Threat Emulation Software procurement and integration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomy"
                                    },
                                    "Description": {
                                        "val": "Autonomy refers to the ability to test autonomous aerial and ground systems with hundreds of independent vehicles.  Must be able to monitor system-under-test locations and states with the ability for soft and hard termination.  Must develop techniques and processes to test systems with artificial intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "In FY20, there are no planned projects but limited funding is available should an opportunity arise."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "In FY21, there are no planned projects but limited funding is available should an opportunity arise."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Not applicable."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space"
                                    },
                                    "Description": {
                                        "val": "Space Test Infrastructure refers to the development of a Space Combined Test Force and the development of technical capabilities, both terrestrial and space-based assets, in order to deploy  an initial level of ability to test and evaluate the capability and resilience of DoD Space systems in a contested environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "53.612"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "36.000"
                                            },
                                            "Text": {
                                                "val": "Continues FY19 effort to establish foundational elements for the Combined Test Force to include test facilities, modeling and simulation development, establishment of range command and control capabilities, and investments in range sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "44.975"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "44.975"
                                            },
                                            "Text": {
                                                "val": "Provides funding required to establish full spectrum environment to evaluate space system survivability and lethality in a highly contested environment.  Leverages initial FY19 investment of $54 million and $36 million FY20 congressional add."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY21 increase is a result of the AF FYDP space threat initiative."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE 06 PE 0604256F"
                                    },
                                    "Title": {
                                        "val": "Threat Simulator Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "33.666"
                                        },
                                        "CurrentYear": {
                                            "val": "59.693"
                                        },
                                        "BudgetYearOne": {
                                            "val": "57.725"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "57.725"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "44.777"
                                        },
                                        "BudgetYearThree": {
                                            "val": "36.511"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.655"
                                        },
                                        "BudgetYearFive": {
                                            "val": "32.237"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 06 PE 0605807F"
                                    },
                                    "Title": {
                                        "val": "Test and Evaluation Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "692.784"
                                        },
                                        "CurrentYear": {
                                            "val": "717.895"
                                        },
                                        "BudgetYearOne": {
                                            "val": "764.606"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "764.606"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "767.210"
                                        },
                                        "BudgetYearThree": {
                                            "val": "766.092"
                                        },
                                        "BudgetYearFour": {
                                            "val": "780.181"
                                        },
                                        "BudgetYearFive": {
                                            "val": "789.744"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 06 PE 0605976F"
                                    },
                                    "Title": {
                                        "val": "Facility Restoration & Modernization - T&E"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "187.216"
                                        },
                                        "CurrentYear": {
                                            "val": "88.445"
                                        },
                                        "BudgetYearOne": {
                                            "val": "70.985"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "70.985"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "70.622"
                                        },
                                        "BudgetYearThree": {
                                            "val": "71.888"
                                        },
                                        "BudgetYearFour": {
                                            "val": "73.173"
                                        },
                                        "BudgetYearFive": {
                                            "val": "74.520"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 06 PE 0605978F"
                                    },
                                    "Title": {
                                        "val": "Facility Sustainment - T&E Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "28.888"
                                        },
                                        "CurrentYear": {
                                            "val": "29.424"
                                        },
                                        "BudgetYearOne": {
                                            "val": "29.880"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "29.880"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "30.509"
                                        },
                                        "BudgetYearThree": {
                                            "val": "31.056"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.612"
                                        },
                                        "BudgetYearFive": {
                                            "val": "32.193"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}