{
    "id": "2021-Army-PB-2040-JBOOK-2ce7b76ca8f41dbc06183380f90728d4a8e40b9122c9effab5b4a02fdffb364e-5",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605326A"
        },
        "ProgramElementTitle": {
            "val": "Concepts Experimentation Program"
        },
        "R1LineNumber": {
            "val": "190"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "30.667"
            },
            "CurrentYear": {
                "val": "36.922"
            },
            "BudgetYearOne": {
                "val": "54.898"
            },
            "BudgetYearOneBase": {
                "val": "54.898"
            },
            "BudgetYearTwo": {
                "val": "59.199"
            },
            "BudgetYearThree": {
                "val": "59.858"
            },
            "BudgetYearFour": {
                "val": "60.609"
            },
            "BudgetYearFive": {
                "val": "61.684"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "363.837"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Army Concepts Experimentation Program supports current and future concepts and capabilities involving Soldiers and Leaders within live, virtual, and constructive environments by exploring concepts, capability requirements and solutions across Doctrine, Organization, Training, Materiel, Leadership and Education, personnel, and Facilities (DOTMLPF) domains. The purpose of Concepts Experimentation is to clarify and mitigate risk for current and future forces. Experiments and projects inform Army futures concepts and assess high-risk conceptual assumptions in order to focus required capabilities and represent user requirements in the future Army. Army experiments use the combined resources of Army Battle Laboratories, operational units, research labs, materiel developers, industry and academia to collaborate in the development, refinement, and assessment of future force concepts. Simulated Experiments (SIMEX) will integrate and assess Army Concepts and Force Design phases with Army-level issues across the breadth of a campaign that highlights validation and integration of Force 2025 outcomes.\n\nThis Program Element (PE) enhances Joint Capabilities Integration and Development System (JCIDS) development in support of Program Executive Offices (PEOs) and Program Managers (PMs) for acquisition milestone decisions. This PE provides for Accelerated Capability Development (ACD) to address current critical operational needs, enabling development and deployment\/employment of accelerated capabilities (both materiel and non-materiel) to the current force. Early Synthetic Prototyping enables a wargaming and experimentation capability that engages soldiers across the Army through early-fidelity game environments to gain their insights and recommendations in the development of future doctrine, organization, and materiel solutions. This PE provides funding for Army Warfighter Assessments (AWA) that physically integrate, assess and evaluate networked capability sets and other adaptive capabilities to accelerate the systems acquisition process of providing DOTMLPF recommendations to the Army. This PE also provides support to the Army Warfighting Challenges (AWFC) used by the Army to frame learning and collaboration.\n\nThe Soldier-Centered Analysis For Future Force Project (33B) will provide early application of human performance and human figure modeling tools in the development of Soldier-focused requirements to shape technology for Future Force development. These efforts include design analyses, constructive simulations, and Soldier-in-the loop assessments to ensure that manpower requirements and workload and skill demands are considered, avoiding information and physical task overloads and taking optimum advantage of aptitudes, individual and collective training, and numbers of Soldiers for an affordable Future Force."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "30.394"
                },
                "CurrentYear": {
                    "val": "42.922"
                },
                "BudgetYearOne": {
                    "val": "43.136"
                },
                "BudgetYearOneBase": {
                    "val": "43.136"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "30.667"
                },
                "CurrentYear": {
                    "val": "36.922"
                },
                "BudgetYearOne": {
                    "val": "54.898"
                },
                "BudgetYearOneBase": {
                    "val": "54.898"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.273"
                },
                "CurrentYear": {
                    "val": "-6"
                },
                "BudgetYearOne": {
                    "val": "11.762"
                },
                "BudgetYearOneBase": {
                    "val": "11.762"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-6"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.326"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.053"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "11.762"
                                },
                                "BudgetYearOneBase": {
                                    "val": "11.762"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year 2020 (FY20) reduction related to congressional reduction for excess growth.\n\nFY21 increase related to additional Capability Development Integration Directorate (CDID) cyber requirements, Future Concept Center (FCC) requirements, and Army Capability-based Architecture Development and Integration Environment (ArCADIE) maintenance requirements in Project 317."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "312"
                    },
                    "ProjectTitle": {
                        "val": "Army\/Joint Experimentation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.786"
                        },
                        "CurrentYear": {
                            "val": "7.725"
                        },
                        "BudgetYearOne": {
                            "val": "11.958"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.958"
                        },
                        "BudgetYearTwo": {
                            "val": "15.614"
                        },
                        "BudgetYearThree": {
                            "val": "12.857"
                        },
                        "BudgetYearFour": {
                            "val": "13.109"
                        },
                        "BudgetYearFive": {
                            "val": "13.201"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "80.250"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Army and Joint Experimentation supports current and future concepts and capabilities involving Soldiers and Leaders within live, virtual, and constructive environments by exploring concepts, capability requirements, and solutions across Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel, and Facilities (DOTMLPF) domains. The purpose of these efforts is to learn and mitigate risk for current and future forces. Experiments inform Army future concepts and assess high-risk conceptual assumptions in order to focus required capabilities and represent user requirements in the future Army. Army experiments use the combined resources of Army Battle Laboratories, operating force units, research laboratories, materiel developers, industry, and academia to collaborate in the development, refinement, and assessment of future force concepts. These experiments refine and validate concepts for current and future forces to inform capability developments and requirements determination. Since Fiscal Year (FY) 2015, this Project has supported the Army's Simulation-Based Experiments (SIMEXp) to integrate and assess near-, mid-, and far-term future force concepts, force designs, and capabilities. In support of the Army Vision and Army Strategy, experimentation focuses on the latest Multi-Domain Operations Concept and operational and organizational concepts for the Army of 2028 and beyond. To refine the Multi-Domain Operations Concepts, Army experimentation expands linkages to multi-Service and Joint experiments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Experimentation - High-Fidelity Live-Virtual-Constructive Experiments"
                                    },
                                    "Description": {
                                        "val": "Experiments address concept and capability developments including integration of capabilities for all Brigade Combat Team (BCT) types; development of future DOTMLPF requirements and solutions; and acceleration and integration of capabilities for current force BCTs and above brigade."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.786"
                                            },
                                            "Text": {
                                                "val": "Enabled the Army to conduct early fidelity exploration of Doctrine, Organization and Materiel solution through exposure of Soldiers to new innovative ideas and material. Establishes a continuing collaboration, feedback, and electronic analytical collection capability which captures, through simulated application of future force prototype concepts, explicit qualitative feedback of Soldiers experience gathered from simulated environments intertwined with surveys, polls, and discussion boards. Directed SIMEX leverage unique support analytics which capture Soldier and Team interaction during virtual small unit, first-person operating environment events from shooter engagements to high tempo teaming events which will become the focus to integrate and assess Army Concepts, Force Designs, and Capabilities to support Force 2028 Maneuvers to develop, refine, and validate prerequisite Force 2025 and Beyond Concepts, Operational and Organization Plans, and DOTMLPF solutions to achieve the vision of the Army's Force in the near (2014-2020), mid (2020-2030)(( and far (2030-2040) terms. Empowers participants to explore innovative techniques and participate in equipment and material design options which enables the Maneuver Battle Lab to be innovative in partnering with Department of Defense (DoD) Research and Development organizations in the development of solutions to Army Warfighting Challenges that would be assessed through Army Experimentation assessments. Leverages design of a high echelon, strategy environment which examines how units organize and employ future capabilities on the battlefield. The Futures Concept Center (FCC) continues, through a distributive network capability to support the Army Level Acquisition Design and merge with the Experimentation Mission while leveraging and sharing the expense of the Battle Labs to interject a new dynamic interactive process into proponent mission to engage Soldiers to select academia and industry solutions into a research opportunity through virtual exploration of the introduced concepts and equipment throughout a simulated operational environment selected from any location in the world. As Soldiers explore new ideas, concepts, material, and doctrine, they employ new techniques in coordination with the development of requirements documents provide improved insight to environment solutions to techniques and material during the conceptual development stage rather than post construction.Description: Experiments address concept and capability developments including integration of capabilities for all Brigade Combat Team (BCT) types; development of future DOTMLPF requirements and solutions; and acceleration and integration of capabilities for current force BCTs and above brigade."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.374"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments to address concept and capability developments including integration of capabilities for all BCT types. Will develop future DOTMLPF requirements and solutions and accelerate \/ integrate capabilities for current force BCTs and above brigade."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.958"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.958"
                                            },
                                            "Text": {
                                                "val": "Experiments will address concept and capability developments including integration of capabilities for all BCT types; development of future DOTMLPF requirements and solutions; and acceleration and integration of capabilities for current force BCTs and above brigade."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Mission increase in experimentation costs for concepts and capabilities developments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC  638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.351"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC  638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC  638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "317"
                    },
                    "ProjectTitle": {
                        "val": "Current Force Capability Gaps"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.229"
                        },
                        "CurrentYear": {
                            "val": "29.046"
                        },
                        "BudgetYearOne": {
                            "val": "42.94"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.94"
                        },
                        "BudgetYearTwo": {
                            "val": "43.585"
                        },
                        "BudgetYearThree": {
                            "val": "47.001"
                        },
                        "BudgetYearFour": {
                            "val": "47.5"
                        },
                        "BudgetYearFive": {
                            "val": "48.483"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "281.784"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project enables Army Capability Development and Integration Programs to support the Joint Capabilities Integration and Development System (JCIDS). These efforts involve integrating Program Executive Offices (PEOs) and Program Managers (PMs) to ensure coordinated and integrated acquisition Milestone decisions in a timely manner. Funding in this Project ensures that the Army Futures Command (AFC) \/ Future Concepts Center (FCC) acts independently and serves as the voice of the warfighter, complementing the materiel developer in providing total capability management that integrates all doctrine, organization, training, materiel, leadership and education, personnel, and facilities (DOTMLPF) considerations. These resource requirements provide AFC and FCC resources to execute as lead for Accelerated Capability Development (ACD) and central coordination for Headquarters, Department of the Army (HQDA). These requirements support critical research, development, test and evaluation for Early Synthetic Prototyping and enable war-gaming and experimentation that engages soldiers across the Army to gain insights and recommendations in the development of future doctrine, organization, and materiel solutions. FCC integrates accelerated capabilities development activities between Army proponent force modernization managers as well as Joint \/ Sister Service coordination. AFC\/FCC conducts Joint Warfighter Assessments to physically integrate, assess and evaluate adaptive capability sets to accelerate the systems acquisition process that provides DOTMLPF recommendations to the Army."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Warfighting Assessments"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.118"
                                            },
                                            "Text": {
                                                "val": "Support Joint Expeditionary Maneuver and Entry Operations, Set the Theater, Special Operations Forces\/Coalition Forces Interoperability, Air-Ground Reconnaissance and Security, Joint\/Multinational Operations, Sea Basing\/Joint Logistics Over the Shore (JLOTS), Mobile Command Posts (Expeditionary), Man Unmanned Teaming, (Ground\/Air) (MUM-T), Accelerated Capabilities Developments, Early Synthetic Prototyping and Architecture Army Warfighting Assessments (AWA)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.007"
                                            },
                                            "Text": {
                                                "val": "Support Joint Expeditionary Maneuver and Entry Operations, Set the Theater, Special Operations Forces\/Coalition Forces Interoperability, Air-Ground Reconnaissance and Security, Joint Multinational Operations, Sea Basing\/Joint Logistics Over the Shore (JLOTS), Mobile Command Posts (Expeditionary), Man Unmanned Teaming, (Ground\/Air) (MUM-T), Accelerated Capabilities Developments, Early Synthetic Prototyping and Architecture Joint Warfighting Assessments (JWA)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.33"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.33"
                                            },
                                            "Text": {
                                                "val": "Provide for AFC\/FCC to serve as the lead Accelerated Capability Development to address current critical operational needs in enabling development and deployment of accelerated capabilities (both materiel and non-materiel) to the current force. Serve as AFC\/FCC central coordinating organization for Headquarters Department of the Army HQDA staff support requirements related to accelerated capabilities developments. Integrate JMC activities to ensure unity and priority of effort and synchronization and optimization of resources. Integrate accelerated capabilities development activities between proponent force modernization domains to include Joint Service coordination."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Mission increase of accelerated capabilities developments which are being realized in transition from ARCIC to FCC."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Accelerated Capabilites Develpment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.544"
                                            },
                                            "Text": {
                                                "val": "Provide for TRADOC to serve as the lead Accelerated Capability Development to address current critical operational needs in enabling development and deployment\/employment of accelerated capabilities (both materiel and non-materiel) to the current force. Serve as TRADOC central coordinating organization for Headquarters Department of the Army HQDA staff support requirements related to accelerated capabilities developments. Integrate ACD activities to ensure unity and priority of effort and synchronization and optimization of resources. Integrate accelerated capabilities development activities between proponent force modernization domains to include Joint\/Service coordination."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.102"
                                            },
                                            "Text": {
                                                "val": "Provide for AFC\/FCC to serve as the lead ACD to address current critical operational needs in enabling development and deployment of accelerated capabilities (both materiel and non-materiel) to the current force. Serve as AFC\/ARCIC central coordinating organization for Headquarters Department of the Army HQDA staff support requirements related to accelerated capabilities developments. Integrate ACD activities to ensure unity and priority of effort and synchronization and optimization of resources. Integrate accelerated capabilities development activities between proponent force modernization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.904"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.904"
                                            },
                                            "Text": {
                                                "val": "Provide for AFC\/FCC to serve as the lead Accelerated Capability Development to address current critical operational needs in enabling development and deployment of accelerated capabilities (both materiel and non-materiel) to the current force. Serve as AFC\/FCC central coordinating organization for Headquarters Department of the Army HQDA staff support requirements related to accelerated capabilities developments. Integrate JMC activities to ensure unity and priority of effort and synchronization and optimization of resources. Integrate accelerated capabilities development activities between proponent force modernization domains to include Joint Service coordination."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Mission increase of accelerated capabilities developments which are being realized in transition from ARCIC to FCC."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CDID\/TCM JCIDS Requirements Documentation"
                                    },
                                    "Description": {
                                        "val": "In Fiscal Year 2014 the TRADOC Capability Development Integration Directorate (CDID) Capability Manager began finalizing a transfer of JCIDS Requirements Documentation Mission responsibility from the Assistant Secretary of the Army for Acquisition, Logistics, and Technology. This activity provides essential Joint Capabilities Integration and Development System Requirements Documentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.523"
                                            },
                                            "Text": {
                                                "val": "Ensure TRADOC acts independently as the voice of the warfighter, the user, in complement with the materiel developer in providing total capability management including integration of all DOTMLPF consideration for warfighting functional areas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.727"
                                            },
                                            "Text": {
                                                "val": "Funding ensures AFC\/FCC acts independently as the voice of the warfighter, the user, in complement with the materiel developer in providing total capability management including integration of all DOTMLPF considerations for warfighting functional areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.365"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.365"
                                            },
                                            "Text": {
                                                "val": "This project enables FCC in support of the AFC Commander to enhance processes to improve the JCIDS. It integrates the PEOs and PMs ensuring a coordinated and integrated acquisition milestone decisions met in a timely manner within the Future Force Modernization Enterprise (FFME).  The AFC team facilitates requirements determination in coordination with the Joint Requirements Oversight Council (JROC) and in coordination with the Assistant Secretary of the Army for Acquisition, Logistics, and Technology (ASA (ALT) which directs and ensures Milestone acquisition decisions are formally staffed and fully integrated across the FFME. Funding ensures AFC\/FCC acts independently and serves as the voice of the warfighter, this effort compliments the materiel developer in providing total capability management and ensures the integration of all DOTMLPF consideration.  Funding ensures AFC\/FCC acts independently and serves as the voice of the warfighter; this effort compliments the materiel developer in providing total capability management and ensures the integration of all doctrine, organization, training, materiel, leadership and education, personnel, and facilities (DOTMLPF) considerations.  This requirement provides AFC and FCC the resources to support any accelerated capability development through use of existing Army Live Prototype Assessment (ALPA) venues. Enable development and deployment\/employment of accelerated capabilities (both materiel and non-materiel) to the future force of 2028 and beyond.  Serves as AFC?s central coordinating organization for HQDA staff supporting requirements related to accelerated capabilities developments.  Funding integrates ACD activities to ensure unity and priority of effort as well as synchronization and optimization of resources.  Integrates accelerated capabilities development activities between proponent force modernization domains to include Joint\/Service coordination.  These requirements support critical research, development, test and evaluation for war gaming, and experimentation that engages soldiers across the Army. Enables the AFC\/FCC leadership to gain insights and recommendations in the development of the future force in preparation for the CSA?s Army of 2028.  FCC Integrates accelerated capabilities development activities between Army proponent force, modernization managers, and Joint\/ Sister Service coordination. AFC\/FCC JMC conducts Joint Warfighter Assessments and ALPA events to physically integrate, assess and evaluate the network, capability sets and other adaptive capabilities resulting in the acceleration of the systems acquisition process to providing DOTMLPF informed recommendations to the Army."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased for additional CDID cyber requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Capability-based Architecture Development and Integration Environment (ArCADIE)"
                                    },
                                    "Description": {
                                        "val": "ArCADIE is the Army's authoritative source for architecture data and supports the community of practice requirement. ArCADIE provides a robust collaborative and common enterprise environment for architecture-related efforts in support of critical institutional processes throughout the TRADOC Centers of Excellence and Army\/Joint\/Department of Defense (DOD) partners. Offers a single, federated web-based environment for the development and discovery of integrated architectures across warfighting functions, and organizations throughout the Army Enterprise."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.044"
                                            },
                                            "Text": {
                                                "val": "Enable ARCIC to maintain ArCADIE and develop, verify, and validate operational architecture for 8 major BCT formations. Provide storage, accessibility, production, and certification of authoritative architecture data and supporting systems in accordance with DoD and DA information Assurance and management standards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.891"
                                            },
                                            "Text": {
                                                "val": "Enable the Army Capabilities Integration Center (ARCIC) to maintain ArCADIE and develop, verify, and validate operational architecture for eight major Brigade Combat Team (BCT) formations. Provide storage, accessibility, production, and certification of authoritative architecture data and supporting systems in accordance with DoD and DA information Assurance and management standards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.341"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.341"
                                            },
                                            "Text": {
                                                "val": "Enable FCC to maintain ArCADIE and develop, verify, and validate operational architecture for eight major BCT formations. Provide storage, accessibility, production, and certification of authoritative architecture data and supporting systems in accordance with DoD and DA information Assurance and management standards."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "ArCADIE maintenance increase."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC  638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.319"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC  638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC  638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "33B"
                    },
                    "ProjectTitle": {
                        "val": "Soldier-Centered Analyses For Future Force"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.652"
                        },
                        "CurrentYear": {
                            "val": "0.151"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.803"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2021 (FY21) this Project is being realigned to:\nProgram Element 0605604A Survivability Lethality Analysis\n* Project 675 Army Survivability Analysis & Evaluation Supp"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project will provide early application of human performance and human figure modeling tools in the development of Soldier-focused requirements to shape technology for Future Force development. Efforts include design analyses, constructive simulations, and Soldier-in-the-loop assessments to ensure that manpower requirements and workload and skill demands are considered, avoiding information and physical task overloads and taking optimum advantage of aptitudes, individual and collective training, and numbers of Soldiers for an affordable Future Force. \n\nThe cited work is consistent with the Strategic Planning Guidance, the Army Science and Technology Master Plan (ASTMP), the Army Modernization Plan, and the Defense Technology Area Plan (DTAP). \n\nWork in this Project is performed by the United States (U.S.) Army Combat Capabilities Development Command (CCDC) Data and Analysis Center (DAC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Manpower and Personnel Integration (MANPRINT)"
                                    },
                                    "Description": {
                                        "val": "Provide dedicated modeling and analysis cell for early and accurate MANPRINT estimates to the U.S. Army Materiel Command (AMC), CCDC and its Centers, the Research and Analysis Center, Schools and Centers of Excellence (CoEs), Army Test and Evaluation Command (ATEC) and other service laboratories."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.652"
                                            },
                                            "Text": {
                                                "val": "Developed cognitive workload models to assess next-generation combat vehicle (NGCV) crewman ability to control multiple unmanned assets in a combined Manned-Unmanned Teaming (MuM-T) environment to allow crewman to think and act decisively to shoot, move and communicate more effectively. Collected dynamic motion data for NGCV crewman and format motion data for input into computer-assisted design (CAD) models to determine if proper crew offset exists in the design to minimize risk of injury. Incorporated scanned human body shape geometry into current 3D human figure boundary manikin models for improved analysis capability to shape technology for NGCV."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.144"
                                            },
                                            "Text": {
                                                "val": "Will expand the digital library by developing 3-dimensional (3D) models of Soldier clothing and equipment items to perform early human figure modeling assessments of NGCV platform designs and enhancements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY21 funds have been realigned into PE 0605604A Survivability\/Lethality Analysis, Project 675, Army Survivability Analysis and Evaluation Support."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC  638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.007"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC  638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC  638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}