{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-9035d21372bc28631c31031b85da2fbd962d290bf8d6ca6eecbc49021508de49-8",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602751D8Z"
        },
        "ProgramElementTitle": {
            "val": "Software Engineering Institute (SEI) Applied Research"
        },
        "R1LineNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "8.614"
            },
            "PriorYear": {
                "val": "8.942"
            },
            "CurrentYear": {
                "val": "9.580"
            },
            "BudgetYearOne": {
                "val": "9.573"
            },
            "BudgetYearOneBase": {
                "val": "9.573"
            },
            "BudgetYearTwo": {
                "val": "9.712"
            },
            "BudgetYearThree": {
                "val": "9.749"
            },
            "BudgetYearFour": {
                "val": "10.001"
            },
            "BudgetYearFive": {
                "val": "10.204"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Software Engineering Institute (SEI) Applied Research Program Element (PE) develops and evaluates the feasibility and practicality of software and computer science concepts at the applied research level, with the potential to improve future DoD systems through research, development, and application in the SEI Advanced Technology Development Program Element (PE) 0603781D8Z.  Promising projects proceed into advanced technology development through this PE."
        },
        "ProgramElementMissionDescription": {
            "val": "The Software Engineering Institute (SEI) Federally Funded Research and Development Center (FFRDC) was established in 1984 as an integral part of the DoD’s initiative to identify, evaluate, and transition software engineering technologies and practices.  The mission of the SEI is to provide the DoD with technical leadership and innovation through research and development to advance the practice of software engineering and technology.  The SEI works across government, industry, and academia to improve the state of software engineering from the technical, acquisition, and management perspectives. The SEI engages in research and development of critical software technologies and tools and collaborates with the larger software engineering research community.  It facilitates rapid transition of software engineering technologies into practice and evaluates emerging software engineering technologies to determine their potential for improving software-intensive DoD systems.  Since its inception, the SEI has helped to transform the fields of software engineering and acquisition, network security, real-time systems, software architectures, and software-engineering process management.\n\nSoftware is critical to meeting the Department of Defense's (DoD) increasing demand for national defense systems that are high-quality, affordable, and deployed in a timely way. With growing global parity in software engineering, the DoD must maintain leadership in all aspects of software-based system development, operation, defense, and evolution to avoid strategic surprise.  To assist the DoD in retaining a long-term differential advantage over potential adversaries, the Software Engineering Institute (SEI) Applied Research program element (PE) develops and evaluates the feasibility and practicality of software and computer science concepts, with the potential to improve future DoD systems.  The research conducted by this PE directly benefits the technical domains Autonomous Systems and Artificial Intelligence (AI), Cyber, and Engineered Resilient Systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.279"
                },
                "CurrentYear": {
                    "val": "9.580"
                },
                "BudgetYearOne": {
                    "val": "9.662"
                },
                "BudgetYearOneBase": {
                    "val": "9.662"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.942"
                },
                "CurrentYear": {
                    "val": "9.580"
                },
                "BudgetYearOne": {
                    "val": "9.573"
                },
                "BudgetYearOneBase": {
                    "val": "9.573"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.337"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.089"
                },
                "BudgetYearOneBase": {
                    "val": "-0.089"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.335"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.002"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.080"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.080"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.009"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.009"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "278"
                    },
                    "ProjectTitle": {
                        "val": "Software Engineering Institute (SEI) Applied Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "8.614"
                        },
                        "PriorYear": {
                            "val": "7.942"
                        },
                        "CurrentYear": {
                            "val": "8.580"
                        },
                        "BudgetYearOne": {
                            "val": "8.573"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.573"
                        },
                        "BudgetYearTwo": {
                            "val": "8.712"
                        },
                        "BudgetYearThree": {
                            "val": "8.749"
                        },
                        "BudgetYearFour": {
                            "val": "9.001"
                        },
                        "BudgetYearFive": {
                            "val": "9.204"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Work conducted under this PE will enable resilient mission assurance in heterogeneous and contested environments through the verification and validation of system performance and architecture.  The program will also assist the DoD in retaining a long-term advantage in the areas of software-intensive systems and cyber security by enhancing assurance, exploiting automation and AI, and understanding human-computer interaction.\n\nThe SEI Applied Research PE has two main research thrusts with known military applications:  (1) Software Engineering, Systems Verification and Validation, and Mission Assurance (formerly Mission Assurance); and (2) Information Assurance. This area is increasingly being applied to AI and autonomous systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SEI Applied Research in the Area of Software Engineering, Systems Verification and Validation, and Mission Assurance (formerly Mission Assurance)"
                                    },
                                    "Description": {
                                        "val": "Increasingly complex and AI-enabled systems will require a commensurate increase in sophistication of verification and validation mechanisms.  This thrust seeks to develop verification techniques for requirements identification, systems of systems architectures, and virtual integration of components.  Additionally, research in this area will enable requirements verification for software assurance, analysis and control of unverified code, and automated repair of damaged code.  Software production and code analysis methods developed through this program will also improve the accuracy of behavior prediction of complex software, including AI-enabled systems, in untested environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.765"
                                            },
                                            "Text": {
                                                "val": "•\tCreate and build benchmarks and datasets, using emerging machine learning computing technologies, for evaluating and improving the effectiveness of machine learning (ML) and computing resource optimization for DoD Systems.\n•\tDesign and train machine learning algorithms to maximize human-machine teaming effectiveness. \n•\tDevelop causal modeling tools for system software cost to identify causal factors for software cost that will provide a basis for controlling program costs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.006"
                                            },
                                            "Text": {
                                                "val": "• Create tools to automatically assure untrusted external software components to enable rapid software composition for DoD systems.\n• Develop AI engineering techniques to train AI systems with expected security properties requiring two to three orders of magnitude less computation and verified security properties under known attacks.\n• Develop algorithms and approaches to automate code changes that enable developers to quickly and confidently restructure software, including harvesting code for reuse and the ability to replace large-scale software components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.023"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.023"
                                            },
                                            "Text": {
                                                "val": "• Develop automated design conformance checkers, as part of a continuous integration toolchain, to correctly identify significant design non-conformance in order to advance DoD capabilities to rapidly compose software systems, including secure AI\/ML systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent from FY 2020 to FY 2021.  Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEI Applied Research in the areas of Information Assurance (IA)"
                                    },
                                    "Description": {
                                        "val": "To gain full advantage from data and information generated by software for use in missions, DoD needs to assure its software is free of vulnerabilities.  In its complex systems, DoD may use software developed from an unknown supply chain that may include intentionally or unintentionally introduced vulnerabilities.  This thrust seeks to develop scalable automated methods to locate, understand, and mitigate the effects of these vulnerabilities.  Automated solutions developed through this thrust will be used to discover vulnerabilities in system software source code and to generate proofs of correctness or fault.  Additionally, they will be used to model and simulate operational environments to support software and cyber tactics, techniques, and procedures testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.177"
                                            },
                                            "Text": {
                                                "val": "•\tDevelop advanced analytics and machine learning technologies to enable self-adaptive cyber defenses. \t\n•\tDevelop and test tools that provide rapid certifiable trust for autonomous, cyber-physical platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.574"
                                            },
                                            "Text": {
                                                "val": "• Devise practical formal methods which can be utilized to produce trustworthy and assured software on more complex systems and the emerging technologies of interest to the DoD.\n• Develop compositional verification techniques to allow the use of multiple enforced components. This enables the use of unverified commodity software components containing non-secure behavior with verified enforcers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.550"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.550"
                                            },
                                            "Text": {
                                                "val": "• Advance compositional verification techniques to allow the use of unverified commodity software components in DoD systems, including secure and robust AI\/ML systems.\n• Use machine learning and semantic analysis of data generated during Continuous Integration\/Continuous Delivery to reduce the number of alerts requiring human adjudication during the deployment of multiple situational awareness tools and increase the security of software without slowing the development process."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent from FY 2020 to FY 2021.  Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BA 3, PE# 0603781D8Z"
                                    },
                                    "Title": {
                                        "val": "Software Engineering Institute (SEI)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "15.016"
                                        },
                                        "CurrentYear": {
                                            "val": "15.111"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.598"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.598"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.825"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.090"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.491"
                                        },
                                        "BudgetYearFive": {
                                            "val": "13.816"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The SEI Applied Research PE represents a pivot toward more fundamental research that enables the DoD to address longer-term challenges in software technology and engineering.  The SEI Applied Research PE bolsters the organic research at the SEI Federally Funded Research and Development Center (FFRDC), enables stronger collaborations between the SEI FFRDC and academia, attracts top researchers to the SEI, and gives the DoD access to top experts in information science, which generally enhances the DoD’s ability to benefit from the military applications of research in software and computer science."
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "817"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Security, Applied Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.000"
                        },
                        "CurrentYear": {
                            "val": "1.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.000"
                        },
                        "BudgetYearThree": {
                            "val": "1.000"
                        },
                        "BudgetYearFour": {
                            "val": "1.000"
                        },
                        "BudgetYearFive": {
                            "val": "1.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Work conducted under this project will enable resilient mission assurance in heterogeneous and contested environments through the verification and validation of system performance and architecture.  The program will also assist the DoD in retaining a long-term advantage in the area of cybersecurity by enhancing assurance, exploiting automation, and understanding human-computer interaction."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Security"
                                    },
                                    "Description": {
                                        "val": "Warfighting in the cyber domain often operates at sub-second timescales and across multiple domains of authority. Methods used to accomplish many tasks (e.g., malware analysis, coordinating multiple agents) demand large amounts of time, attention, and special skills and are not scalable.  This thrust seeks to develop and increase the use of automation to simplify the completion of these tasks.  Example activities include automation of moving target defenses, code artifact reverse engineering, analysis of network flows at enterprise scale, assessing the operating boundaries for Artificial Intelligence (AI) and Machine Learning (ML) algorithms, and development and assessment of workforce skills."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "•\tUtilize AI\/ML techniques to find and classify security vulnerabilities in code, including predicting security flaws in synthetic code. \n•\tDevelop a reference architecture that automatically adapts to organizations’ tooling and codebases to accurately classify and prioritize security alerts, minimizing manual effort by validators."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "• Develop means to assure and verify trustworthiness of AI\/ML systems via new techniques to continuously assess the operating boundaries for AI\/ML algorithms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "• Develop techniques to evaluate the effectiveness of proposed system defenses against code reuse attacks on multiple architectures and platforms of interest to the DoD including AI\/ML systems.\n• Apply and advance new techniques to continuously assess the operating boundaries for AI\/ML algorithms to assure and verify trustworthiness."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no change in the Cyber investment between FY 2020 and FY 2021."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}