{
    "id": "2021-DefenseLogisticsAgency-PB-0400-MJBOOK-0-4-7785e498f08da31904e836881ba7711c1e6b2127a147e20d7386b2865869377d-2",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603720S"
        },
        "ProgramElementTitle": {
            "val": "Microelectronics Technology Development and Support  (DMEA)"
        },
        "R1LineNumber": {
            "val": "54"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "722.502"
            },
            "PriorYear": {
                "val": "192.926"
            },
            "CurrentYear": {
                "val": "200.530"
            },
            "BudgetYearOne": {
                "val": "124.049"
            },
            "BudgetYearOneBase": {
                "val": "124.049"
            },
            "BudgetYearTwo": {
                "val": "126.051"
            },
            "BudgetYearThree": {
                "val": "138.442"
            },
            "BudgetYearFour": {
                "val": "142.730"
            },
            "BudgetYearFive": {
                "val": "146.709"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "DMEA’s mission is to leverage advanced technologies to provide microelectronics solutions across the entire spectrum of technology development and system acquisition phases.  It is critical to National Security for the Department to maintain technological superiority through microelectronics solutions even when industry is unable or unwilling to provide them.  DMEA provides an in-house capability to quickly develop and deliver timely, cost-effective, technically appropriate solutions to sustain weapon systems, to modernize their capabilities, increase their lethality, address new threats, and meet operational demands.  DMEA augments its in-house capability through extensive industry and government partnerships that enable streamlined access to a variety of microelectronics technologies and engineering services to enhance responsiveness, and that develop sources for Trusted microelectronics.\n\nDMEA’s capabilities are critical in an atmosphere of diminishing domestic semiconductor manufacturing capability and increasing worldwide supply chain risks.  The Department has very little influence over the microelectronics industry; the defense market represents less than 0.1% share of the total global semiconductor market.  Assured access to Legacy, State of the Practice (SOTP) and State of the Art (SOTA) technologies is therefore a major and growing challenge.  Threats to defense microelectronics include counterfeiting, Trojan horses, specific reliability issues in military environments, consolidation and off-shoring of manufacturing, rapid obsolescence and diminishing technology availability coming from an unpredictable and unsecured supply chain. In addition, as the Department maintains its weapon systems longer than originally planned, extended use increases demand for sustainment and modernization, which further intensifies the need for DMEA’s unique capabilities.  \n\nThe Technology Development program (P001) provides the Department with DMEA engineering expertise and laboratories to address the myriad microelectronics issues and to meet military requirements across the entire spectrum of technology research and development, acquisition, and long-term support. DMEA applies its specialized capabilities to resolve microelectronics issues for hundreds of distinct Department programs across the acquisition lifecycle every year.  In addition, DMEA assists the Combatant Commands (COCOMs) including Special Ops, Cyber, Intelligence, and the Radiation-Hard communities.\n\nThe Trusted Foundry program (P003) provides the Department with access to state-of-the-art microelectronics design and manufacturing capabilities with the added benefit of Trust, if necessary, to meet their confidentiality, integrity, availability, performance and delivery needs.  The Trusted Foundry program also provides the Services and other agencies with a competitive cadre of accredited Trusted suppliers that can meet the needs of their mission critical\/essential systems for Trusted integrated circuit components."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "192.926"
                },
                "CurrentYear": {
                    "val": "171.771"
                },
                "BudgetYearOne": {
                    "val": "156.427"
                },
                "BudgetYearOneBase": {
                    "val": "156.427"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "192.926"
                },
                "CurrentYear": {
                    "val": "200.530"
                },
                "BudgetYearOne": {
                    "val": "124.049"
                },
                "BudgetYearOneBase": {
                    "val": "124.049"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "28.759"
                },
                "BudgetYearOne": {
                    "val": "-32.378"
                },
                "BudgetYearOneBase": {
                    "val": "-32.378"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "35.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "CurrentYear": {
                        "val": "-6.241"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Inflation for Civilian Pay"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.613"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.613"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Inflation for Non-Pay\/Non-Fuel Purchases"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.135"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.135"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Internal Realignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-32.653"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-32.653"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Fourth Estate Network Optimization (4ENU)"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.203"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.203"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2020, program received Congressional Add of $30.000 million for cyber accelerator and a $5.000 million increase for GaN-on-Si-Based RF Front-end.\nFY2020, the Small Business Innovation Research and Small Technology Transfer Research tax amounted to $6.241 million.\nFY2021, internal realignment decreased baseline by $32.653 million. $30.000 million was realigned for Research & Engineering (R&E) prioritization and $2.653 million for critical Defense Property Accountability System redesign and upgrade requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "374.198"
                        },
                        "PriorYear": {
                            "val": "71.819"
                        },
                        "CurrentYear": {
                            "val": "110.657"
                        },
                        "BudgetYearOne": {
                            "val": "45.429"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.429"
                        },
                        "BudgetYearTwo": {
                            "val": "46.503"
                        },
                        "BudgetYearThree": {
                            "val": "48.229"
                        },
                        "BudgetYearFour": {
                            "val": "49.857"
                        },
                        "BudgetYearFive": {
                            "val": "50.808"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Technology Development funds provide DMEA with the resources to maintain an in-house ability to quickly develop and deliver timely, cost-effective, technically appropriate solutions to sustain weapon systems, to modernize their capabilities, increase their lethality, address new threats, and meet operational demands. These funds also support DMEA’s ability to partner with industry, other government agencies, and academia to enable streamlined access to a variety of microelectronics technologies and engineering services. \n\nThese funds enable DMEA to provide increasingly rare government microelectronics design, fabrication, and test expertise to DoD programs. DMEA’s knowledge of varying military requirements across a broad and diverse range of combatant environments and missions—along with its unique technical perspective—allows it to develop, manage and deliver novel, decisive, quick turn microelectronics solutions for defense, intelligence, special operations, and cyber and combat missions.\n\nThese funds allow DMEA to maintain and enhance critical, Trusted microelectronics design, aggregation, fabrication, post-processing, assembly and analysis capabilities to ensure that the Department is provided with solutions that enable or maintain the warfighter’s technological superiority over potential adversaries. These solutions use high mix, low volume, unique microelectronics that are endemic to military requirements but are not commercially available. In addition, funding provides for the research, development and support necessary to ensure availability of microelectronics technologies for weapon systems, particularly as the technologies advance and industry is increasingly unable or unwilling to provide them. \n\nDMEA looks to industry to see if it can provide the required solutions. If industry cannot or will not, only then does DMEA provide the necessary solutions using its in-house capabilities. A critical element required to enable continued success is DMEA’s protection of the industry partners’ valuable Intellectual Property (IP) and processes. DMEA is a small, agile government-owned and operated organization, providing the structure and confidence necessary to assure them that commercial IP is protected from potential competitors. This strategic and cooperative industry partnership approach allows DMEA to use industry-developed IP and processes by acquiring, installing, and applying them toward meeting the immediate and long-term needs of the Department. This unique capability is essential to all major weapon systems, combat operations, and support needs. As such, DMEA serves the Department, other US Agencies, industry and Allied nations. \n\nDMEA assists hundreds of Department programs every year. DMEA has provided its specialized engineering assistance and capabilities to older systems, current systems, and even to programs not yet in the production phase. Programs that DMEA has recently provided critical support to include Counter-Rocket, Artillery, and Mortar (C-RAM) System, C-5, V-22, F-15, F-35, RQ-4 Global Hawk, AEGIS Advanced Surface Missile System, Advanced Medium-Range Air-to-Air Missile (AMRAAM), HH-60G Pave Hawk Helicopter, OSD Joint Fuze Technology Program, among many others. DMEA assists the Combatant Commands (COCOMs) including Special Operations, Intelligence, and the Radiation-Hard communities."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Cyber Accelerator Increase"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "30.000"
                                        },
                                        "Text": {
                                            "val": "$30M increase for cyber accelerator"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GaN-on-Si-Based RF Front-end Increase"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "$5M increase for GaN-on-Si-Based RF Front-end"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technology Development Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "71.819"
                                            },
                                            "Text": {
                                                "val": "DMEA will design, develop, and demonstrate microelectronics concepts, advanced technologies, and applications to solve operational problems and modernize key capabilities . DMEA will apply advanced technologies to add performance enhancements in response to the newest asymmetric threats and to modernize aging weapon systems. The increased missions seen in the last several years by Combatant Commands (CCMDs) and Special Operations have caused those organizations to dramatically increase their demands for DMEA’s unique capability to provide quick technical solutions to immediate operational needs. To meet these increases, DMEA will add capacity and capability by recapitalizing and modernizing aging microelectronic infrastructure, extending and upgrading process IP, developing advanced techniques to inspect and analyze circuits, and adapting tools and processes to detect increasingly sophisticated counterfeit microelectronics to ensure a secure supply chain, all to meet quick turn solutions on which CCMDs and Special Operations can rely. DMEA will complete installation of the cleanroom in the 200mm facility, and will begin installation of semiconductor fabrication equipment in the completed cleanroom. DMEA will start integration of the critical 200mm process IP into the 200mm facility."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "75.657"
                                            },
                                            "Text": {
                                                "val": "DMEA will design, develop, and demonstrate microelectronics concepts, advanced technologies, and applications to solve operational problems. DMEA will apply advanced technologies to add performance enhancements in response to the newest asymmetric threats and to modernize aging weapon systems. The increased missions seen in the last several years by Combatant Commands (CCMDs), Special Operations, and the Intelligence Community have caused those organizations to dramatically increase their demands for DMEA’s unique capability to provide quick technical solutions to immediate operational needs. To meet these increases, DMEA will add capacity and extend capability by recapitalizing and modernizing its aging laboratory infrastructure, developing advanced techniques to inspect and analyze circuits, and adapting tools and processes to detect increasingly sophisticated counterfeit microelectronics to ensure a secure supply chain, all to meet quick turn solutions on which CCMDs and Special Operations can rely."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "45.429"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "45.429"
                                            },
                                            "Text": {
                                                "val": "DMEA will design, develop, and demonstrate microelectronics concepts, advanced technologies, and applications to solve operational problems. DMEA will apply advanced technologies to add performance enhancements in response to the newest asymmetric threats and to modernize aging weapon systems. The increased missions seen in the last several years by Combatant Commands (CCMDs), Special Operations, and the Intelligence Community have caused those organizations to dramatically increase their demands for DMEA’s unique capability to provide quick technical solutions to immediate operational needs. To meet these increases, DMEA will extend and refresh capability by recapitalizing and modernizing its aging laboratory infrastructure, developing advanced techniques to inspect and analyze circuits, and adapting tools and processes to detect increasingly sophisticated counterfeit microelectronics to ensure a secure supply chain, all to meet quick turn solutions on which CCMDs and Special Operations can rely."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY2020 to FY2021 decrease is due to reduction in funding of the top four FY2018 microelectronics initiatives, and also in association with the Fourth Estate IT optimization."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "003"
                    },
                    "ProjectTitle": {
                        "val": "Trusted Foundry"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "348.304"
                        },
                        "PriorYear": {
                            "val": "121.107"
                        },
                        "CurrentYear": {
                            "val": "89.873"
                        },
                        "BudgetYearOne": {
                            "val": "78.620"
                        },
                        "BudgetYearOneBase": {
                            "val": "78.620"
                        },
                        "BudgetYearTwo": {
                            "val": "79.548"
                        },
                        "BudgetYearThree": {
                            "val": "90.213"
                        },
                        "BudgetYearFour": {
                            "val": "92.873"
                        },
                        "BudgetYearFive": {
                            "val": "95.901"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department, other agencies, and the intelligence community require uninterruptible access to state-of-the-art design and manufacturing processes to produce custom integrated circuits designed specifically for military purposes. Under DoDI 5200.44, Application Specific Integrated Circuits (ASICs) in critical\/essential systems must be procured from Trusted sources in order to avoid altered or sabotaged parts. Worldwide competition from foreign, state-subsidized manufacturing facilities continues to greatly reduce the number of U.S. semiconductor fabrication facilities available to be Trusted sources.  The prevalence of sophisticated offshore design and manufacturing facilities with economic incentives of state subsidies have resulted in the outsourcing of electronics component and integrated circuit services to these offshore facilities.  This production capability is of increasing importance as domestic semiconductor manufacturing resources continue to decline, especially in the scarce domestic production capacity of high performance and state-of-the-art semiconductor technologies. Commercial sources of microelectronics remain inherently unpredictable and constitute a continued supply chain risk regardless of Government investment.  This trend threatens the integrity and worldwide leadership of the U.S. semiconductor industry by eliminating many domestic suppliers and reducing access to Trusted fabrication sources for advanced technologies, and is of acute concern to the defense and intelligence communities. Secure communications and cryptographic applications, along with most other key defense technologies, depend heavily on high performance semiconductors where a generation of improvement often translates into significant force multipliers and capability advantages.  Important defense technology investments and demonstrations carry size, weight, power, and performance goals that can only be met through the use of the most sophisticated semiconductors. \n\nThe Trusted Foundry program provides the Department with access to state-of-the-art microelectronics design and manufacturing capabilities with the added benefit of Trust, if necessary, to meet their confidentiality, integrity, availability, performance and delivery needs.  The program also provides the Services and other agencies with a competitive cadre of accredited Trusted suppliers that can meet the needs of their mission critical\/essential systems for Trusted integrated circuit components.  The Trusted Access Program Office has contracted with commercial sources to satisfy state-of-the-art semiconductor requirements.  DMEA will foster all viable alternatives to continue the vital supply of Trusted microelectronics, including the work of the DMEA Trusted Access Program Office with commercial state-of-the-art industry, as well as the extension and implementation of key process technologies for trust at DMEA.  It is imperative for a wide range of technologies in ongoing and future Department systems that access to Trusted suppliers continues.  Most importantly, access to Trusted Microelectronics is absolutely necessary to meet secure communication and cryptographic needs requiring state-of-the-art semiconductor technologies."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Trusted Foundry"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "30.000"
                                        },
                                        "Text": {
                                            "val": "DMEA funded GlobalFoundries US2 (GFUS2) in Burlington, VT, to accomplish Multi-Project Wafer (MPW) runs in 5G-capable processes and at the 14nm node. DMEA also funded GFUS2 to accomplish qualification of a domestic 14nm mask manufacturing capability.  In addition, DMEA conducted an assessment of machine vision and counterfeit detection tools in accordance with section 843 of the 2019 National Defense Authorization Act."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Trusted Foundry"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "91.107"
                                            },
                                            "Text": {
                                                "val": "Facilitate the availability of Trusted state-of-the-art semiconductor technology to DoD weapon system programs, research organizations, and other federal agencies through the DMEA Trusted Access Program Office (TAPO) contracts. Continue efforts to extend Trusted access to 14 nm technology for USG use through the TAPO contracts, and to provide access to other leading edge technologies. Enhance the cadre of trusted suppliers for the critical trusted components and services needed for appropriate defense systems. Enhance Trusted Microelectronics products to include newly available leading edge technologies and other key specialty processes required by Department programs. Expand a line of trusted catalog components that can be purchased by Defense contractors. Continue activities that ensure the Department has Trusted access to leading edge semiconductor technologies. Continue the development of new capabilities for the inspection and analysis of ASICs and continuously refine the utilized methods for efficiency, accuracy, and applicability to multiple processes. Implement a Trusted flow for new process technologies at DMEA."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "89.873"
                                            },
                                            "Text": {
                                                "val": "Facilitate the availability of Trusted and commercial state-of-the-art semiconductor technology to Department weapon system programs, research organizations, and other federal agencies through the DMEA Trusted Access Program Office (TAPO) contracts.  Continue efforts to extend Trusted access to 14 nm technology for USG use through the TAPO contracts, and to provide the Department and other USG-sponsored programs with access to this and other leading edge technologies.  Enhance the cadre of trusted suppliers for the critical trusted components and services needed for appropriate defense systems.  Enhance Trusted microelectronics products to include newly available leading edge technologies and other key specialty processes required by Department programs.  Expand a line of trusted catalog components that can be purchased by Defense contractors. Continue activities that ensure the Department has Trusted access to leading edge semiconductor technologies.  Continue the development of new capabilities for the inspection and analysis of ASICs and continuously refine the utilized methods for efficiency, accuracy, and applicability to multiple processes.  Implement a Trusted flow for new process technologies at DMEA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "78.620"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "78.620"
                                            },
                                            "Text": {
                                                "val": "Facilitate the availability of Trusted and commercial state-of-the-art semiconductor technology to Department weapon system programs, research organizations, and other federal agencies through the DMEA Trusted Access Program Office (TAPO) contracts.  Continue efforts to extend Trusted access to 14 nm technology for USG use through the TAPO contracts, and to provide the Department and other USG-sponsored programs with access to this and other leading edge technologies.  Enhance the cadre of trusted suppliers for the critical trusted components and services needed for appropriate defense systems.  Enhance Trusted microelectronics products to include newly available leading edge technologies and other key specialty processes required by Department programs.  Expand a line of trusted catalog components that can be purchased by Defense contractors.  Continue activities that ensure the Department has Trusted access to leading edge semiconductor technologies.  Continue the development of new capabilities for the inspection and analysis of ASICs and continuously refine the utilized methods for efficiency, accuracy, and applicability to multiple processes.  Implement a Trusted flow for new process technologies at DMEA."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2020 to FY2021 program reflects a continuation in funding for FY2019 microelectronics initiatives, including access to the GlobalFoundries 14 nm foundry."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}