{
    "id": "2021-Army-PB-2040-JBOOK-38817b19843ccf99356f5d9ba89c5f3ce0667d7b832b6ff0b583beb9488c2c99-28",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA4-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604120A"
        },
        "ProgramElementTitle": {
            "val": "Assured Positioning, Navigation and Timing (PNT)"
        },
        "R1LineNumber": {
            "val": "106"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "128.125"
            },
            "BudgetYearOneBase": {
                "val": "128.125"
            },
            "BudgetYearTwo": {
                "val": "66.661"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Program Element (PE) 0604120A restructured from PE1206120A in FY 2021."
        },
        "ProgramElementMissionDescription": {
            "val": "Assured Positioning, Navigation and Timing (A-PNT) provides Army ground maneuver forces access to assured PNT information under conditions where space-based PNT Global Positioning System (GPS) may be limited or denied (jammed and spoofed).  A-PNT products are ruggedized tactical systems that enable Army forces at echelon the ability to shoot, move, communicate, and protect their forces to penetrate and dis-integrate enemy anti-access systems, thereby allowing them to maneuver from operational and strategic distances to close with, destroy, and exploit the enemy in close and deep maneuver areas with sufficient combat power, tempo, and momentum. A-PNT addresses two critical capability gaps: Access and Integrity. Access is the ability to retrieve accurate PNT information in a contested Electronic Warfare\/Cyber environment. Integrity is the ability to trust the PNT information. PNT is a critical enabler of many Army Maneuver, Fires, and Command and Control systems that are dependent on accurate Position and Timing, and a foundational Multi-Domain Battle capability to support: calibrated force posture (position and maneuver across strategic distances); multi-domain formations (operate in contested spaces against near-peer adversaries); convergence (continuous integration of capabilities in all domains). The current Global Positioning System (GPS) capability is a fixed frequency system susceptible to electronic warfare and field environments (e.g. urban, dense vegetation).  \n\nJoint Requirements Oversight Council Memo (JROCM) 049-10, dated 05 April 2010, approved the PNT Assurance Initial Capabilities Document and designated the Army as the Lead Component for Assured PNT.   Army Futures Command approved the Mounted A-PNT System (MAPS) Directed Requirement (DR) on 13 January 2019. The Dismounted A-PNT System (DAPS) Directed Requirement was approved 05 April 2019. The Alternative Navigation (ALTNAV) Directed Requirement was approved in November 2019.  MAPS transitions to a Capability Development Document (CDD) in June 2020 and DAPS transitions in FY 2021.\n\nA-PNT consists of four Projects; (BV4) Area Protection and Alternative Navigation (Alt Nav) Technology Development, (ED5) Assured PNT, (EH8) Dismounted A-PNT System (DAPS), and (EJ2) Mounted A-PNT System (MAPS).\n\nProject Manager (PM) PNT manages these four Project areas (Area Protection and Alt Nav capabilities, Assured PNT, DAPS, and MAPS) constructed to investigate, prototype, experiment, model, assess, develop, modify, improve resiliency, test, equip, field, and sustain A-PNT solutions.\n\nAssured Positioning, Navigation and Timing (A-PNT) consists of:\n\n(BV4) - The Area Protection and Alt Nav Technology Development project supports the transition of technologies from industry, academia, and government Science & Technology organizations, and consequent development of alternative and complementary PNT technologies for integration into Mounted A-PNT System (MAPS) and Dismounted A-PNT System (DAPS). Area Protection & Alt Nav Technologies will be developed in order to demonstrate Alternative Navigation (ALTNAV), emerging complementary PNT, and net-enabled GPS solutions to provide Radio Frequency (RF) and non-RF threat mitigation.\n\n(ED5) - The Assured PNT project funding line is for Resiliency and Software Assurance Measures (RSAM) software upgrades to legacy military GPS receivers. This line also supports the completion of network integration, installation and testing of ALTNAV signal enterprise build-out.\n\n(EH8) - The Dismounted A-PNT System (DAPS) will provide the Soldiers equipped with Nett Warrior and other Soldier architecture compliant systems (e.g. Integrated Visual Augmentation System (IVAS)) conducting operations outside of vehicles, unhindered access the critical timing and position data to effectively engage targets, share data across the network and conduct mission command functions.\n\n(EJ2) - The Mounted A-PNT System (MAPS) is a platform-mounted, ruggedized tactical PNT system which provides electronic protection capabilities that provide Army forces the ability to move, shoot, communicate, and provide situational awareness in Global Positioning System (GPS) challenged or denied environments. Included in the MAPS is the Anti-Jam Antenna System (AJAS) which provides GPS signal point protection and PNT Assurance in challenged environments through Anti-Jam, non-Radio Frequency, and alternate navigation technologies. AJAS enables tactical capabilities through assured signal acquisition in challenged environments. The AJAS will assist in delivering distributed assured PNT capabilities to mounted platforms over time in an iterative, affordable manner that allows for future modernization."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "128.125"
                },
                "BudgetYearOneBase": {
                    "val": "128.125"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "128.125"
                },
                "BudgetYearOneBase": {
                    "val": "128.125"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "128.125"
                                },
                                "BudgetYearOneBase": {
                                    "val": "128.125"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Program Element (PE) 0604120A restructured from PE1206120A in FY 2021."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "BV4"
                    },
                    "ProjectTitle": {
                        "val": "Area Protection and Alt Nav Technology Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "18.84"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.84"
                        },
                        "BudgetYearTwo": {
                            "val": "12.181"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "31.021"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Restructured from PE 1206120A Assured Positioning, Navigation and Timing \/ project FJ8, beginning in FY 2021."
                        },
                        "ProjectMissionDescription": {
                            "val": "The primary focus of Area Protection and Alt Nav Technology Development project is to enable the effective transition of incremental and disruptive technologies to fieldable Positioning, Navigation and Timing (PNT) solutions to pace or overmatch current and evolving threats. Program activities including advanced component development, prototyping, and demonstration will bridge the gap between advanced technology development (S&T) and system development (products). It will demonstrate military utility to enable effective transitions and synergize development across products. It will also reduce or eliminate the transition of immature technologies to the product developer that potentially contribute to cost growth, schedule delays, and performance shortfalls.\n\nCurrently, military GPS is limited to two narrow frequency bands which could be defeated by our potential enemies. Additional Radio Frequency (RF) signals such as Global Navigation Satellite Systems (GNSS) and other satellite communications (SATCOM) sources integrated into PNT products and user equipment will provide alternatives against GPS jamming through frequency and source diversity. This line supports the Alternative Navigation (ALTNAV) capability and complementary PNT technologies (such as RF and non-RF technologies). ALTNAV provides frequency and source diversity to enable Army users with accurate and trusted position and time information in GPS degraded environments. ALTNAV is an instantiation of a complementary PNT technology and will include network integration, installation and testing of the infrastructure capability and user equipment. Other efforts include the continuation of situational awareness development, spectrum modification for PNT solutions, and modeling and simulation support.\n\nTo support effective transition to Mounted Assured PNT System (MAPS) and Dismounted Assured PNT System (DAPS), while minimizing integration cost and schedule, the project will develop and deliver government-owned Modular Open System Architecture (MOSA) compliant hardware & software frameworks. Evolving standards from the PNT Reference Architecture (Software and\/or Hardware) will be utilized ensuring a path to plug and play solutions. Utilization of these standards will be verified in the Modular Integration Lab.  Prior to transition, prototype compliance with a modular open suite of standards architecture will be demonstrated.\n\nThe development process will leverage commercial capabilities, existing contracts, industry, academia, DoD Science & Technology and critical Soldier touchpoints in an iterative process to transition solutions into future products, concepts of operation, architectures, and platforms to assure PNT.\n\nFY 2021 Base funds in the amount of $18.840 million will continue prototyping and evaluation of the ALTNAV capability. Funds will additionally be used for risk reduction efforts for complementary PNT technologies, modeling & simulation, and technical & operational demonstrations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Area Protection & Alt Nav Technology Development"
                                    },
                                    "Description": {
                                        "val": "The effort supports ALTNAV and complementary PNT capabilities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.84"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.84"
                                            },
                                            "Text": {
                                                "val": "FY 2021 Base funds will continue prototyping and evaluation of the ALTNAV receiver integration and fusion capabilities. Funds will additionally be used for risk reduction efforts for complementary PNT technologies, modeling & simulation, experimentation, and used to conduct a technical demonstration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Restructured from PE 1206120A Assured Positioning, Navigation and Timing \/ project FJ8, beginning in FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "EH8"
                                    },
                                    "Title": {
                                        "val": "DISMOUNTED"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "13.337"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.337"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.446"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "25.783"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "EJ2"
                                    },
                                    "Title": {
                                        "val": "MOUNTED"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "68.733"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "68.733"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.58"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "AW5"
                                    },
                                    "Title": {
                                        "val": "Modular GPS Independent Sensors Technology"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "4.14"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "4.140"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "AW6"
                                    },
                                    "Title": {
                                        "val": "Modular GPS Independent Sensors Advanced Tech"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "11.089"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.089"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.49"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.995"
                                        },
                                        "BudgetYearFour": {
                                            "val": "12.089"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.388"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "58.051"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "AV8"
                                    },
                                    "Title": {
                                        "val": "Navigation Warfare (NAVWAR) Advanced Technology"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "5.118"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.535"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.535"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.044"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.998"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.968"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.968"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "23.631"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "779"
                                    },
                                    "Title": {
                                        "val": "Command, Control And Platform Electronics Tech"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.195"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "9.195"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "101"
                                    },
                                    "Title": {
                                        "val": "Tactical Command and Control"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.042"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "20.042"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The primary focus of Area Protection and Alt Nav Technology Development (BV4) project is to enable the effective transition of incremental and disruptive technologies from multiple sources (commercial capabilities, industry, academia, DoD Science & Technology) to fieldable PNT solutions to pace or overmatch current and evolving threats.\n\nThe project includes prototyping or other demonstrations to prove out technology before it is integrated into a product. This is solidified by the following linkage:\n\n- Modular GPS Independent Sensors (AW5 & AW6)\n- Navigation Warfare (AV8)\n- Command, Control & Platform Electronics tech (779)\n- Tactical Command and Control (101)\n\nLinked to: \n\nArea Protection and Alt Nav technology development (BV4)\n\nLinked to:\n\nDismounted Assured PNT Systems (EH8)\nMounted Assured PNT Systems (EJ2)"
                        },
                        "AcquisitionStrategy": {
                            "val": "Area Protection & Alt Nav Technology Development program will utilize rapid prototyping and modeling & simulation to assess the military utility of the initial capabilities through critical Soldier touchpoints, laboratory, and field assessments to determine technology maturation for integration into Mounted Assured Positioning, Navigation, and Timing System (MAPS), Dismounted Assured Positioning, Navigation, and Timing System (DAPS), and other platforms. This will be implemented by utilizing a mix of competitive Other Transaction Authority (OTA)'s and Federal Acquisition Regulation contracts to obtain prototypes. This will inform the MAPS and DAPS CDD and other requirements documents for limited rate initial production, initial operational test & evaluation, and the full rate production decision."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management Support - Contractor"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.932"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.932"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "ALTNAV Receiver Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.556"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.556"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Complementary PNT Modeling & Simulation, and Experimentation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.813"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.813"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.813"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Modular Open System Architecture (pntOS & CMOSS)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.386"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.386"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services - Government"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.45"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.45"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services - Contractor"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCS Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.958"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.958"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "The Technical demo includes a recurring series of data driven demonstrations and evaluations of high Technical Readiness Level (TRL) operationally effective PNT solutions that transition to production easily in order to pace\/overmatch enemy PNT threat systems."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Modular Integration Lab"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.745"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.745"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "4_BV4_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "ALTNAV Receiver Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Complementary PNT Modeling & Simulation, and Experimentation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PNT Technical Demonstrations & Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Modular Opens Systems Architecture, PNT Operating System & CMOSS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ED5"
                    },
                    "ProjectTitle": {
                        "val": "Assured Positioning, Navigation and Timing (PNT)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "27.215"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.215"
                        },
                        "BudgetYearTwo": {
                            "val": "21.454"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "48.669"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This is not a new start project.  Program Element (PE) 0604120A project ED5 transitions from PE 1206120A project FJ8 Assured Positioning, Navigation and Timing beginning in FY 2021."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Assured Positioning, Navigation and Timing (PNT) project funds the Resiliency and Software Assurance Measures (RSAM) which provides increased capability and situational awareness for 500,000+ fielded legacy military Global Positioning System (GPS) receivers supporting systems and soldiers through at least 2035.  Legacy GPS receivers targeted for RSAM enhancements, include but are not limited to, 226,000 Defense Advanced GPS Receiver (DAGR) and 200,000+ embedded Ground Based-GPS Receiver Applications Module (GB-GRAM).  RSAM mitigates risks in a GPS-challenged operational environment until future Positioning, Navigation and Timing (PNT) solutions are fully deployed.  Assured PNT enablers include prototype development and testing to demonstrate and prove emerging capabilities for legacy and future PNT resilient solutions.  Assured PNT enablers also include the final phase of Alternative Navigation signal enterprise build-out, providing PNT data in a denied or degraded environment.\n\nFY 2021 base funds in the amount of $27.215 million support PNT software enhancements to Army PNT receivers and capabilities. RSAM will support continued software development of RSAM Update 2 against emerging threats to legacy military GPS receivers, to include prototype testing and risk mitigation efforts. RSAM will coordinate integrated software testing with military system managers and the test community to validate software and synchronize RSAM deployment to the user.  Assured PNT enablers include the final phase of network integration, installation and testing of Alternative Navigation signal enterprise build-out."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Resiliency and Software Assurance Measures (RSAM)"
                                    },
                                    "Description": {
                                        "val": "Funding supports the following efforts:"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.852"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.852"
                                            },
                                            "Text": {
                                                "val": "FY 2021 base funds in the amount of $20.852 million will support the release of RSAM GB-GRAM Update 1, support continued software development of RSAM DAGR Update 2 and RSAM GB-GRAM Update 2, to include prototype testing, formal qualification testing, and risk mitigation efforts. RSAM DAGR and GB-GRAM receiver integration testing efforts for Update 2 will be performed in association with relevant military vehicles and systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Element (PE) 0604120A project ED5 transitions from PE 1206120A project FJ8 beginning in FY 2021.  RDT&E funding decreased from $21.992 million in FY 2020 to $20.852 million in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assured PNT Enablers"
                                    },
                                    "Description": {
                                        "val": "Funding supports the following efforts:"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.363"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.363"
                                            },
                                            "Text": {
                                                "val": "FY 2021 base funds in the amount of $6.363 million will support the completion of network integration, installation and testing of Alternative Navigation signal enterprise build-out."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Element (PE) 0604120A project ED5 transitions from PE 1206120A project FJ8 beginning in FY 2021 to support the final phase of ALT NAV Enterprise Buildout.  RDT&E funding decreased from $20.387 million in FY 2020 to $6.363 million in FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "K49010"
                                    },
                                    "Title": {
                                        "val": "Mounted\/Dismounted Receivers"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "1.724"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.894"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.894"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.193"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.075"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.37"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.394"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "K49010 \/ Mounted\/Dismounted Receivers is an OPA subset of Line Item Number 9897K49000 \/ Assured Positioning, Navigation and Timing."
                        },
                        "AcquisitionStrategy": {
                            "val": "Positioning, Navigation and Timing (PNT) Resiliency and Software Assurance Measures (RSAM) will provide software improvements to legacy military GPS receivers by awarding contracts to the original equipment manufacturers and industrial partners and leveraging the test community to develop and characterize prototypes and final software solutions.  PNT Enablers will utilize a mix of competitive Other Transaction Authority (OTA)'s, Federal Acquisition Regulation contracts, and other contract vehicles to partner with industry to define, develop, procure and test prototypes to determine technologies for future PNT solutions."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.693"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.475"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.475"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.168"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "RSAM - DAGR Software Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Rockwell Collins"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cedar Rapids, IA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.643"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.201"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.201"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.844"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RSAM - GB-GRAM Software Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Rockwell Collins"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cedar Rapids, IA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.286"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.671"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.671"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.957"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Assured PNT Enablers"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.476"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.363"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.363"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.839"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RSAM - MicroGRAM Software Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Rockwell Collins"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cedar Rapids, IA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.427"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.427"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.427"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Contracting Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCS Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.445"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.502"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.502"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.947"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Government Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.057"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.358"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.358"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.415"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "RSAM - Government Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.827"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.676"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.676"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.503"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RSAM - Contractor Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCS Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.278"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.648"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.648"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.926"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Platform Integration Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.675"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.574"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.574"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.249"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RSAM Test Equipment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.25"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.32"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.32"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.570"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "4_ED5_0.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "4_ED5_1.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "RSAM - Update 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DAGR Software Development and Testing Update 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GB-GRAM Software Development and Testing Update 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Platform Integration Testing Update 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSAM DAGR Software Release Update 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSAM GB-GRAM Update 1 Software Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSAM Update 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSAM DAGR Software Development and Testing Update 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSAM GB-GRAM Software Development and Testing Update 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSAM - MicroGRAM Software Development and Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Platform Integration Testing Update 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSAM DAGR Update 2 Software Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSAM GB-GRAM Update 2 Software Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSAM MicroGRAM Software Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSAM DAGR and GB-GRAM Post Software Release Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Assured PNT Enablers"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EH8"
                    },
                    "ProjectTitle": {
                        "val": "DISMOUNTED"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "13.337"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.337"
                        },
                        "BudgetYearTwo": {
                            "val": "12.446"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "25.783"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This is not a new start project. Program Element (PE) 0604120A project EH8 transitions from PE1206120A project FJ9 beginning in FY 2021."
                        },
                        "ProjectMissionDescription": {
                            "val": "Dismounted Assured PNT (A-PNT) System (DAPS) implements congressional and OSD guidance to develop and field Military Code (M-Code) Ground User Equipment (MGUE) receivers and provides the Soldiers equipped with Nett Warrior (NW) and other Soldier architecture compliant systems (e.g. Integrated Visual Augmentation System (IVAS)) the critical timing and position data to effectively engage targets, share data across the network, and conduct mission command functions. DAPS is planned to be a size, weight and power (SWaP) optimized form-factor that paces the threats and includes development and integration of Global Positioning System (GPS) and non-GPS sensors. DAPS integrates with the NW system and other Soldier architecture compliant systems, and distributes PNT information to the End-User Device (EUD). DAPS includes receiver software capable of fusing sensors and Global Navigation Satellite Systems (GNSS) signals resulting in additional integrity for military GPS in denied environments and includes a M-Code receiver solution, or a Selective Availability Anti-Spoofing Module (SAASM) system with growth path to M-Code.  \n\nThrough an iterative approach, DAPS will continue to fuse M-Code, GNSS, and non-GPS sensors, as well as fuse Alternate Navigation (ALTNAV) and other complementary PNT sources in a SWaP constrained system in order to pace\/overmatch the threat and continue to deliver critical timing and position data to effectively engage targets, share data across the network, and conduct mission command functions.\n\nFY 2021 Base funds in the amount of $13.337 Million will continue current DAPS prototype variants, followed by final acceptance testing and certification. Funds will converge ALTNAV and complementary PNT hardware and software for planned and emerging DAPS improvements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Dismounted A-PNT System (DAPS)"
                                    },
                                    "Description": {
                                        "val": "This effort supports the development and delivery of DAPS prototypes for integration, assessment  and performance testing."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.337"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.337"
                                            },
                                            "Text": {
                                                "val": "FY 2021 Base funds in the amount of $13.337 Million will continue current DAPS prototype variants, followed by final acceptance testing and certification. Funds will converge ALTNAV and complementary PNT hardware and software for planned and emerging DAPS improvements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Element (PE) 0604120A project EH8 transitions from PE1206120A project FJ9 beginning in FY 2021. Funding decreased from PE1206120A project FJ9 from $32.360 Million in FY 2020 to $13.337 Million in FY 2021 on Program Element (PE) 0604120A project EH8.  This reduction is based upon transitioning from development into production."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "K49020"
                                    },
                                    "Title": {
                                        "val": "Dismounted Hub"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "48.449"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "48.449"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "49.57"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.458"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.063"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.96"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "BV4"
                                    },
                                    "Title": {
                                        "val": "Area Protection and Alt Nav Technology Development"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "18.84"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "18.84"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.181"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "31.021"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "K49020 \/ Dismounted Hub is an OPA subset of Line Item Number 9897K49000 \/ Assured Positioning, Navigation and Timing.\n\nRisk reduction prototyping efforts from 0604120A BV4 Area Protection and Alt Nav Technology Development will transition PNT Modernization\/complementary PNT capabilities to the Dismounted A-PNT System (DAPS)."
                        },
                        "AcquisitionStrategy": {
                            "val": "The DAPS strategy consists of the continuous refinement of the current DAPS material solution through an operational approach that incorporates congressionally and OSD mandated transition to M-Code and includes minimizing risk to the operational force by delivering the best available technology to fulfill critical capability gaps that outpace emerging threat environments. DAPS will provide the Soldier conducting operations outside of vehicles the means to maintain accurate position, velocity,and time information in a Global Positioning System (GPS) challenged or degraded\/denied environments where space based PNT may be limited or denied. DAPS will provide improved performance over the currently fielded Defense Advanced GPS Receiver (DAGR).\n\nDAPS will use an iterative acquisition approach and is structured to incrementally develop, deliver and field DAPS capabilities through continued development of emerging technologies. Follow-on capabilities will build on the previous technology and incorporate complementary PNT technologies as they mature. This \"buildingblock\" approach will continue until DAPS capabilities fully meet the requirements.\n\nThe first iteration of capabilities will employ tailored processes to identify and close key technology gaps. Technologies available from Industry today will be evaluated for performance and operational suitability and equipped to select critical units. This will be implemented by utilizing Other Transaction Authority (OTA) agreements and\/or other FAR based mechanisms to competitively obtain prototypes. The Government will conduct laboratory, performance and field testing. The findings from these efforts will provide technology viability and allow for the transition to limited production. Providing initial equipment to specified units will result in an assessment to determine production and fielding readiness of the capability."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management Support - Contractor"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.618"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.618"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DAPS Prototyping"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.373"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.373"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.85"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.85"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.850"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services - Government"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.353"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.353"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services - Contractor"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCS Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.381"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.381"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Evaluations"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.762"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.762"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.762"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "4_EH8_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "DAPS Prototyping & Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DAPS Nett Warrior Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DAPS Prototyping Operational Technical Demonstration (OTD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DAPS Capability Development Document (CDD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DAPS Milestone C Production Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DAPS Low Rate Initial Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DAPS Initial Operational Test & Evaluation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DAPS Production & Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DAPS Complementary PNT Prototyping"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DAPS ALTNAV Handheld Prototyping"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DAPS Complementary & ALTNAV Handheld Production & Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2026"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EJ2"
                    },
                    "ProjectTitle": {
                        "val": "MOUNTED"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "68.733"
                        },
                        "BudgetYearOneBase": {
                            "val": "68.733"
                        },
                        "BudgetYearTwo": {
                            "val": "20.58"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This is not a new start project. Program Element (PE) 0604120A Project EJ2 transitions from PE1206120A, combining Project FK2 Mounted and Project FK3 Anti-Jam Antenna for the MAPS systems in FY 2021."
                        },
                        "ProjectMissionDescription": {
                            "val": "Mounted Assured Positioning, Navigation and Timing System (MAPS) implements congressional and OSD guidance to develop and field M-code Ground User Equipment (MGUE) receivers and provides the Army's ground maneuver forces access to assured PNT information under conditions where space-based PNT Global Positioning System (GPS) may be limited or denied. A-PNT products are ruggedized tactical systems which provides electronic protection capabilities that enable Army forces the ability to move, shoot, communicate, and provide situational awareness in Global Positioning System (GPS) challenged or denied environments. MAPS addresses two critical capability gaps: Access and Integrity. Access is the ability to retrieve PNT information in a contested Electronic Warfare\/Cyber environment. Integrity is the ability to trust the PNT information. PNT is a critical enabler of many Army Maneuver, Fire and Command and Control systems that are dependent on accurate Position and Timing. Included in the MAPS is the Anti-Jam Antenna System (AJAS) which provides GPS signal point protection. The AJAS will assist in delivering distributed assured PNT capabilities to mounted platforms over time in an iterative, affordable manner that allows for future modernization.\n\nFY 2021 Base dollars in the amount of $68.733 million support system engineering and management support, integration, testing and training of the MAPS capability for client platforms."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mounted A-PNT System (MAPS)"
                                    },
                                    "Description": {
                                        "val": "This effort supports development of and documentation for client platform integration, technical data packages for Mounted Assured Positioning, Navigation, and Timing (PNT) System (MAPS) in preparation for Initial Operational Test and Evaluation.  Early integration will accelerate Full Rate Production fielding."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "68.733"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "68.733"
                                            },
                                            "Text": {
                                                "val": "FY 2021 Base dollars in the amount of $68.733 million support system engineering and management support, integration, testing and training of the MAPS capability for client platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Element (PE) 0604120A project EJ2 transitions from PE1206120A project FK2 beginning in FY 2021.  Funding increased from PE1206120A project FK2 from $66.471 Million in FY 2020 to $68.733 Million in FY 2021.  The increase is due to Program Element (PE) 0604120A Project EJ2 transition from PE 1206120A, combining Projects FK2 Mounted and FK3 Anti-Jam Antenna."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "K49030"
                                    },
                                    "Title": {
                                        "val": "Mounted Hub A-PNT"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "41.728"
                                        },
                                        "BudgetYearOne": {
                                            "val": "93.151"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "80.585"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "12.566"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "81.623"
                                        },
                                        "BudgetYearThree": {
                                            "val": "153.841"
                                        },
                                        "BudgetYearFour": {
                                            "val": "94.775"
                                        },
                                        "BudgetYearFive": {
                                            "val": "97.866"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "BV4"
                                    },
                                    "Title": {
                                        "val": "Area Protection and Alt Nav Technology Development"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "18.84"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "18.84"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.181"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "31.021"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "K49030 \/ Mounted Hub A-PNT is an OPA subset of Line Item Number 9897K49000 \/ Assured Positioning, Navigation and Timing.\n\nRisk reduction prototyping efforts from 0604120A BV4 Area Protection and Alt Nav Technology Development will transition PNT Modernization\/complementary PNT capabilities to the Mounted A-PNT System (MAPS)."
                        },
                        "AcquisitionStrategy": {
                            "val": "The MAPS acquisition strategy consists of the continuous refinement of the current MAPS material solution through an operational approach that incorporates congressionally and OSD mandated transition to M-code and includes minimizing risk to the operational force by delivering the best available technology to fulfill critical capability gaps that outpace emerging threat environments. The MAPS program will utilize the iterative approach by continuous frontloading of operational assessments, Soldier touchpoints, and evaluations to finalize decisions for the MAPS material solution to one vendor design. MAPS is leveraging competitive Other Transaction Authority (OTA) agreements to prototype and assess industry capabilities. MAPS will conduct Electromagnetic Interference and Environmental Testing, as well as performance testing in the System Integration Lab (SIL), anechoic chamber testing and an Operational Technical Demonstration in the most affordable manner that allows for future modernization. Both the Capability Development Document and the Basis of Issue Plan will be approved in FY2020."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management Support - Contractor"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.574"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.574"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.574"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Mounted PNT Integration - Combat Platforms"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.927"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.927"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.927"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Mounted PNT Integration - Combat Support Platforms"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "27.51"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "27.51"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "27.510"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Mounted PNT Integration - Combat Systems Platforms"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.19"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.19"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.190"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Production Maturation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.099"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.099"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.099"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Client Software Development (JBCP)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.295"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.295"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.295"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technical Manuals and Support Equipment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.406"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.406"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.406"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services - Government"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "C5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.038"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.038"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.038"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services - Contractor"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.513"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.513"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.513"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "New Equipment Training (NET)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.667"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.667"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.667"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Field Testing \/ Development Test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.514"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.514"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.514"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "4_EJ2_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Mounted A-PNT Prototyping and Testing - Phase I"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Mounted A-PNT Test and Integration - Phase II"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Client and Platform Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Operational Tech Demonstration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Direct Requirement Decision Preferred Material Solution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MAPS Technology Insertion - AltNav"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Field Testing \/ Developmental Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone C Low Rate Production Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LRIP Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Operational Test & Evaluation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Rate Production Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FRP Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MAPS Technology Insertion"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}