{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-34",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602785A"
        },
        "ProgramElementTitle": {
            "val": "Manpower\/Personnel\/Training Technology"
        },
        "R1LineNumber": {
            "val": "40"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "17.157"
            },
            "CurrentYear": {
                "val": "20.873"
            },
            "BudgetYearOne": {
                "val": "20.766"
            },
            "BudgetYearOneBase": {
                "val": "20.766"
            },
            "BudgetYearTwo": {
                "val": "19.039"
            },
            "BudgetYearThree": {
                "val": "19.273"
            },
            "BudgetYearFour": {
                "val": "18.67"
            },
            "BudgetYearFive": {
                "val": "17.01"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "132.788"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) designs and validates applied behavioral and social science research to enhance the Soldier Lifecycle (e.g., selection, assignment, training, and leader development) and human relations (e.g., unit cohesion). This PE develops new personnel measures and methods that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective Talent Management methods to optimize individual and team performance to ensure the Army can meet mission requirements in uncertain and complex environments. This PE develops new performance measures and metrics for individuals and units, designs innovative training methods, and conducts scientific assessments to inform Human Capital policy and programs.  Research in this PE will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints. \n\nWork in this PE complements PE 0603007A (Manpower, Personnel and Training Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Vision, the Army's Talent Management Strategy, and the Army Modernization Strategy.  \n\nWork is performed by the Army Research Institute (ARI) for the Behavioral and Social Sciences at Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.847"
                },
                "CurrentYear": {
                    "val": "20.873"
                },
                "BudgetYearOne": {
                    "val": "21.268"
                },
                "BudgetYearOneBase": {
                    "val": "21.268"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.157"
                },
                "CurrentYear": {
                    "val": "20.873"
                },
                "BudgetYearOne": {
                    "val": "20.766"
                },
                "BudgetYearOneBase": {
                    "val": "20.766"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.69"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-0.502"
                },
                "BudgetYearOneBase": {
                    "val": "-0.502"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-4.2"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.49"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.502"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.502"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY19 decrease related to funds reprogrammed out for higher priority Army requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "790"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Performance & Training Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.157"
                        },
                        "CurrentYear": {
                            "val": "20.873"
                        },
                        "BudgetYearOne": {
                            "val": "20.766"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.766"
                        },
                        "BudgetYearTwo": {
                            "val": "19.039"
                        },
                        "BudgetYearThree": {
                            "val": "19.273"
                        },
                        "BudgetYearFour": {
                            "val": "18.67"
                        },
                        "BudgetYearFive": {
                            "val": "17.01"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "132.788"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied behavioral and social science research to enhance the Soldier Lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., unit cohesion). This Project develops new personnel measures and methods that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective Talent Management methods to optimize individual and team performance to ensure the Army can meet mission requirements in uncertain and complex environments. This Project develops new performance measures and metrics for individuals and units, designs innovative training methods, and conducts scientific assessments to inform Human Capital policy and programs. Research in this Project will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints.   \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Vision, the Army's Talent Management Strategy, Army Human Capital Strategy, and the Army Modernization Strategy.\n\nThis Project is renamed from Personnel Performance and Training Technology to reflect the change in work that supports Army priorities.\n\nWork is performed by the United States Army Research Institute (ARI) for the Behavioral and Social Sciences in Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Talent Assessment and Development"
                                    },
                                    "Description": {
                                        "val": "This effort conducts applied research that provides the Army with innovative approaches to personnel assessment, improved prediction and modeling of personnel outcomes (e.g., attrition, retention) and an improved capability to improve prediction and modeling (e.g., potential performance, behaviors, attitudes, and resilience of Soldiers). Conducts applied research to provide the Army with effective leader assessment and development methods to measure, develop, and sustain individual\/leader competencies and performance across the Soldier life cycle. Conducts research to create scientifically valid models, tools and techniques for team assignment and development to optimize team effectiveness in-garrison and future operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13"
                                            },
                                            "Text": {
                                                "val": "Conducted research to develop a vocational interest inventory for increased prediction and selection of individual assignments and performance within select critical Military Occupational Specialties (e.g. cyberwarfare); conducted research for the application of non-cognitive measures to inform branching choices for cadets to support sustainment of professional military careers and reduce Soldier attrition costs; due to decrease in funding, research in Big Data applications to develop automatically generated test items for personnel assessment and research in innovative approaches to automate job analysis will be delayed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.357"
                                            },
                                            "Text": {
                                                "val": "Conduct research to develop non-cognitive assessments for in-service assignments and initial job-choice for enlisted and officer candidates (e.g., cyber occupations) and other military occupational specialties (MOS) & Branches; conduct research to develop outcome measures for more comprehensive assessment of the effectiveness of personnel and training programs\/policy; conduct research to develop methods for assessing and developing complex leader competencies to perform effectively in multi-domain operations (e.g., systems and strategic thinking)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.766"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.766"
                                            },
                                            "Text": {
                                                "val": "Will conduct research to develop new proof of concept measures to improve integrated personnel assessments that holistically capture the individual attributes that predict job performance, job satisfaction, resilience, attrition, and continuance; will conduct research to develop evidence-based methods to improve assessments of teams-based assignments, leader competencies, collective performance, and team process enablers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Team-Based Personnel Assignment and Development"
                                    },
                                    "Description": {
                                        "val": "This effort conducts research to create scientifically valid models, tools and techniques to assign individuals to teams to optimize team effectiveness in-garrison and future operational environments. Conduct research to create science-based methods to rapidly build team cohesion and collective performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.157"
                                            },
                                            "Text": {
                                                "val": "Completed research to develop empirically validated climate assessments based on objective behaviors (e.g., behavior checklists, unobtrusive measures) that efficiently and accurately assess key aspects of command climate; initiated research to develop methods to assess performance in non-traditional teams (e.g., dispersed, diverse, new tasks\/missions); continued research to create integrated assessments of individual Soldier and unit readiness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.516"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}