{
    "id": "2021-SpaceDevelopmentAgency-PB-0400-MJBOOK-0-10-7785e498f08da31904e836881ba7711c1e6b2127a147e20d7386b2865869377d-0",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Space Development Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1206310SDA"
        },
        "ProgramElementTitle": {
            "val": "Space Science and Technology Research and Development"
        },
        "R1LineNumber": {
            "val": "71"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Space Development Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "20.000"
            },
            "BudgetYearOne": {
                "val": "72.422"
            },
            "BudgetYearOneBase": {
                "val": "72.422"
            },
            "BudgetYearTwo": {
                "val": "187.638"
            },
            "BudgetYearThree": {
                "val": "452.790"
            },
            "BudgetYearFour": {
                "val": "677.290"
            },
            "BudgetYearFive": {
                "val": "517.290"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Space Development Agency (SDA) is developing and fielding next generation space capabilities enabled by proliferation and a new acquisition model utilizing rapid spiral development.  SDA is developing capabilities to address a wide range of Department space needs, including low-latency tactical communication, beyond line of sight targeting, and advanced missile tracking.  Specifically, the SDA will demonstrate and field persistent, resilient capabilities needed to be responsive to emerging multi-domain threats against the U.S. national interest. The SDA will be responsible for overall programmatic policy development and execution for next-generation military space capabilities, except those funded in the Military Intelligence Program (MIP).  In coordination with other DoD Space stakeholders, the SDA will drive the development of space capabilities to achieve the DoD space vision and reduce overlap and inefficiency.  The SDA will expand the Department's space warfighting capability and foster growth in the U.S. space industrial base, the SDA will incorporate enhanced government-commercial relationships and international collaboration with key allies and partners.\n\nWhile SDA is not responsible for building and fielding all layers of the National Defense Space Architecture, it is responsible for ensuring capability deliveries.  In this construct, SDA is responsible for building and fielding the Transport layer, a proliferated constellation of satellites to provide low latency, high volume data to the warfighter.  This transport layer will be compatible with the architecture defined by Fully Networked Command, Control, and Communications Network.\n\nThe establishment of a proliferated data transport layer is essential to developing a new and responsive space architecture.  The SDA will develop additional sub-constellations on this transport layer to provide additional capabilities, such as advanced missile warning, custody and alternative position, navigation and timing (PNT).\n\nThis program element funds efforts to develop and demonstrate a prototype proliferated communications and data transport layer and other capability layers in support of the National Defense Strategy."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "20.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "20.000"
                },
                "BudgetYearOne": {
                    "val": "72.422"
                },
                "BudgetYearOneBase": {
                    "val": "72.422"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "72.422"
                },
                "BudgetYearOneBase": {
                    "val": "72.422"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "72.422"
                                },
                                "BudgetYearOneBase": {
                                    "val": "72.422"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The increase in FY 2021 is to support technology demonstrations."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "032"
                    },
                    "ProjectTitle": {
                        "val": "Proliferated Low Earth Orbit (pLEO) Sensor Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "20.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Space Technology Development and Prototyping effort will develop and demonstrate a prototype proliferated Low Earth Orbit (pLEO) data transport layer and other capability layers to provide the eight capabilities outlined in the DoD Space Vision.  The SDA will rapidly develop and field the next generation space architecture that will enable the US to deploy space capabilities that out-pace adversarial threats.  This architecture is underpinned by a data transport layer, which will reside on a proliferated small satellite constellation in Low Earth Orbit (LEO).  The Transport Layer will support the transfer of data between the space segment of the next generation space architecture, to include payloads co-hosted with the Transport Layer or other non-collocated space elements, and the ground, to include ground support infrastructure and very large numbers of users\/subscribers.  The Transport Layer will provide the \"connective tissue\" for the next generation space architecture."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Proliferated Low Earth Orbit (pLEO) Sensor Technology"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate a resilient and unified military data transport layer, enabled by a proliferated Low Earth Orbit (pLEO) architecture.  This effort will demonstrate capability to provide very low latency (low or high bandwidth) data between any two points on the globe to enable mission-agnostic battle management, command, control, and communications (BMC3). This effort will leverage technologies developed under the DARPA Blackjack program and, wherever feasible, leverage commercial industry approaches to provide broadband internet access from space to form the foundation of the transport layer architecture."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct trade studies and feasibility assessments of different sensor modalities to perform national security space missions.\n-  Conduct Preliminary Design Review (PDR) of selected sensor payload(s)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There was no planned funding in FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Partners for these activities may include Missile Defense Agency, DARPA, DoD research centers, small businesses, large defense contractors, commercial space providers, Federally Funded Research and Development Centers, and University Affiliated Research Centers."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "12"
                    },
                    "ProjectTitle": {
                        "val": "Space Development Agency R&E"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "72.422"
                        },
                        "BudgetYearOneBase": {
                            "val": "72.422"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "187.638"
                        },
                        "BudgetYearThree": {
                            "val": "452.790"
                        },
                        "BudgetYearFour": {
                            "val": "677.290"
                        },
                        "BudgetYearFive": {
                            "val": "517.290"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Space Development Agency (SDA) is developing and fielding next generation space capabilities enabled by proliferation and a new acquisition model utilizing rapid spiral development.  SDA is developing capabilities to address a wide range of Department space needs, including low-latency tactical communication, beyond line of sight targeting, and advanced missile tracking.  SDA will orchestrate the rapid development and fielding of the National Defense Space Architecture (NDSA), a resilient military sensing and data transport capability via a proliferated space architecture in low-earth orbit. \n\nThis program element funds the research and development activity to deliver capabilities to US joint warfighting forces in two-year tranches, beginning as early as FY22, including performing trade studies, technical analyses, or modeling and simulation; identifying and maturing enabling technologies; defining and conducting risk reduction demonstrations, prototyping hardware or software systems; and exploring novel concept for future warfighting capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Technology Development Agency R&D"
                                    },
                                    "Description": {
                                        "val": "Research and development activities to support development and fielding of a resilient military sensing and data transport capability via a proliferated space architecture in LEO"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "72.422"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "72.422"
                                            },
                                            "Text": {
                                                "val": "- Design, develop, and demonstrate space-to-space optical crosslink data exchange in LEO\n - Design and begin development of wide field-of-view payload for advanced missile tracking experiment\n- Conduct requirements review for multi-INT data fusion algorithms"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY 2021 is to support technology demonstrations."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "Partners for these activities may include DoD research centers, small businesses, large defense contractors, commercial space providers, Federally Funded Research and Development Centers, University Affiliated Research Centers, Missile Defense Agency, SMC, and DARPA."
                        }
                    }
                }
            ]
        }
    }
}