{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-18",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602303A"
        },
        "ProgramElementTitle": {
            "val": "Missile Technology"
        },
        "R1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "90.496"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "90.496"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020, this Program Element (PE) is realigned with continuity of effort to the following PEs:\nPE 0602147A Long Range Precision Fires Technology\nPE 0602148A Future Vertical Lift Technology\nPE 0602150A Air and Missile Defense Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE designs, fabricates and evaluates advanced component technologies for tactical missiles, rockets, guided munitions, and their launch systems in order to increase lethality, precision, and effectiveness under adverse battlefield conditions while reducing system cost, size and weight. Major goals in Project 214 include enhancing the survivability of the munition, launch and fire control systems and increasing kill probabilities against diverse targets.\n\nWork in this PE is complimentary to PE 0603313A (Missile and Rocket Advanced Technology) and fully coordinated with PE 0602307A (Advanced Weapons Technology), PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0602782A (Command, Control, Communications Technology), and PE 0708045A (End Item Industrial Preparedness Activities). \n\nBeginning in FY20, work in this PE is complimentary to PE 0603464A (Long Range Precision Fires Advanced Technology), PE 0603465A (Future Vertical Lift Advanced Technology), PE 0603463A (Network\/C3I Advanced Technology), and PE 0603466A (Air and Missile Defense Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "91.647"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "90.496"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.151"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.151"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "214"
                    },
                    "ProjectTitle": {
                        "val": "Missile Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "48.996"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "48.996"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to:\nProgram Element (PE) 0602147A Long Range Precision Fires Technology:\n* Project AE7 Land-Based Anti-Ship Missile (LBASM) Technology\n* Project AF1 Long Range Maneuverable Fires (LRMF) Technology\n* Project AF3 Extended Range Propulsion Technology\n* Project AF5 Simulation and Aerostructures Technology\n* Project AF6 Structures Technology\n* Project AF7 Warhead Integration Technology\n* Project AF8 Affordable Extended Range Precision Technology\n* Project AF9 Precision and Accuracy Technology\n* Project AG1 Missile Electronics Technology\n* Project AG2 Information and Signal Processing Technology\n* Project AG9 Multiple Simul Engagement Technologies (MSET) Tech\n* Project AH2 Single Multi-mission Attack Missile (SMAM) Technol\nPE 06020148A  Future Vertical Lift Technology:\n* Project AK4 Multi-Role Small Guided Missile Technology\nPE 0602150A Air and Missile Defense Technology:\n* Project AD3 Maneuver Air Defense Technology\n* Project AD5 Next Generation Fires Radar Technology \n* Project AD7 Missile Fire Control Sensors Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs, fabricates, and evaluates missile and rocket component technologies that support demonstration of affordable, lightweight, highly lethal missiles and rockets. Major areas of research include: guidance, navigation, and controls; target acquisition systems; multi-spectral seekers; high-fidelity simulations; sustainment; aerodynamics and structures; launch systems, fire control technologies; payloads; and propulsion including research to help solve the insensitive munitions requirements. A theme embedded throughout the efforts in this project is smaller, lighter, and cheaper (SLC) missile technology to reduce the cost and logistical burden of precision munitions. \n\nThis Project supports the Army Science and Technology Lethality and Command, Control, Communications and Intelligence (C3I) portfolios.\n\nMajor products of this Project transition to PE 0603313A (Missile and Rocket Advanced Technology).\n \nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Missile Seeker Technology"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the design, fabrication and evaluation of missile seekers, sensors, and software.  The goal is to increase affordability and performance of missile seekers through improvement of algorithms, imaging, and thermal management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.648"
                                            },
                                            "Text": {
                                                "val": "Enhanced infrared passive precision acquisition and tracking algorithms for true fire-and-forget engagements in global positioning system (GPS)-denied environments; designed, fabricated and evaluated novel mechanical designs utilizing additive manufacturing and new materials for optical sensor applications to enable lower cost infrared seeker optics; performed design analysis to determine man-portable, Air Defense missile seeker requirements and developed robust seeker modeling and simulation tools to verify design parameter; designed, fabricated and evaluated technologies that support a low cost, strap down, active, electro-optic seeker system for counter unmanned aerial systems (UAS) and counter ground target missiles; designed concepts for a multi-band active optical tracker that laser-designates small UAS to increase probability of defeat for seeker based kinetic weapons."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile Guidance, Navigation and Controls Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates and evaluates guidance, navigation, and control systems and software, as well as information and signal processing systems for rocket and missile applications. Goals of this effort include more affordable missile guidance; miniaturization of guidance electronics; maintaining performance in Global Positioning System (GPS) denied environments; improved image processing; improved missile power systems; improved communication with ground and other systems; technologies to track and respond to threat and offensive munition swarms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.225"
                                            },
                                            "Text": {
                                                "val": "Performed investigation and performance analysis of a multi-sensor survey emplacement system for GPS degraded or denied environments; fabricated and developed microelectromechanical systems (MEMS) concentric proof mass gyroscope for next generation inertial sensor; investigated radio frequency (RF) ? based navigation via RF range-finding datalinks as a GPS-independent position aid; investigated a non-line-of-sight datalink for airborne loitering missiles with air\/ground launch capability; completed evaluation of experimental articles for increased current capacity batteries for long range, small guided missiles; developed magnetoelectric composites, advanced system-on-chip (SoC) integrated circuit electronics parts, and designed processes that reduce the amount of thermal buildup enabling significant improvements in overall material performance and size\/weight reduction; developed a four dimensional (4-D) printing technology where the printed device properties vary continuously throughout the structure creating a material with varied resistive, graded dielectric, electrical, and thermal management to support RF components; further developed and evaluated laser source filters for semi-active Laser seeker optics, advanced machine intelligence, and image processing techniques for enhanced target acquisition and engagement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile Fire Control Systems, Sustainment, Simulations, and Launchers"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates fire control and tracking sensor technologies for area protection and air defense, technologies to increase the longevity of developed missiles and reliability, advanced simulations to increase performance and reduce size, weight, and cost of missile systems, and launcher technology to deliver effects from air and ground platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.851"
                                            },
                                            "Text": {
                                                "val": "Further developed DART technologies; designed and developed the full array beginning with RF characterization, digital beam forming evaluations, and algorithm and scenario development; maintain compatibility with Future Fires Radar open systems architecture back-end processing; refined and increased capabilities for target identification and discrimination algorithms utilizing threat flight dynamics and multiple sensors; developed amplitude modulated pulse waveforms for next generation radars and seekers in order to improve target resolution and discrimination for challenging air defense scenarios; developed a generic algorithm and design antennas that allow the use of non-linear conformal antenna structures across any arbitrary array and operating frequency to reduce effective sensor size, weight, and power (SWAP); investigated and designed an open\/modular architecture for future missile health monitoring units (HMUs) that address shortfalls\/limitations in existing fielded capability and accommodate lower cost\/quicker expansion of missile HMU capability; developed and demonstrated subscale novel conductive materials capable of supplementing battery life, and also have the ability to be electrically ignited to increase lethality; developed modeling & simulation capabilities of hypersonic vehicles in low density flows at high altitude and developed a supersonic inlet code tailor made for air breathing missile propulsion enabling rapid design decisions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile Propulsion, Structures, Lethality, and Aerodynamic Technology"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates, evaluates and tests missile enabling technologies including: advanced missile propulsion with reduced launch signatures; increased lethality and reduced weight and size using advanced materials and additive manufacturing. Missile Propulsion, Structures and Lethality efforts are in coordination with PE 0602618A (Ballistics Technology) \/ Project H80 (Survivability and Lethality Technology) and PE 0602624A (Weapon and Munition Technology) \/ Project H28 (Warheads\/Energetics Technologies)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.142"
                                            },
                                            "Text": {
                                                "val": "Investigated and characterized enabling energetic technologies for applications to missile propellants; performed final characterization and evaluation of next generation minimum smoke propellants that improve missile performance via reduced burning rate sensitivity; further developed low-cost integral rocket ramjet technology for extended range deep strike capability; demonstrated techniques for reducing rocket motor light emissions sufficient to defeat adversary?s launch detection methods for increased survivability; developed advanced hardware and subsystem technology to enable mission flexibility via dual pulse motor for future small guided missiles from rotary wing and UAS platforms; designed and developed high performance variable thrust and impulse technologies that can efficiently operate over extended duty cycles, altitudes, and tactical temperatures providing enhanced capabilities against highly maneuverable targets; designed and analyzed high temperature materials supporting high flight speed missiles and dynamic end game scenarios; further developed modeling tools, additive manufacturing processes, and materials to optimize performance and reducing weight and cost of missile structures; developed and performed proof of principle testing of novel warhead technologies for providing overwhelming catastrophic effects against current and emerging threat vehicles to include Main Battle Tanks (MBT); designed and developed warhead subsystem analysis of advanced shaped charge, explosively formed penetrators, and fragmentation technologies to enhance warfighter lethality and provide overmatch; developed lethality simulations utilized for trade space and predicting the probability of kill for multiple-purpose warhead configurations against multiple target classes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Role Missile Technology"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates critical technology and designs component for future affordable rockets and missiles to provide overwhelming defeat of conventional and asymmetrical threats in all environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.728"
                                            },
                                            "Text": {
                                                "val": "Matured modular missile technology components and open system architecture into subsystems and verified subsystem performance for the drop\/glide variant in bench-level and laboratory environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Defense Missile Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and provides technologies and performs necessary trade studies to provide the key components for maturation and demonstration of air defense missiles to counter threats such as UAS and cruise missile systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.3"
                                            },
                                            "Text": {
                                                "val": "Furthered the design of critical air defense interceptor technologies and components; matured guidance electronics units for the Ballistic and Control Test Vehicle evaluations and conducted Ballistic Test Vehicle Flight Testing; matured the control actuation system and demonstrate it in laboratory dynamic flight test simulation apparatus; continued to develop software algorithms to fuse data from radar, electro-optical\/Infrared, and acoustic sensors enabling a common operating picture of threat unmanned aerial systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Affordable Precision Missile Enabling Technology"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the studies, design, establishment, fabrication, and evaluation of components and subsystems critical to produce affordable discriminate extended range precision missiles. Critical component technologies include: advanced propulsion, seekers\/sensors, fire control, datalink, guidance, navigation and controls, and airframes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.223"
                                            },
                                            "Text": {
                                                "val": "Performed trade studies, develop concepts, generate designs, and explored technologies for affordable discrimination of extended range precision missiles for indirect fires capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Fires Enabling Technology"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on performing the necessary trade studies, and designing, establishing, fabricating and evaluating critical component technologies needed to support a long range fires capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.552"
                                            },
                                            "Text": {
                                                "val": "Continued to develop and evaluate emerging navigation technologies and techniques; designed navigation system integration architectures and algorithms capable of integrating emerging navigation technologies into an enhanced precision navigation solution; designed propulsion systems, including alternate propulsion cycles, to increase the range of the system; designed lightweight airframe structures to increase range of the system; developed technologies that contribute to missile survivability in a contested environment.  Developed and evaluated a multi-mode seeker to enable precision guidance in GPS denied or degraded environments; radio frequency sensor to guide to radiating targets, infrared sensor with advanced image processing to enable target classification and aim point selection for both land and maritime targets; miniaturization of sensor and guidance components; investigated data link technologies to provide in-flight target updates."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cooperative Engagement Lethality Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates critical component technology and designs for future missiles that provide expeditionary, scalable, precision strike and loiter capability to rapidly defeat hard targets and swarming or disbursed threats at the Tactical Edge.  Provides the missile technology path to supervised autonomous target detection and cooperative engagement\/manned-unmanned teaming for offensive, multiple simultaneous engagement capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.3"
                                            },
                                            "Text": {
                                                "val": "Developed optimized missile design with multi-effects lethal mechanism, man-in-the-loop and loiter capability for situational awareness, targeting, and lethal effects against hard and soft targets. Developed application-based fire control unit software hosted on a commercial end user device, extended range datalink enablers, and GPS\/comms denied navigation\/targeting technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.027"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "G05"
                    },
                    "ProjectTitle": {
                        "val": "MISSILE TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "41.5"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "41.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional Program increase for Fiscal Year 2019 (FY19)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This is a Congressional Interest Item."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Carbon composite warhead research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "6.5"
                                        },
                                        "Text": {
                                            "val": "Carbon composite warhead research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additive manufacturing to support optimized long range precision fires"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Additive manufacturing to support optimized long range precision fires"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air vehicle development and sustainment"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15"
                                        },
                                        "Text": {
                                            "val": "Air vehicle development and sustainment"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise science and technology prototyping"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Enterprise science and technology prototyping"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}