{
    "id": "2021-Army-PB-2040-JBOOK-ad016dd9ebfbe1f27853ca49333275c9694f893e3957d91046dc979378596c58-10",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604823A"
        },
        "ProgramElementTitle": {
            "val": "Firefinder"
        },
        "R1LineNumber": {
            "val": "146"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "25.856"
            },
            "CurrentYear": {
                "val": "17.294"
            },
            "BudgetYearOne": {
                "val": "20.008"
            },
            "BudgetYearOneBase": {
                "val": "20.008"
            },
            "BudgetYearTwo": {
                "val": "11.717"
            },
            "BudgetYearThree": {
                "val": "12.867"
            },
            "BudgetYearFour": {
                "val": "14.584"
            },
            "BudgetYearFive": {
                "val": "13.356"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The RDT&E funds for the AN\/TPQ-50 and AN\/TPQ-53 programs fund the design, development and test of primary efforts. The programs directly support the prioritization, tracking and locating of targets, and dissemination of that information for simultaneous attack of multiple threats. They provide the Warfighter with continuous and responsive counterfire target acquisition systems for all types and phases of military operations. Project L86, Lightweight Counter Mortar Radar (LCMR), version AN\/TPQ-50 provides 360 degrees of azimuth coverage from ranges of 500 meters to 10 kilometers. Project L88, AN\/TPQ-53 is a highly mobile radar system that leverages the latest in technology design to accelerate modernization and increase range while improving false location rate, reducing obsolescence and increasing reliability. The AN\/TPQ-53 provides a system with increased range and accuracy throughout a 90 degree search sector (stare mode) as well as 360 degree coverage (rotating) for locating mortar, artillery and rocket firing positions. The AN\/TPQ-50 and AN\/TPQ-53 radars are currently fielded to multiple Continental United States (CONUS) and Outside Continental United States (OCONUS) locations to include operational support to Operation Inherent Resolve (OIR) and Operation Freedom's Sentinel (OFS).\n\nThe Fiscal Year (FY) 2021 Base funding in the amount of $20.008 million supports ongoing AN\/TPQ-50 and AN\/TPQ-53 test efforts, Army interoperability certifications (AICs), and the development and testing of modernization efforts to address extended range, electronic protection, and emerging threats in support of multi-domain operations against peer and near-peer threats.  These efforts include the performance of technical assessments, engineering studies, risk reduction, and required documentation.\n\nThis program line also funds development of an integrated Hypervelocity Armament System (HAS), and associated technologies as they mature to support accelerated demonstration and transition of advanced gun weapon systems, command guided maneuverable projectiles, and tactical sensors. The development of HAS would include advancing artillery powder guns firing Hypervelocity Projectiles (HVPs), resulting in next-generation, common, low drag, guided cannon artillery projectiles capable of completing multiple missions with improved cost effectiveness across different gun systems. Integration with a fire control radar and sensor array will allow closed-loop targeting of moving and relocatable targets beyond the range of conventional artillery."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.439"
                },
                "CurrentYear": {
                    "val": "17.294"
                },
                "BudgetYearOne": {
                    "val": "20.026"
                },
                "BudgetYearOneBase": {
                    "val": "20.026"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "25.856"
                },
                "CurrentYear": {
                    "val": "17.294"
                },
                "BudgetYearOne": {
                    "val": "20.008"
                },
                "BudgetYearOneBase": {
                    "val": "20.008"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.583"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-0.018"
                },
                "BudgetYearOneBase": {
                    "val": "-0.018"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.583"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.018"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.018"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "L86"
                    },
                    "ProjectTitle": {
                        "val": "LIGHTWEIGHT COUNTER MORTAR RADAR (LCMR)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.036"
                        },
                        "CurrentYear": {
                            "val": "4.913"
                        },
                        "BudgetYearOne": {
                            "val": "5.375"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.375"
                        },
                        "BudgetYearTwo": {
                            "val": "2.764"
                        },
                        "BudgetYearThree": {
                            "val": "3.427"
                        },
                        "BudgetYearFour": {
                            "val": "4.553"
                        },
                        "BudgetYearFive": {
                            "val": "4.844"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The AN\/TPQ-50 Lightweight Counter Mortar Radar (LCMR) is a highly mobile radar that automatically detects, classifies, tracks, and locates the point of origin of projectiles fired from mortar, artillery, and rocket systems with sufficient accuracy for first round fire for effect. It mitigates close combat radar coverage gaps by providing 360 degrees of azimuth coverage from ranges of 500 meters to 10 kilometers and is capable of being deployed in two configurations, standalone or vehicle mounted. The AN\/TPQ-50 system interoperates with mission command systems to provide the maneuver commander increased counterfire radar flexibility. The AN\/TPQ-50 is deployed as part of the Counter-Rocket, Artillery, Mortar (C-RAM) system of systems. It provides data to the Forward Area Air Defense Command and Control (FAAD C2) node for the sense and warn force protection capability. The AN\/TPQ-50 is currently fielded to multiple Continental United States (CONUS) and Outside Continental United States (OCONUS) locations to include support to Operation Inherent Resolve (OIR) and Operation Freedom's Sentinel (OFS).\n\nThe fiscal year (FY) 2021 funds of $5.375 million continue development required to address electronic protection against cyber electromagnetic activity (CEMA) and threats identified in the Validated Online Lifecycle Threat (VOLT) report. This funding enables the program to develop and integrate sensor protect capabilities into the software baseline, develop advanced protection techniques which take advantage of hardware upgrades, and develop documentation for hardware and software capability improvements in support of multi-domain operations against peer and near-peer threats.  Funding supports associated test costs and program support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Modernization & Emerging Threats"
                                    },
                                    "Description": {
                                        "val": "Funding supports software updates required to address electronic protection and mitigate the effects of electromagnetic interference (EMI) and combat cyber electromagnetic activity (CEMA). These capabilities address vulnerabilities identified in the bi-annual release of the Validated Online Lifecycle Threat (VOLT) and changes on the battlefield due to new tactics, techniques, and procedures (TTPs) and\/or areas of operation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.036"
                                            },
                                            "Text": {
                                                "val": "Continue the work required to enhance the AN\/TPQ-50's capability to address electronic protection against CEMA and other known, new, emerging and evolving threats identified in the VOLT. In addition, it integrates developed capabilities into the baseline, develops documentation for hardware and software capability improvements. Funding supports all associated testing costs and program support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.69"
                                            },
                                            "Text": {
                                                "val": "Funding enables the continuation of work required to enhance the AN\/TPQ-50's capability to address electronic protection against cyber electromagnetic activity (CEMA) and other known, new, emerging and evolving threats identified in the Validated Online Lifecycle Threat (VOLT) report. In addition, it integrates developed capabilities into the baseline, develops documentation for hardware and software capability improvements, and includes operational assessments for capability improvements. Funding supports all associated testing costs and program support. These efforts are executed by the LCMR program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.375"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.375"
                                            },
                                            "Text": {
                                                "val": "Funding increases the scope of work required to enhance the AN\/TPQ-50's ability to address electronic protection against CEMA and new threats identified in the VOLT report as well as associated test efforts and program support. These efforts are executed by the LCMR program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in funding reflects required development efforts to address threats identified in the VOLT report."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.223"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B05201"
                                    },
                                    "Title": {
                                        "val": "Lightweight Counter Mortar Radar"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.107"
                                        },
                                        "CurrentYear": {
                                            "val": "5.4"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.332"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.332"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.52"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.762"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.888"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.788"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The AN\/TPQ-50 Lightweight Counter Mortar Radar was developed in 2009 to meet Training and Doctrine Command (TRADOC) Capabilities Production Document (CPD) requirements. The program achieved a full rate production (FRP) decision on 21 June 2013. The AAO increased from 400 to 452 systems in January 2019; 400 systems procured to date. The AN\/TPQ-50 program transitioned into the sustainment phase on 1 October 2019. \n\nResearch, Development, Test and Evaluation (RDT&E) funding supports modernization development task orders under the national maintenance contract (NMC). The efforts extend through the current Program Objective Memorandum (POM) period.\n\nThe fiscal year (FY) 2021 funds of $4.303 million continue development required to address electronic protection against cyber electromagnetic activity (CEMA) and threats identified in the Validated Online Lifecycle Threat (VOLT) report. This funding enables the program to develop and integrate sensor protect capabilities into the software baseline, develop advanced protection techniques which take advantage of hardware upgrades, and develop documentation for hardware and software capability improvements in support of multi-domain operations to address peer and near-peer threats. Funding supports associated test costs and program support."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management (Government Support)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Activities"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.582"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.532"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.495"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.573"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.573"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management (Contractor Support)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.927"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.052"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.223"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.223"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Modernization & New and Emerging Threats"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.848"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.636"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.744"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.687"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.687"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Support (Government)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Activities"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.184"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.816"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.451"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.115"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.115"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_L86_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Modernization and Emerging Threats - Fiscal Year (FY) 2019 VOLT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Modernization Testing - FY 2019 VOLT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Modernization and Emerging Threats - FY 2021 VOLT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Modernization Testing - FY 2021 VOLT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Modernization and Emerging Threats - FY 2023 VOLT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Modernization Testing - FY 2023 VOLT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2026"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Modernization and Emerging Threats - FY 2025 VOLT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2027"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L87"
                    },
                    "ProjectTitle": {
                        "val": "Hypervelocity Armament System (HAS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.373"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "16.373"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project L87 The Hypervelocity Armament System (HAS) and associated technologies are composed of advanced gun weapon systems, command guided maneuverable projectiles, and tactical sensors. The development of HAS would include advancing artillery powder guns firing Hypervelocity Projectiles (HVPs), resulting in a next generation, common, low drag, guided cannon artillery projectiles capable of completing multiple missions with improved cost effectiveness. Integration with a fire control radar and sensor array will allow closed-loop targeting of moving and relocatable targets beyond the range of conventional artillery."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Development"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for all development efforts on Hypervelocity Armament System (HAS) technology transitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.2"
                                            },
                                            "Text": {
                                                "val": "Finalize initial incremental technology transition requirements and specifications, contract requirements package development and begin execution of contracts and development. Continue support for system evaluation, requirement\/specification work, integration development and test plans, prototyping, and developmental testing for the Hypervelocity Armament System to include projectile, sensor arrays and radars, launch platforms, fire control software and tracking to verify and validate performance against high value threats at greatly increased ranges."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for all program management efforts on Hypervelocity Armament System (HAS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.173"
                                            },
                                            "Text": {
                                                "val": "Begin the development for all required documents, office staff and engineering Integrated Product Team (IPT) development."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Army will leverage Strategic Capabilities Office (SCO) prototypes and technologies to continue transition from the FY 2018 program into programs of record.\n\nThe Army is transitioning prototype articles from the SCO demonstration to develop advanced gun systems, command guided maneuverable projectiles, and fire control sensors capable of engaging tactical range targets.  Emerging requirements include communication suite changes, munitions updates, and introduction of new munitions require software and\/or hardware updates to ensure full compatibility and maintain operational viability."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "HAS Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "34.562"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "11.2"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "45.762"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM\/PEO"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "VARIOUS"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.173"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.173"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_L87_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Hypervelocity Armament System Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L88"
                    },
                    "ProjectTitle": {
                        "val": "Enhanced AN\/TPQ 36"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.447"
                        },
                        "CurrentYear": {
                            "val": "12.381"
                        },
                        "BudgetYearOne": {
                            "val": "14.633"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.633"
                        },
                        "BudgetYearTwo": {
                            "val": "8.953"
                        },
                        "BudgetYearThree": {
                            "val": "9.44"
                        },
                        "BudgetYearFour": {
                            "val": "10.031"
                        },
                        "BudgetYearFive": {
                            "val": "8.512"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Enhanced AN\/TPQ-36 (AN\/TPQ-53) Counterfire Target Acquisition Radar System is a highly mobile radar set that automatically detects, classifies, tracks, and locates the point of origin of projectiles fired from mortar, artillery, and rocket systems with sufficient accuracy for first round fire for effect.  It mitigates close combat radar coverage gaps by providing a 90 degree search sector (stare mode) as well as 360 degree coverage (rotating) and replaces the current AN\/TPQ-36 and AN\/TPQ-37 Firefinder Radars.  The AN\/TPQ-53 system interoperates with mission command systems to provide the maneuver commander increased counterfire radar flexibility.  The AN\/TPQ-53 is deployed as part of the Counter-Rocket, Artillery, Mortar (C-RAM) system of systems.  It provides data to the Forward Area Air Defense Command and Control (FAAD C2) node for the sense and warn force protection capability.  The AN\/TPQ-53 currently supports contingency operations to include Operation Inherent Resolve (OIR) and is fielded to Brigade Combat Teams (BCTs), Field Artillery Brigades (FABs) and Division Artilleries (DIVARTYs).\n\nThe FY 2021 funds of $14.633 million supports ongoing test efforts, Army interoperability certifications (AICs), and the development and testing of modernization efforts to address extended range, electronic protection, and emerging threats in support of multi-domain operations against peer and near-peer threats.  These efforts include the performance of technical assessments, engineering studies, risk reduction and required documentation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Test support"
                                    },
                                    "Description": {
                                        "val": "Funding supports testing efforts and associated Program Management Office (PMO) requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.111"
                                            },
                                            "Text": {
                                                "val": "Test activities included spectrum authorization, electronic protection testing, as well as associated PMO and test support costs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.062"
                                            },
                                            "Text": {
                                                "val": "Conduct engineering and customer testing, Army interoperability certification (AIC) testing, a network vulnerability and penetration assessment, and electronic protection testing. Funds include associated PMO and test support costs. Funds will be executed by the Enhanced AN\/TPQ-36 program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.346"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.346"
                                            },
                                            "Text": {
                                                "val": "Conduct engineering testing and an independently evaluated, limited operational test in support of extended range efforts, Army interoperability certification (AIC) testing, a cooperative vulnerability and penetration assessment (CVPA), and electronic protection testing. Funds include associated PMO and test support costs. The Enhanced AN\/TPQ-36 program will execute the funds."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in FY 2021 cost due to operational test to demonstrate extended range capability using soldiers and further refinement of the software as required."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronic Protection and Emerging Threats"
                                    },
                                    "Description": {
                                        "val": "This effort improves spectrum management and mitigates electromagnetic interference (EMI) from commercial and military bands. This effort also develops and improves radar electronic protection (EP) algorithms which counter electronic threats. Lastly, this effort funds the development of capabilities to address emerging threats identified in the biennial release of the Validated Online Lifecycle Threat (VOLT) report and changes on the battlefield due to new adversarial tactics, techniques, and procedures (TTPs) and\/or areas of operation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.157"
                                            },
                                            "Text": {
                                                "val": "Conduct a live fire test demonstrating enhanced electronic protection algorithms against surrogate threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.081"
                                            },
                                            "Text": {
                                                "val": "Develop additional electronic protection techniques to mitigate cyber electromagnetic activity (CEMA). Continue development of capabilities to address emerging threats identified in the biannual release of the VOLT, changes in the battlefield and areas of operations. Implement tools and TTPs to allow the radar to operate more efficiently in the presence of electromagnetic interference (EMI). Funding supports associated developmental testing and program support. Funds will be executed by the Enhanced AN\/TPQ-36 program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.287"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.287"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of additional electronic protection techniques to mitigate cyber electromagnetic activity (CEMA) in peer and near peer threat environments. Continue development of capabilities to address emerging threats identified in the biennial release of the VOLT and conflict areas of operation. Implement tools and TTPs to allow the radar to operate more efficiently in the presence of electromagnetic interference (EMI). Funding supports associated developmental testing and program support. The Enhanced AN\/TPQ-36 program will execute the funds."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY 2020 to FY 2021 to support additional electronic protection development efforts associated with an updated distributed digital receiver exciter (DDREX)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range"
                                    },
                                    "Description": {
                                        "val": "This effort extends the radar's detection and identification range through associated development, integration, and testing in support of the Army's number one modernization priority of long range precision fires (LRPF)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.179"
                                            },
                                            "Text": {
                                                "val": "Funds support the development, integration and testing of an extended range prototype capability. Funds also support the updates to systems engineering and design documentation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.675"
                                            },
                                            "Text": {
                                                "val": "Will conduct regression and live fire testing of the extended range capability. Implement design and software changes based on results from testing performed in an operationally representative environment. Integrate a proven extended range capability into the program's software baseline and conduct initial integration testing. These funds will be executed by the Enhanced AN\/TPQ-36 program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in FY 2021 cost due to a reduction in scope of the extended range software development effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.563"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B05310"
                                    },
                                    "Title": {
                                        "val": "AN\/TPQ-53 Counterfire Target Acquisition Radar"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "324.15"
                                        },
                                        "CurrentYear": {
                                            "val": "16.416"
                                        },
                                        "BudgetYearOne": {
                                            "val": "72.421"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "72.421"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "11.829"
                                        },
                                        "BudgetYearThree": {
                                            "val": "29.868"
                                        },
                                        "BudgetYearFour": {
                                            "val": "41.921"
                                        },
                                        "BudgetYearFive": {
                                            "val": "53.408"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The AN\/TPQ-53 leverages technology developed in the multi-mission radar advanced technology objective (ATO) program.  The system replaces all of the AN\/TPQ-36 and AN\/TPQ-37 systems in the fleet.  The program obtained a Full Rate Production (FRP) decision in December 2015 and awarded an FRP contract in March 2017.  The program will retrofit all initial production systems to the FRP configuration.  The Army Acquisition Objective (AAO) increased from 174 to 189 systems in May 2017.  Following the approval of a new acquisition category (ACAT) IC acquisition program baseline (APB) in April 2019, the program procured the last 15 FRP systems on contract in the same month.  The program will complete all FRP system deliveries in FY 2021.  \n\nRDT&E funding supports modernization development and extended range software development task orders under the existing FRP contract. The efforts extend through the current Program Objective Memorandum (POM) period."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management (Government)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.153"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.397"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.023"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.114"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.114"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management (Contractor)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.374"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.096"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.035"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.133"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.133"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.563"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.563"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Electronic Protection and Emerging Threats"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Syracuse, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.74"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.157"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.175"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.287"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.287"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Extended Range"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Syracuse, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.675"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.179"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.769"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Georgia Tech Research Institute (GTRI)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Atlanta, GA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.361"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.3"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.206"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.336"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.336"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Activities"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "53.884"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.318"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.61"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.763"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.763"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_L88_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Extended Range (ER)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ER Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ER Limited Operational Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Ongoing Tests - Electronic Protection (EP) and Emerging Threats"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EP and Emerging Threats - Fiscal Year (FY) 2019 VOLT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Modernization Testing - FY 2019 VOLT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EP and Emerging Threats - FY 2021 VOLT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Modernization Testing - FY 2021 VOLT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EP and Emerging Threats - FY 2023 VOLT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Modernization Testing - FY 2023 VOLT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2026"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EP and Emerging Threats - FY 2025 VOLT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2027"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}