{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-30",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602720A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology"
        },
        "R1LineNumber": {
            "val": "36"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "15.364"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "15.364"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is realigned with continuity of effort to the following PEs:\n* 0602141A Lethality Technology\n* 0602144A Ground Technology\n* 0602146A Network C3I Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE investigates and evaluates enabling tools and methodologies that support the long-term sustainment of Army training and testing activities. Specific focus is on maintaining regulatory compliance while limiting future Army liability to installation operations and training, and maintaining resilient and adaptive ranges. Project 048 improves the Army's ability to comply with requirements mandated by federal, state, and local environmental\/health laws and to reduce the cost of this compliance. Project 835 develops enabling technologies for advanced life cycle analysis, advanced sensing, technologies to empower rapid fielding of next generation energetics, propellants and munitions with focus on the impacts of new materiel that will enter the Army inventory within the next decade and beyond, and enable decision making based on accurate environmental conditions in sparse data environments. Project 895 focuses on reducing hazardous waste generation through process modification and control, materials recycling and substitution, and developing technologies to predict and mitigate range and maneuver constraints associated with current and emerging weapon systems, doctrine, and regulations. Project 896 investigates technologies for ecosystem vulnerability assessment, and ecosystem analysis, monitoring, modeling, and mitigation to support sustainable use of Army lands to reduce or eliminate environmental constraints to military missions, and develops environmental sensor capabilities to enable rapid collection and analysis of data for real-time environmental situational awareness. \n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Modernization Strategy, and supports the Army Strategy for the Environment.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nTechnologies developed in this PE are transitioned to PE 0603728A (Environmental Quality Technology Demonstrations).\n\nWork in this PE is performed by the Army Engineer Research and Development Center, Vicksburg, MS, and the Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.469"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "15.364"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.105"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-3.836"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.269"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Funds reprogrammed out for higher priority Army requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "048"
                    },
                    "ProjectTitle": {
                        "val": "Ind Oper Poll Ctrl Tec"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.992"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.992"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to:\nProgram Element (PE) 0602144A Ground Technology \n* Project BK7 Robotics for Engineer Operations Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops tools and methods to enable the Army to reduce or eliminate environmental impacts both in the United States and abroad. These new and innovative technologies are essential for the effective control and reduction of military unique hazardous and non-hazardous wastes on military installations and associated with contingency operations bases worldwide. To develop the required technologies, this Project has a focus on developing sustainable environmental protection technologies that help the Army maintain environmental compliance for sources of pollution such as production facilities, facility contamination, and other waste streams; a focus on Army-unique ecosystem vulnerability assessment, and ecosystem analysis, modeling, adaptation, and mitigation technologies for installations associated with air quality and endangered species management and their impacts on training and testing missions; a focus on designing and developing technologies for deployed forces with environmentally safe, operationally enhanced, and cost effective technologies or processes to achieve maximum diversion, minimization, or volume reduction of base camp and field waste; and a focus on the impacts of new materiel that will enter the Army inventory within the next decade and beyond. The resultant technologies reduce the impact of legal and regulatory environmental restrictions on installation facilities, training and testing lands and ranges, as well as provide a means to avoid fines and facility shutdowns within the United States and reduce environmental impacts to the Warfighter abroad.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Modernization Strategy, and supports the Army Strategy for the Environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adaptive & Resilient Installations"
                                    },
                                    "Description": {
                                        "val": "This effort develops sustainable, cost efficient, and effective facilities; and provides technologies and techniques for achieving resilient and sustainable installation and base operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.992"
                                            },
                                            "Text": {
                                                "val": "Followed a system of systems approach to develop an integrated installation computational model which fuses data from existing systems and programs of record to capture management business processes. Business intelligence dashboards integrate and support synthesis and reporting across business processes and at all echelons, and fully integrate information infrastructure that presents and provides decision-ready knowledge."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "835"
                    },
                    "ProjectTitle": {
                        "val": "Mil Med Environ Crit"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.502"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.502"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to:\nPE 0602144A Ground Technology:\n* Project BL5 Expedient Passive Protection Technology\nPE 0602146A Network C3I Technology: \n* Project AR3 Intelligent Environmental Battlefield Awareness"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops tools and methods to enable the Army to reduce or eliminate environmental impacts both in the United States and abroad. These new and innovative technologies are essential for the effective control and reduction of military-unique hazardous and non-hazardous wastes associated with contingency operations worldwide. These new and innovative technologies empower rapid fielding of next generation energetics, propellants and munitions with focus on the impacts of new materiel that will enter the Army inventory within the next decade and beyond, and deliver the capability to shape and protect Army investments in next generation fires by delivering proactive, scientifically sound risk and environmental impact management strategies. This Project will also provide integrated knowledge of environmental factors in mission planning activities creating a unified, comprehensive and integrated battlefield landscape of future threats, opportunities and impacts to mission success in sparse data environments enabling mission planners to identify the industrial\/commercial resources used as components of weapons development. These resultant technologies streamline the acquisition process, enabling rapid fielding of new materials, increase Army readiness through proactive hazard management strategies for military materials, enhance the Army's ability to improve decision-making based on accurate environmental conditions in sparse data environments, and reduce Army liabilities associated with unforeseen environmental impacts.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Life Cycle of Military Materials in the Environment"
                                    },
                                    "Description": {
                                        "val": "This effort provides a quantitative means to determine the environmental and human health effects resulting from exposure to existing and emerging compounds and materials produced in Army industrial, field, and battlefield operations or disposed of through past activities. Results of this research will be integrated into the life cycle analysis process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.046"
                                            },
                                            "Text": {
                                                "val": "Investigated environmentally-friendly signature tonedown\/alteration concepts for critical assets that integrate novel materials such as organics and nanomaterials, and characterized life cycle and environmental health and safety impacts of concealment\/countermeasure technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Risk Analysis of Fires"
                                    },
                                    "Description": {
                                        "val": "Develop proactive environment, safety, and occupational health risk assessment tools to ensure rapid fielding of energetics, propellants, and munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.454"
                                            },
                                            "Text": {
                                                "val": "Developed robust procedures for the detection and quantification of carbon-based advanced materials at concentrations relevant to sustainability analysis; and identified current and future trends in additive manufacturing technologies and materials of interest to the Army to evaluate environment, health, and safety impacts during development, transition, and acquisition. Proactive environment, safety, and occupational health risk assessment tools  facilitate rapid fielding of energetics propellants and munitions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligent Environmental Battlefield Awareness"
                                    },
                                    "Description": {
                                        "val": "Develop technologies to provide geo-environmental infrastructure and hazard awareness in urban environments to provide decision-makers with data and information for mission planning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.002"
                                            },
                                            "Text": {
                                                "val": "Investigated environmental forensic methodologies to provide geo-chemical resources to mission planners. Quantified contaminant microbial degradation\/transformation activity in arctic and subarctic climates as a function of soil geochemistry and environmental flux to model contaminate fate and transport prediction for intelligence preparation on the battlefield."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "896"
                    },
                    "ProjectTitle": {
                        "val": "Base Fac Environ Qual"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.87"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.870"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to:\nProgram Element (PE) 060146A Network C3I Technology Project:\n* Project AR5 Understanding the Environment as a Threat Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops tools as well as identification and assessment methodologies for ecosystem vulnerability assessment, analysis, monitoring, modeling, and mitigation to support real-time dynamic environmental situational awareness to enable the Army to reduce or eliminate environmental constraints to military use both in the United States and abroad and how the use of those resources impacts mission support. The Project investigates, designs, and develops novel methods and missions, providing the Army with the technical capability to manage, protect, and improve the biophysical characteristics; and the computational understanding of the Battlefield environment conditions and stressors in order to provide actionable information supporting situational awareness and influencing tactical operations. Technologies within this Project enable insertion of accurate environmental data into current intelligence and planning frameworks creating an integrated picture of the battlespace for operational decision making. This project also enhances environmental reconnaissance with advanced environmental sensing technologies to enable rapid collection and analysis of environmental data providing situational awareness for mission response.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Understanding the Environment as a Threat"
                                    },
                                    "Description": {
                                        "val": "This effort advances the state of the science associated with computational understanding of the Battlefield environment conditions and stressors in order to provide actionable information supporting situational awareness for mission planning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.87"
                                            },
                                            "Text": {
                                                "val": "Investigated computational chemistry predictions of the physical and chemical properties of insensitive munitions compounds and their degradation products, to determine their fate and effects in arid and semiarid environments and to provide actionable information supporting situational awareness and influence tactical operations."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F35"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Quality Applied Research (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional increases supporting the investigation and evaluation of enabling tools and methodologies that support the long-term sustainment of Army training and testing activities\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Engineer Research and Development Center, Vicksburg, Mississippi."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Mobile Environmental Containment Sensors"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "Mobile Environmental Containment Sensors"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}