{
    "id": "2021-DoDHumanResourcesActivity-PB-0400-MJBOOK-0-0-c54c24812e092723b09e203899d8d3cd09e3c666bf10515b00e8e90cc28ca0c2-2",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DHRA-U_RDTE_MasterJustificationBook_DoD_Human_Resources_Activity_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_DoD_Human_Resources_Activity_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "DoD Human Resources Activity",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0303140SE"
        },
        "ProgramElementTitle": {
            "val": "DHRA Cyber -  R&D in Support of DOD Enlistment, Testing and Evaluation"
        },
        "R1LineNumber": {
            "val": "185"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "DoD Human Resources Activity"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "1.112"
            },
            "BudgetYearOneBase": {
                "val": "1.112"
            },
            "BudgetYearTwo": {
                "val": "0.856"
            },
            "BudgetYearThree": {
                "val": "0.511"
            },
            "BudgetYearFour": {
                "val": "0.515"
            },
            "BudgetYearFive": {
                "val": "0.523"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In accordance with the directive from the Office of the Under Secretary of Defense regarding identifying cyber-related funding, DHRA has established a Program Element (PE) for Cyber - 0303140SE.   A total of $1,273 thousand was transferred to the cyber PE from PE 0605803SE in FY 2021.  Subsequently, the PSA portion of the cyber funds in FY 2021 ($161 thousand) and remaining outyears, will be transferred to the Defense Counterintelligence and Security Agency (DCSA), along with the non-cyber funding for the Defense Information System for Security (DISS) program.  The cyber PE of 0303140SE consists of the remaining programs: EDS, ICM, and PA."
        },
        "ProgramElementMissionDescription": {
            "val": "The Department of Defense Human Resources Activity (DHRA) is a DoD-wide Field Activity chartered to support the Under Secretary of Defense for Personnel and Readiness (USD (P&R)). This PE includes application of R&D to support cybersecurity improvements across the DHRA enterprise.\n\nProject 1: Enterprise Data Services (EDS). Supports the cybersecurity activities related to DMDC’s EDS mission. EDS is addressing two critical projects in FY 2021: 1) The Joint Officer Management (JOM) modernization initiative and 2)The development of the Enterprise Data to Decisions Information Environment (EDDIE).  \nThe legacy system JOM system was built in the 1990s and requires extensive redevelopment to resolve existing security issues and ensure new development complies with Department cybersecurity policies.\n\nEDDIE introduces a streamlined way to provide person based “data as a service” and “analytics as a service” to all of DoD and other Federal Agencies. EDDIE will assist decision makers in forming relevant questions, retrieving pertinent information, and informing policy and program changes. In FY 2021 development will begin based on the findings of the Analysis of Alternatives; ensuring compliance with cybersecurity policies during and after this initial implementation will be a key component of successful system delivery.  This funding will be used to obtain support from cybersecurity experts during development.\n\nProject 2: Identity Credential Management (ICM). DMDC executes DHRA’s responsibility to provide a central source of identification and authorization of people during and after their affiliation with DoD for identity protection, security, entitlements, and benefits verification. This funding will support the evaluation and testing emerging technologies that will develop more robust and secure capabilities for the Department’s ICM program, including the analysis of the security posture of these technologies.\n\nProject 3: Personnel Accountability (PA).  This program is comprised of several systems, including: Synchronized Pre-deployment Operational Tracker Enterprise Suite (SPOT-ES), Joint Personnel Accountability Reconciliation and Reporting (JPARR), Defense Travel System (DTS)\/Defense Travel System Modernization and Noncombatant Evacuation Operations (NEO) Tracking System (NTS).  This family of systems represents end-to-end tracking, reconciliation and reporting of DoD personnel location and movements, to include military, DoD affiliated civilians, DoD, DoS and USAID contractors and U.S. citizens.  This includes DoD travel, contracts, and contractor personnel tracking in support of military operations, contingencies, military readiness, reporting of locations at the unit and person level, accountability of DoD personnel during (and after) natural or man-made disasters and accountability and visibility of noncombatant evacuees.  This funding will be used to obtain support from cybersecurity experts during the modernization of these systems.\n\nNote: The Personnel Security Assurance (PSA) program  provides comprehensive capabilities to perform processing and verification of security clearances for all DoD military personnel, civilians and contractors including the technology and processes that need to be addressed in order to implement Continuous Evaluation.  The DISS mission is to consolidate the DoD personnel security mission into an enterprise adjudicative case management system that will automate the implementation of improved national investigative and adjudicative standards to eliminate costly and inefficient work processes and increase information collaboration across the community. In FY 2021, responsibility for DISS, including cybersecurity support, will transfer to the Defense Counterintelligence and Security Agency (DCSA)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.112"
                },
                "BudgetYearOneBase": {
                    "val": "1.112"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.112"
                },
                "BudgetYearOneBase": {
                    "val": "1.112"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Reflects the transfer of cyber funds to this PE."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "Enterprise Data Services (EDS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.774"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.774"
                        },
                        "BudgetYearTwo": {
                            "val": "0.471"
                        },
                        "BudgetYearThree": {
                            "val": "0.121"
                        },
                        "BudgetYearFour": {
                            "val": "0.121"
                        },
                        "BudgetYearFive": {
                            "val": "0.129"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Supports cybersecurity research and development efforts on two critical projects, The Joint Officer Management (JOM) modernization initiative and Enterprise Data to Decisions Information Environment (EDDIE).  The JOM modernization initiative will support cybersecurity improvements to the program that tracks and manages joint personnel officer readiness capability.  EDDIE funding will be used to provide cybersecurity support during the development of a system to provide person based “data as a service” and “analytics as a service” to all of DoD and other Federal Agencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enterprise Data Services (EDS)"
                                    },
                                    "Description": {
                                        "val": "Supports cybersecurity research and development efforts on two critical projects, the Joint Officer Management (JOM) modernization initiative and Enterprise Data to Decisions Information Environment (EDDIE)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.774"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.774"
                                            },
                                            "Text": {
                                                "val": "Provide cybersecurity support for JOM implementation.\nProvide cybersecurity support for the initial development efforts of EDDIE."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 funding represents the cyber portion of the effort for both the JOM modernization project and the EDDIE project."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2"
                    },
                    "ProjectTitle": {
                        "val": "Identity Credential Management (ICM)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.262"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.262"
                        },
                        "BudgetYearTwo": {
                            "val": "0.316"
                        },
                        "BudgetYearThree": {
                            "val": "0.319"
                        },
                        "BudgetYearFour": {
                            "val": "0.322"
                        },
                        "BudgetYearFive": {
                            "val": "0.322"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "DMDC executes DHRA’s responsibility to provide a central source of identification and authorization of people during and after their affiliation with DoD for identity protection, security, entitlements, and benefits verification. This funding will support the evaluation and testing emerging technologies that will develop more robust and secure capabilities for the Department’s ICM program, including the analysis of the security posture of these technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Identity Credential Management (ICM)"
                                    },
                                    "Description": {
                                        "val": "DMDC executes DHRA’s responsibility to provide a central source of identification and authorization of people during and after their affiliation with DoD for identity protection, security, entitlements, and benefits verification. This funding will support the evaluation and testing emerging technologies that will develop more robust and secure capabilities for the Department’s ICM program, including the analysis of the security posture of these technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.262"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.262"
                                            },
                                            "Text": {
                                                "val": "Provide cybersecurity support to identity proofing pilot."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 funding represents the cyber portion of the ICM in support of the identity proofing pilot."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Accountability (PA)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.076"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.076"
                        },
                        "BudgetYearTwo": {
                            "val": "0.069"
                        },
                        "BudgetYearThree": {
                            "val": "0.071"
                        },
                        "BudgetYearFour": {
                            "val": "0.072"
                        },
                        "BudgetYearFive": {
                            "val": "0.072"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Personnel Accountability program is comprised of several systems, including: Synchronized Pre-deployment Operational Tracker Enterprise Suite (SPOT-ES), Joint Personnel Accountability Reconciliation and Reporting (JPARR), Defense Travel System (DTS)\/Defense Travel System Modernization and Noncombatant Evacuation Operations (NEO) Tracking System (NTS).  This funding will be used to obtain support from cybersecurity experts during the modernization of these systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Personnel Accountability (PA)"
                                    },
                                    "Description": {
                                        "val": "The Personnel Accountability program is comprised of several systems, including: Synchronized Pre-deployment Operational Tracker Enterprise Suite (SPOT-ES), Joint Personnel Accountability Reconciliation and Reporting (JPARR), Defense Travel System (DTS)\/Defense Travel System Modernization and Noncombatant Evacuation Operations (NEO) Tracking System (NTS).  This funding will be used to obtain support from cybersecurity experts during the modernization of these systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.076"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.076"
                                            },
                                            "Text": {
                                                "val": "Provide cybersecurity expertise during the development of enhancements to the SPOT, JAMMS and NTS systems to include additional online capabilities as required by the Joint DOTmLPF-P Change Recommendation for Operational Contract Support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 funding represents the cyber portion for support in the modernization of the systems."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}