{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-28",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602712A"
        },
        "ProgramElementTitle": {
            "val": "Countermine Systems"
        },
        "R1LineNumber": {
            "val": "34"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "26.594"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "26.594"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is realigned with continuity of effort to the following:\n* PE 0602143A (Soldier Lethality Technology)\n* PE 0602144A (Ground Technology)\n* PE 0602145A (Next Generation Combat Vehicle Technology)"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE investigates, designs, and develops technologies to improve counter explosive hazard detection, signature management, and counter- sensor capabilities. Focus areas are sensor components, sub-components, and software algorithms to improve detection of mines and explosive threats; novel methods to defeat mines and explosive threats; and signature management technologies to reduce the reconnaissance capabilities of enemy forces. The technologies being investigated are for both mounted and dismounted applications. Project H24 (Countermine Technology) investigates state of the art counter explosive hazard technologies to accurately detect and neutralize threats with a high probability, reduce false alarms, and enable an increased operational tempo. Project H35 (Camouflage and Counter-Recon Tech) designs and develops advanced sensor protection, signature management, and deception techniques for masking friendly force capabilities and intentions. \n\nWork in this PE is related to and fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602622A (Chemical, Smoke and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602709A (Night Vision Technology), PE 0602784A (Military Engineering Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603606A (Landmine Warfare and Barrier Advanced Technology), and PE 0603710A (Night Vision Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the United States Army Futures Command."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.223"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "26.594"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.629"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.629"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H24"
                    },
                    "ProjectTitle": {
                        "val": "Countermine Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.803"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "14.803"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project will realign to:\nProgram Element (PE) 0602144A Ground Technology\n* Project BL4 Countermine Technology)\nPE 060145A Next Generation Combat Vehicle Technology \n* Project BJ7 Detection of Explosive Hazards Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, designs, and develops new technology components, sub-components, and software algorithms for detection, discrimination, and neutralization of individual mines, minefields, and other explosive threats. The goals of this Project are to accurately detect threats with a high probability, reduce false alarms, and enable an increased operational tempo.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Standoff Sensors for Explosive Hazard Detection"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the challenges of sensing and confirming potential in-road and roadside threats at standoff ranges. The effort focuses on understanding the phenomenologies that impact sensor design concepts and steer novel technologies that provide the primary means for detecting anomalies. The result is higher-confidence target detection and improved clutter\/background filtering. Examples of candidate technologies include Forward Looking (FL) Electro-Optic\/Infrared (EO\/IR) and Ground Penetrating Radar (GPR) sensors, which are used to detect surface threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.896"
                                            },
                                            "Text": {
                                                "val": "Designed and validated novel sensors and processing approaches using advances in correlated FL and multistate GPR, vibration, and EO\/IR sensors; combined fused signal processing methods to better detect targets in the presence of clutter in the natural environment; developed new processing techniques to improve detection capability of complementary sensors in varying environments; investigated modular sensor components including unique radars, EO\/IR sensors, wire detection techniques, and sensitive radio frequency technologies to remotely detect explosive hazards and indicators of emplacement such as command wires and initiation devices for application to small unmanned air and ground platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neutralization and Breaching Technology"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the challenges of selectively neutralizing individual explosive hazards at standoff ranges as well as the challenges of scaling up such capabilities to neutralize multiple explosive hazards for effective complex obstacle breaches. This effort focuses on validation of techniques to confirm the location of buried threats and on the design and development of technology components to defeat the confirmed target. The result is matured components to facilitate follow-on efforts to develop an integrated explosive hazard neutralization and breaching capability. Examples of candidate technologies for neutralization include high energy devices (lasers and radio frequency) and explosives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.9"
                                            },
                                            "Text": {
                                                "val": "Investigated standoff confirmation sensor techniques to determine discrimination thresholds and to set parameters for the design of neutralization techniques; investigated laser, radio frequency, and microwave sources to determine maturity; determined options for use of explosive techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.007"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H35"
                    },
                    "ProjectTitle": {
                        "val": "Camouflage  & Counter-Recon Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.791"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.791"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602145A Next Generation Combat Vehicle Technology\n* Project BI2 Sensor Protection Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, designs, and develops techniques for masking friendly force capabilities and intentions. The Project pursues technologies to reduce the susceptibility of sensor systems to detection and targeting by threat forces, as well as to inform the development of next generation camouflage coatings and paints. Novel technologies are investigated, such as novel optics designs combined with signal processing, spectral filtering, and threat sensing algorithms.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Camouflage and Counter-Reconnaissance Technology for Advanced Spectral Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and advances new techniques to reduce susceptibility of sensors to detection by lasers, Electro-Optic (EO) sensor systems, and Infrared (IR) sensor systems. This effort also researches signature reduction approaches for camouflage nets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.791"
                                            },
                                            "Text": {
                                                "val": "Investigated new protective coatings for dual band IR systems that have high out of band rejection, very high in-band transmission, and laser durability while still meeting camera window environmental performance requirements; continued to support signature characteristics testing for urban and arctic camouflage solutions for both vehicles and dismounted Soldiers."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "HB2"
                    },
                    "ProjectTitle": {
                        "val": "COUNTERMINE COMPONENT TECHNOLOGY (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Countermine Systems applied research."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Increase - Developing and Improving Counter-IED Sensors (CCDC)"
                                    },
                                    "Description": {
                                        "val": "Congressional increase."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.1"
                                            },
                                            "Text": {
                                                "val": "Congressional increase. Investigated multiple sensor modalities to image targets in laboratory and field environments under varied environmental conditions and lighting scenarios. Conducted experiments using sensors with characteristics needed to penetrate soils in the widest variety of environments.  Investigated sensor systems mounted to Unmanned Aerial Systems (UASs). Designed a knowledge base of soil conditions and representations to support evaluation of counter-Improvised Explosive Device (IED) sensing concepts and guided selection and created decision aids when planning the use of counter-IED sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Increase - Development of Soil Parameters (USACE)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.9"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}