{
    "id": "2021-Army-PB-2040-JBOOK-8f7fdbb59cb85b132b0478715b87ff02c7eb359f73f79d73e48c9151ed5a28f2-13",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603125A"
        },
        "ProgramElementTitle": {
            "val": "Combating Terrorism - Technology Development"
        },
        "R1LineNumber": {
            "val": "56"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "43.91"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "43.910"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year 2020 (FY20) this Program Element (PE) was realigned with continuity of effort to the following PE:\n* 0602145A Next Generation Combat Vehicle Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE demonstrates and evaluates emerging technologies and systems with high payoff potential to address current technology shortfalls or future capability gaps. Efforts include hybrid electric power technologies to reduce use of fossil fuel in tactical generators; collaboration with the United States (U.S.) Department of Energy (DOE) to demonstrate technologies that provide significant gains in ground vehicle energy efficiency; demonstration of ground platform power management, generation, and distribution technologies that increase energy efficiencies and support the integration of advanced future capabilities; and field demonstrations to stress and assess emerging technologies earlier in the systems development life cycle, thus reducing potential vulnerabilities and providing an improved understanding of employment risks against potential threats.\n\nWork in this Project is complementary to and is fully coordinated with PE 0602618A (Ballistics Technology) \/ Project H80 (Survivability and Lethality Technology), PE 0602601A (Combat Vehicle and Automotive Technology), and PE 0603005A (Combat Vehicle and Automotive Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nThis work is performed by the U.S. Army Futures Command."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "36.757"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "43.91"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "7.153"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "7.274"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.121"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "FY2019 reprogramming of $7.274M supports Army Capability Accelerator effort under Project DF5."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DF5"
                    },
                    "ProjectTitle": {
                        "val": "Agile Integration & Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.91"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.910"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nPE 0602145A Next Generation Combat Vehicle Technology: \n* Project BH5 Platform Electrification and Mobility Tech\n* Project BI4 Materials Application and Integration Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project demonstrates and evaluates emerging technologies and systems with high payoff potential to address current technology shortfalls or future capability gaps. Efforts include hybrid electric power technologies to reduce use of fossil fuel in tactical generators; collaboration with the United States Department of Energy (DOE) to demonstrate technologies that provide significant gains in ground vehicle energy efficiency; demonstration of ground platform power management, generation, and distribution technologies that increase energy efficiencies and support the integration of advanced future capabilities; and field demonstrations to stress and assess emerging technologies earlier in the systems development life cycle, thus reducing potential vulnerabilities and providing an improved understanding of employment risks against potential threats.\n\nWork in this Project is complementary to and is fully coordinated with PE 0602618A (Ballistics Technology) \/ Project H80 (Survivability and Lethality Technology), PE 0602601A (Combat Vehicle and Automotive Technology), and PE 0603005A (Combat Vehicle and Automotive Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy. FY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nThis work is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ground Platform Subsystem Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort contributes to the Army's ground platform risk reduction efforts which seek to address technical and integration challenges in the areas of mobility, survivability, vehicle architecture, and systems integration. Specifically, this effort focuses on maturing and demonstrating integrated vehicle power management, generation and distribution technologies to increase ground vehicle energy efficiencies and ensure ground platforms have enough power to enable future capabilities such as electromagnetic armor, active protection systems, improvised explosive device detect and defeat technologies, advanced situational awareness and future network integration technologies. This effort is coordinated with PE 0603005A (Combat Vehicle and Automotive Advanced Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.073"
                                            },
                                            "Text": {
                                                "val": "Completed optimization of VEA Mobile Demonstrator (VMD) performance during hardware integration onto vehicle platform, and validated system performance against future power and data requirements. Completed validation of powertrain controls architecture and algorithms, improving powertrain efficiencies and minimizing parasitic losses. Completed validation of integrated starter generator, advanced thermal management system, and advanced modular lithium ion battery technologies to improve subsystem fuel efficiency and increase electrical power generation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Vehicle Power and Energy"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced technologies that enable military ground vehicles to become significantly more energy efficient. It collaborates with the DOE to demonstrate technologies in: advanced combustion engines and transmissions; lightweight structures and materials; energy recovery and thermal management; alternative fuels and lubricants; hybrid propulsion systems; batteries and energy storage; and analytical tools (e.g., modeling and simulation). This effort is coordinated with PE 0602601A (Combat Vehicle and Automotive Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.563"
                                            },
                                            "Text": {
                                                "val": "Continued to support the Advanced Vehicle Power Technology Alliance (AVPTA) with the DOE to mature and demonstrate technologies within the alliance technology focus areas. Developed methodology and software for optimal sizing of fuel cells and battery packs for military vehicles. Developed advanced electrolytes to increase Lithium Metal Battery energy density, performance and life. Developed and tested Thermal Barrier Coatings to reduce heat loss\/improve fuel economy of combustion engines. Developed and evaluated next-generation, light-weight materials, manufacturing and related processes. Supported the AVPTA project portfolio via \"Extended Enterprise\" efforts such as Improving the Fuel Efficiency of the Current Ground Tactical Fleet; JP-8 Fuel Cell Power; and other activities that will enhance Operational Energy efficiency and reduce energy consumption."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Capability Accelerator"
                                    },
                                    "Description": {
                                        "val": "Effort focuses on applied research where teams of combat soldiers, entrepreneurs, researchers and defense industry veterans collaborate to produce an actual working prototype that real troops can field-test in realistic conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.274"
                                            },
                                            "Text": {
                                                "val": "Provided support to small businesses to mature concepts into prototypes and validate early-stage technology."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW4"
                    },
                    "ProjectTitle": {
                        "val": "Energy Technologies (Congressional Adds (CAs))"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "33"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "33.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding provided for technology development and demonstration."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Artificial Intelligence Enabled Sensor Networks"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "Artificial Intelligence Enabled Sensor Networks"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Propulsion Systems for UAS"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "6"
                                        },
                                        "Text": {
                                            "val": "Enhanced Propulsion Systems for UAS"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lightweight Low Power Radar System"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "Lightweight Low Power Radar System"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Endurance UAV Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "7.965"
                                        },
                                        "Text": {
                                            "val": "Long Endurance UAV Research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Open Source ISR Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Open Source ISR Research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.035"
                                        },
                                        "Text": {
                                            "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}