{
    "id": "2021-Army-PB-2040-JBOOK-2ce7b76ca8f41dbc06183380f90728d4a8e40b9122c9effab5b4a02fdffb364e-20",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605898A"
        },
        "ProgramElementTitle": {
            "val": "Army Direct Report Headquarters - R&D - MHA"
        },
        "R1LineNumber": {
            "val": "206"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "53.526"
            },
            "CurrentYear": {
                "val": "53.820"
            },
            "BudgetYearOne": {
                "val": "55.045"
            },
            "BudgetYearOneBase": {
                "val": "55.045"
            },
            "BudgetYearTwo": {
                "val": "55.785"
            },
            "BudgetYearThree": {
                "val": "56.309"
            },
            "BudgetYearFour": {
                "val": "58.408"
            },
            "BudgetYearFive": {
                "val": "59.424"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "392.317"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) provides funding for the salaries and related personnel benefits for authorized civilian personnel positions that provide for the management functions and the technical direction of the United States (U.S.) Army Test and Evaluation Command (ATEC) mission located at Aberdeen Proving Ground (APG), Maryland (Project M65 Army Test and Evaluation Command). It also provides funds supporting similar functions at the United States (U.S.) Army Research Institute for the Behavioral and Social Sciences (Project XW7 Command HQ - ARI), and provides funds for Army Headquarters to study and improve the Sexual Harassment \/ Assault Response and Prevention program (Project FJ2 Army SHARP RDTE). \n\nATEC plans, conducts and integrates developmental testing, independent operational testing, independent evaluations, and assessments to provide essential information to Soldiers and acquisition decision makers supporting the American Warfighter. Additionally, ATEC is a Direct Support to Army Futures Command (AFC). ATEC provides testing and independent evaluation support to AFC Cross Functional Team (CFT) efforts including risk reduction support to experiments, demonstrations, requirements, research, development, and acquisition. As such, ATEC priorities are aligned to the Army's Modernization priorities. \n\nProject M65 includes staff\/management functions of resource management, human resources, safety, security, environmental, strategic planning and information\/technology support for command-wide databases in support of the developmental, evaluation and operational test mission with technical direction to the Army Evaluation Center (AEC), APG, Maryland; to the Operational Test Command (OTC), Fort Hood, Texas which consists of three forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Air Defense Artillery Test Directorate, Fort Bliss, Texas; and the Fires Test Directorate, Fort Sill, Oklahoma) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas; and to the seven Major Range and Test Facility Base (MRTFBs) and one non-MRTFB test range: Aberdeen Test Center (ATC) at APG, Maryland; West Desert Test Center (WDTC) at Dugway Proving Ground (DPG), Utah; Electronic Proving Ground (EPG) at Fort Huachuca, Arizona; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Yuma Test Center (YTC) at Yuma Proving Ground (YPG), Arizona; Cold Regions Test Center (CRTC) at Fort Greely, Alaska; and Tropic Regions Test Center (TRTC) at various locations, as well as for Redstone Test Center (RTC) at Redstone Arsenal, Alabama. This is the operating budget for ATEC Headquarters, which provides technical direction for the annual execution of approximately 2,300 developmental tests; approximately 53 operational events; and approximately 900 Evaluation and Safety documents supporting acquisition programs. ATEC's total authorized workforce amounts to a $1.7 billion program in direct and reimbursable funding. \n\nProject XW7 provides the non-Army Management Headquarters Activity (non-AMHA) management and administrative support that enables the U.S. Army Research Institute for the Behavioral and Social Sciences (ARI) to accomplish its research mission and includes personnel\/manpower execution and oversight. ARI's behavioral and social science research provides effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints. ARI is the only Science and Technology (S&T) laboratory that conducts research to enhance the Soldier lifecycle (e.g., selection, assignment, training, and leader development). \n\nProject FJ2 provides Army Management Headquarters a critical research capability to improve the Army Sexual Harassment \/ Assault Response and Prevention (SHARP) program, with a specific focus on prevention.\n\nThis PE does not finance test facility operations, test instrumentation, or test equipment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "54.13"
                },
                "CurrentYear": {
                    "val": "53.82"
                },
                "BudgetYearOne": {
                    "val": "54.544"
                },
                "BudgetYearOneBase": {
                    "val": "54.544"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "53.526"
                },
                "CurrentYear": {
                    "val": "53.82"
                },
                "BudgetYearOne": {
                    "val": "55.045"
                },
                "BudgetYearOneBase": {
                    "val": "55.045"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.604"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0.501"
                },
                "BudgetYearOneBase": {
                    "val": "0.501"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.604"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.501"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.501"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "FJ2"
                    },
                    "ProjectTitle": {
                        "val": "Army SHARP RDTE"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.53"
                        },
                        "CurrentYear": {
                            "val": "1.6"
                        },
                        "BudgetYearOne": {
                            "val": "1.599"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.599"
                        },
                        "BudgetYearTwo": {
                            "val": "1.599"
                        },
                        "BudgetYearThree": {
                            "val": "1.599"
                        },
                        "BudgetYearFour": {
                            "val": "1.599"
                        },
                        "BudgetYearFive": {
                            "val": "1.599"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "11.125"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds contracts that cover critical research needs of the Army Sexual Harassment \/ Assault Response and Prevention (SHARP) Office and the greater Army with a specific focus on prevention. In Fiscal Year (FY) 2020 this contract achieves three goals: (1) to inform sexual harassment prevention research efforts (e.g., Consortium Research Fellows Program), (2) examine the nature of offending within the military to inform effective sexual assault prevention efforts, and (3) assess the efficacy of training\/prevention\/outreach efforts related to sexual assault, in particular but not limited to male service members. Ongoing efforts to meet the first goal will explore the nature of sexual harassment in the Army, identify the organizational costs related to harassment (e.g., increased turnover, lower job satisfaction, and job performance), and examine the role of sexual harassment as it relates to sexual assault within the continuum of harm. Based on these studies, the performer will recommend effective sexual harassment prevention strategies. Studies will ensure that Army SHARP programs build climates for dignity and respect free of sexual harassment. Some of these efforts may be achieved through a collaboration with the Consortium Research Fellows Program.\n\nTo meet the second goal, studies will examine behavioral patterns in offending within military sexual assault cases. For instance, behavioral patterns may reveal the nature of military sexual assault or identify potential vulnerabilities that could lead someone to perpetrate sexual assault. Studies may also be informed by offender patterns observed in research using administrative data sources. Based on this research, the performer will identify ways to reduce risk of sexual offending behavior, recommend ways to improve skills and abilities that will bolster one's ability to engage in healthy relationships, and inform effective sexual assault prevention practices. \n\nTo meet the third goal, research will (1) conduct male-specific assessments and (2) conduct other assessments that will assess the efficacy of training\/prevention\/ outreach efforts related to sexual assault. The research will characterize the behaviors associated with military men's victimization and how they differ from those of service women, men's decision processes to file a formal report of sexual assault, and their experiences with the military sexual assault response systems. In particular, the research will focus on male victimization that occurred during military service rather than childhood sexual assault. Based on this research, the performer will identify ways to improve tailored recommendations for responding to and supporting male victims. This research will improve DoD prevention and response for male Service members. To meet the second part of this goal, the research may conduct assessments to evaluate the efficacy of training\/prevention\/outreach efforts related to sexual assault. This may involve conducting evaluation research to assess the effectiveness of individual programs or practices. Based on this research, the performer will determine whether these programs are effective and propose ways to improve SHARP efforts. This research will ensure that SHARP programs deliver effective training\/ prevention\/outreach."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Role Identifications"
                                    },
                                    "Description": {
                                        "val": "Funding is required to ensure that Army SHARP is in compliance with multiple Service or DoD requirements. NDAA Requirement S585 (FY 2012) requires the development of SAPR curriculum for Service members and civilian employees, NDAA Requirement 1725c (FY 2014) requires the identification of qualifications needed for Service and civilian personnel who are assigned to positions that include SAPR functions, NDAA Requirement S1733 requires the review of SAPR training and recommendations for modification based on identified inadequacies, and NDAA Requirement S538 (FY 2016) dictates that the Services develop efforts to improve prevention and response for male victims of sexual assault. Conducting research to meet these requirements is a necessary step in ensuring that training, prevention and outreach activities are having the desired effect and impact on the Total Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.53"
                                            },
                                            "Text": {
                                                "val": "Worked to finalize requirements for FY20 study requirements\/deliverables to ensure the studies meet the three goals: (1) to inform sexual harassment prevention research efforts, (2) examine the nature of offending within the military to inform effective sexual assault prevention efforts, and (3) assess the efficacy of training\/prevention\/outreach efforts related to sexual assault, in particular but not limited to male service members."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.527"
                                            },
                                            "Text": {
                                                "val": "To meet the second goal, research will examine behavioral patterns in offending within military sexual assault cases. For instance, behavioral patterns may reveal the nature of military sexual assault or identify potential vulnerabilities that could lead someone to perpetrate sexual assault. The research may also be informed by offender patterns observed in research using administrative data sources. Based on this research, the performer will identify ways to reduce risk of sexual offending behavior, recommend ways to improve skills and abilities that will bolster one?s ability to engage in healthy relationships, and inform effective sexual assault prevention practices.\n\nTo meet the third goal, research will (1) conduct male-specific assessments and (2) conduct other assessments that will assess the efficacy of training\/prevention\/outreach efforts related to sexual assault. The research will characterize the behaviors associated with military men?s victimization and how they differ from those of service women, men?s decision processes to file a formal report of sexual assault, and their experiences with the military sexual assault response systems. In particular, the research will focus on male victimization that occurred during military service rather than childhood sexual assault. Based on this research, the performer will identify ways to improve tailored recommendations for responding to and supporting male victims. This research will improve DoD prevention and response for male Service members. To meet the second part of this goal, the research may conduct assessments to evaluate the efficacy of training\/prevention\/outreach efforts related to sexual assault. This may involve conducting evaluation research to assess the effectiveness of individual programs or practices. Based on this research, the performer will determine whether these programs are effective and propose ways to improve SHARP efforts. This research will ensure that SHARP programs deliver effective training\/prevention\/outreach."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.599"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.599"
                                            },
                                            "Text": {
                                                "val": "In FY2021, SHARP  will continue research into all three goals.   A key effort of 2021 in all three goals will be to take the results of 2020 efforts and began more focused efforts on the areas and topics that appear to have the most promise in each area, looking at shorter-term and longer- term possibilities in each area.   \nIn Goal 1) Inform sexual harassment prevention efforts, the research may expand to examine other behaviors related to the sexual harassment-sexual assault continuum of harm to determine the relationships between other undesirable behaviors e.g. bullying and hazing, personal and personality characteristics to determine potential root and common causes and the etiology of behavioral patterns,  personal attributes and the cultural milieu and the interrelationships between individual perpetrators, individual victims and military culture that contribute as risk or protective factors.  \nIn Goal 2) Examine behavioral patterns in offending within military sexual assault cases, research results will be compared, contrasted and if relevant combined with the results of Goal 1 research to determine differences and commonalities along the continuum of harm and different means of addressing each and all.  \n In Goal 3a) Male-specific assessments and determinants of male victimization the search for commonalities and differences in personal attributes and behavior will continue and the possibilities for prevention mechanisms explored.\nFor each of the Goals and in general, assessments of current training and prevention efforts will continue and be informed by the results of the SAPRO-directed PPOA to be conducted in 2020.  The results for each goal will be reviewed for potential for military and Army- feasible solutions to be developed in the prevention spectrum including but not limited to:  universal education, awareness, messaging, social norms marketing, early identification and targeted education and prevention and remediation, accession marketing and policy and deterrent adjudication processes.  2021 research emphasis will be placed on a balance between potential short-term, high impact prevention efforts and longer term efforts that will require more fundamental research for full understanding or require shifts in military culture before the results can be fully exploited and realized."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding for FY20 and FY21 are the same."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.073"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "MDEP:VSHP does not have any other Army Line Item associated with this project."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M65"
                    },
                    "ProjectTitle": {
                        "val": "Army Test and Evaluation Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "48.058"
                        },
                        "CurrentYear": {
                            "val": "48.264"
                        },
                        "BudgetYearOne": {
                            "val": "49.429"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.429"
                        },
                        "BudgetYearTwo": {
                            "val": "50.078"
                        },
                        "BudgetYearThree": {
                            "val": "50.564"
                        },
                        "BudgetYearFour": {
                            "val": "52.616"
                        },
                        "BudgetYearFive": {
                            "val": "53.632"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "352.641"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides funding for the salaries and related personnel benefits for the authorized civilian personnel positions that provide for the management functions and the technical direction of the United States (U.S.) Army Test and Evaluation Command (ATEC) mission located at Aberdeen Proving Ground (APG), Maryland. ATEC plans, conducts and integrates developmental testing, independent operational testing, independent evaluations, and assessments to provide essential information to Soldiers and acquisition decision makers supporting the American Warfighter.  Additionally, ATEC is a Direct Support to the Army Futures Command (AFC). ATEC provides testing and independent evaluation support to AFC Cross Functional Team (CFT) efforts including risk reduction support to experiments, demonstrations, requirements, research, development, and acquisition. As such, ATEC priorities are aligned to the Army's Modernization priorities. \n\nThis Project includes staff\/management functions of resource management, human resources, safety, security, environmental, strategic planning and information\/technology support for command-wide databases in support of the developmental, evaluation and operational test mission with technical direction to the Army Evaluation Center (AEC), APG, Maryland; to the Operational Test Command (OTC), Fort Hood, Texas which consists of three forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Air Defense Artillery Test Directorate, Fort Bliss, Texas; and the Fires Test Directorate, Fort Sill, Oklahoma) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas; and to the seven Major Range and Test Facility Base (MRTFBs) and one non-MRTFB test range: Aberdeen Test Center (ATC) at APG, Maryland; West Desert Test Center (WDTC) at Dugway Proving Ground (DPG), Utah; Electronic Proving Ground (EPG) at Fort Huachuca, Arizona; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Yuma Test Center (YTC) at Yuma Proving Ground (YPG), Arizona; Cold Regions Test Center (CRTC) at Fort Greely, Alaska; and Tropic Regions Test Center (TRTC) at various locations, as well as for Redstone Test Center (RTC) at Redstone Arsenal, Alabama. This is the operating budget for ATEC Headquarters, which provides technical direction for the annual execution of approximately 2,300 developmental tests; approximately 53 operational events; and approximately 900 Evaluation and Safety documents supporting acquisition programs. ATEC's total authorized workforce amounts to a $1.7 billion program in direct and reimbursable funding."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ATEC"
                                    },
                                    "Description": {
                                        "val": "Civilian labor and other support required to manage and administer the Army test and evaluation mission at ATEC. ATEC plans, conducts and integrates developmental testing, independent operational testing, independent evaluations, assessments and experiments to provide essential information to Soldiers and acquisition decision makers supporting the American Warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "48.042"
                                            },
                                            "Text": {
                                                "val": "Funded authorized civilian salaries, associated expenses (supplies, equipment, travel, etc.) and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "47.789"
                                            },
                                            "Text": {
                                                "val": "Will fund authorized civilian salaries, associated expenses (supplies, equipment, travel, etc.) and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "49.429"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "49.429"
                                            },
                                            "Text": {
                                                "val": "Will continue to fund authorized civilian salaries, associated expenses (supplies, equipment, travel, etc.) and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Continuity of effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 National Defense Authorization Act (NDAA) Section 825 Major Defense Acquisition Program (MDAP) Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA Section 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.475"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "XW7"
                    },
                    "ProjectTitle": {
                        "val": "Command HQ - ARI"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.938"
                        },
                        "CurrentYear": {
                            "val": "3.956"
                        },
                        "BudgetYearOne": {
                            "val": "4.017"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.017"
                        },
                        "BudgetYearTwo": {
                            "val": "4.108"
                        },
                        "BudgetYearThree": {
                            "val": "4.146"
                        },
                        "BudgetYearFour": {
                            "val": "4.193"
                        },
                        "BudgetYearFive": {
                            "val": "4.193"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "28.551"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The United States (U.S.) Army Research Institute for the Behavioral and Social Sciences (ARI) is the only Science and Technology (S&T) laboratory that conducts research to enhance the Soldier lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., culture of dignity, respect, and inclusion). This Project supports the non-Army Management Headquarters Activity (non-AMHA) management and administrative functions to enable ARI to accomplish its research mission and includes activities such as budget execution, procurement oversight, Research, Development, Test, & Evaluation (RDTE) program planning and evaluation, management control, security\/safety, logistics, information technology, and personnel\/manpower execution and oversight. ARI's behavioral and social science research provides effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Headquarters Support"
                                    },
                                    "Description": {
                                        "val": "This project supports Civilian Pay and support ARI headquarters activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.938"
                                            },
                                            "Text": {
                                                "val": "Provided personnel for management, administrative, personnel, budget, and support functions at a level consistent with Army and mission requirements to meet the needs of ARI as an Army Laboratory conducting the Army's personnel, training, leader development, and organizational performance R&D program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.952"
                                            },
                                            "Text": {
                                                "val": "Providing personnel and support for management, administrative, personnel, budget, and information technology functions at a level consistent with Army and mission requirements to meet the needs of ARI as an Army Science and Technology Reinvention Laboratory (STRL), to include emphasis on completing transition to the STRL personnel development and performance management policies and practices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.017"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.017"
                                            },
                                            "Text": {
                                                "val": "Will provide personnel and support for management, administrative, personnel, budget,  and information technology functions at a level consistent with Army and mission requirements to meet the needs of ARI as an Army Science and Technology Reinvention Laboratory (STRL), to include emphasis on evaluating ARI?s implementation of the STRL systems, policies, and practices."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.004"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}