{
    "id": "2021-AirForce-PB-3600-JBOOK-92b46cd12ef50ea764b60089f2b7a79948671e66250d4f7c6be7e00a142e885b-16",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V1-U_RDTE_JustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603030F"
        },
        "ProgramElementTitle": {
            "val": "AF Foundational Development\/Demos"
        },
        "R1LineNumber": {
            "val": "17"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "103.280"
            },
            "BudgetYearOneBase": {
                "val": "103.280"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "115.322"
            },
            "BudgetYearThree": {
                "val": "113.350"
            },
            "BudgetYearFour": {
                "val": "115.538"
            },
            "BudgetYearFive": {
                "val": "124.351"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates capabilities that enable sustainment, increase the affordability and reliability of manufacturing, and enhance Airman and weapon system performance and effectiveness to provide compelling advantage to the warfighter.  Advances to technologies and materials under this program reduce life cycle costs; ensure the industrial base for Air Force systems; boost quality, increase readiness, and improve safety, survivability, and operability of weapon systems; predict, evaluate, and mitigate bioeffects on personnel and mission performance; and enable airmen performance.  \n\nTo the greatest extent practical, integrated technology demonstrations will utilize modeling and simulation, cross-discipline system integration (e.g., platforms, avionics, propulsion, materials, manufacturing, human performance, cybersecurity, and counter directed energy weapons) to demonstrate in a near-operational environment advanced science and technology capabilities that reduce operational risk and accelerate incorporation of technologies into existing and future operational systems.\n\nIn the FY 2021, the Air Force is consolidating its existing thirteen Advanced Technology Development (ATD), Research Development Test and Evaluation (RDT&E), Budget Activity 03 (BA 03) PEs into five new capability focused RDT&E BA 03 PEs to better align with the Air Force Science and Technology (S&T) Strategy signed by the Secretary of the Air Force in April 2019. This consolidation will improve and accelerate delivery of integrated transformational, multidisciplinary, collaborative technology solutions necessary to enable new Air Force warfighting capabilities that support of the National Defense Strategy. This new structure will provide the Air Force and Congress with a clearer understanding and increased transparency of integrated technology solutions and demonstrations key to enabling the Air Force future force design.\n\nIn FY 2021, the entirety of PE 0603112F, Advanced Materials for Weapon Systems, and associated Projects will be transferred to PE 0603030F, AF Foundational Development\/Demos, with the exception of the Pervasive and Affordable Metals Technologies effort which will be transferred to PE 0602102F, Materials, Project 624347, Materials for Structures, Propulsion, and Subsystems.\n\nIn FY 2021, the entirety of PE 0603199F, Sustainment Science and Technology (S&T), and associated Projects\/activities are transferred to PE 0603030F, AF Foundational Development\/Demos.\n\nIn FY 2021, the entirety of PE 0603680F, Manufacturing Technology Program, and associated Projects\/Activities are transferred to PE 0603030F, AF Foundational Development\/Demos.\n\nIn FY 2021, the entirety of Project 635323, Directed Energy Bioeffects Parameters; and Project 635324, Human Dynamics and Terrain Demonstration, are transferred from PE 0603456F, Human Effectiveness Advanced Technology Development, to PE 060303F, AF Foundational Development\/Demos. \n\nThese transfers detailed above are part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept, and Air Force S&T Strategy, April 2019. \n\nThe Air Force Science and Technology portfolio will continued to be managed at the Enterprise level by the Air Force Technology Executive Officer, dual-hatted as the Air Force Research Laboratory (AFRL) Commander, and executed across the various AFRL Technology Directorates and locations.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science and technology capabilities.  The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602602F, 0602605F, 0602788F, 1206601SF, and 0602298F.\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "103.280"
                },
                "BudgetYearOneBase": {
                    "val": "103.280"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "103.280"
                },
                "BudgetYearOneBase": {
                    "val": "103.280"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "103.280"
                                },
                                "BudgetYearOneBase": {
                                    "val": "103.280"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase is FY 2021 of $103.280 million is due to the following PEs, Projects, and efforts being transferred to PE 0603030F, AF Foundational Development\/ Demos:\n\n    1) The entirety of PE 0603112F, Advanced Materials for Weapon Systems, with the exception of the Pervasive and Affordable Metals Technologies effort\n    2) The entirety of PE 0603199F, Sustainment Science and Technology (S&T)\n    3) The entirety of PE 0603680F, Manufacturing Technology Program\n    4) The entirety of Project 635323, Directed Energy Bioeffects Parameters; and Project 635324, Human Dynamics and Terrain Demonstration, from PE 0603456F, Human Effectiveness Advanced Technology Development\n\nThese transfers detailed above are part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept, and Air Force S&T Strategy, April 2019."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "632100"
                    },
                    "ProjectTitle": {
                        "val": "Laser Hardened Materials"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "13.734"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.734"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "16.304"
                        },
                        "BudgetYearThree": {
                            "val": "16.693"
                        },
                        "BudgetYearFour": {
                            "val": "17.079"
                        },
                        "BudgetYearFive": {
                            "val": "17.425"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates advanced materials technologies that enhance protection for Air Force aircrews to ensure safety and to enable aircrews to perform required missions in threat environments.  Advanced materials technologies also enhance protection for Air Force sensors and systems to ensure safety, survivability, and operability in threat environments.\n\nIn FY 2021, the entirety of Project 632100, Laser Hardened Materials, is transferred from PE 0603112F, Advanced Materials for Weapon Systems, to PE 0603030F, AF Foundational Development\/Demos, Project 632100, Laser Hardened Materials, as part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept, and Air Force Science and Technology Strategy, April 2019.  The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Materials and Manufacturing Technology Directorate located in Wright Patterson Air Force Base, Ohio, This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aerospace Systems Protection"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate materials technologies that enhance hardening for sensors, avionics, and components to increase survivability and mission effectiveness of aerospace systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior years, this work is performed under the Aerospace Systems Protection effort in PE 0603112F, Advanced Materials for Weapons Systems, Project 632100, Laser Hardened Materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.455"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.455"
                                            },
                                            "Text": {
                                                "val": "Continue to assess the demonstrated results and transition the use of protection technologies for future sensor designs and strategies to mitigate directed energy damage for visual\/near, short-wave, and mid-wave infrared detectors. Continue transitioning new technologies and integrate the developments into light, operator friendly survivable electro-optic sensors that provide full spectrum protection for missile warning. Continue analyzing the high-performance properties of damage limiting semiconductor materials designed to harden electro-optic imaging sensors. Continue to transition developed laser countermeasures for survivability of dynamic electro-optic\/infrared imagers. Continue to advance the employment and integration of evolved computational materials science to model materials characteristics to increase accuracy and shorten design cycle time of coatings development for use in sensor hardening. Transition and continue technology development and maturation to develop defensive capability for air systems airframe and anti-access munitions hardening assessments and solutions. Initiate development of materials for survivable next generation aircraft sensor systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $6.455 million. Funding increased due to the transfer and realignment of this work from Aerospace Systems Protection effort in PE 0603112F, Advanced Materials for Weapons Systems, Project 632100, Laser Hardened Materials, as part of the Air Force RDT&E BA 03 consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircrew Protection"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate materials technologies that enhance protection for Air Force aircrews to ensure safety and to enable aircrews to perform required missions in a threat environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior years, this work is performed under the Aircrew Protection effort in PE 0603112F, Advanced Materials for Weapons Systems, Project 632100, Laser Hardened Materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.279"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.279"
                                            },
                                            "Text": {
                                                "val": "Continue to develop, validate, demonstrate, and transition laser protection materials and technologies for personnel protection. Continue to validate and develop light-weight helmet-mounted sensor hardening materials focusing on next-generation nighttime specialized sensors. Continue to advance transition efforts and development of visor based aircrew protection materials with agile protection. Continue to evaluate and assess new materials and advances in characterization and demonstration of eye protection technologies using computational materials science tools. Continue to transition, validate, mature, and test improvements to functionality and performance of personnel protection technologies in expected operational conditions. Continue development and testing of materials technologies to protect against nuclear flash blindness."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $7.279 million. Funding increased due to the transfer and realignment of this work from Aircrew Protection effort in PE 0603112F, Advanced Materials for Weapons Systems, Project 632100, Laser Hardened Materials, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "633153"
                    },
                    "ProjectTitle": {
                        "val": "Non-Destructive Inspection Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "6.629"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.629"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.659"
                        },
                        "BudgetYearThree": {
                            "val": "6.841"
                        },
                        "BudgetYearFour": {
                            "val": "7.018"
                        },
                        "BudgetYearFive": {
                            "val": "7.161"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates advanced nondestructive inspection and evaluation technologies to monitor performance integrity and to detect failure causing conditions in weapon systems components and materials. Nondestructive inspection and evaluation capabilities greatly influence and\/or limit many design, manufacturing, and maintenance practices. This project provides technology to satisfy Air Force requirements to extend the lifetime of current systems through increased reliability and cost-effectiveness at field and depot maintenance levels. Equally important is assuring manufacturing quality, integrity, and safety requirements are built in.\n\nIn FY 2021, the entirety of Project 633153, Non-Destructive Inspection Development, is transferred from PE 0603112F, Advanced Materials for Weapon Systems, to PE 0603030F, AF Foundational Development\/Demos, Project 633153, Non-Destructive Inspection Development, as part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept, and Air Force Science and Technology Strategy, April 2019. The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Materials and Manufacturing Technology Directorate located in Wright Patterson Air Force Base, Ohio. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Engine Inspection Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced technologies to improve capabilities to inspect for cracks and other damage to extend the total safe life of turbine engines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior years, this work is performed under the Advanced Engine Inspection Technologies effort in PE 0603112F, Advanced Materials for Weapons Systems, Project 633153, Non-Destructive Inspection Development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.657"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.657"
                                            },
                                            "Text": {
                                                "val": "Continue nondestructive inspection\/evaluation tools to include additive manufacturing processes and to assess materials and damage state of critical turbine engine components for the purpose of extending the useful life without increasing risk of in-flight failure of fracture critical to gas turbine engine components. Continue to mature the validation process for model prediction, accuracy, and effectiveness of digital nondestructive inspection technologies and demonstrate tool automation for high confidence repeatable results, to include advanced manufacturing processes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $1.657 million. Funding increased due to the transfer and realignment of this work from the Advanced Engine Inspection Technologies effort in PE 0603112F, Advanced Materials for Weapons Systems, Project 633153, Non-Destructive Inspection Development, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Special Material Inspection Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced inspection technologies supporting low-observable (LO) systems to enhance affordability and ensure full performance and survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior years, this work is performed under the Special Material Inspection Technologies effort in PE 0603112F, Advanced Materials for Weapons Systems, Project 633153, Non-Destructive Inspection Development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.260"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.260"
                                            },
                                            "Text": {
                                                "val": "Continue the transition process to depots and flight lines for improved methods to acquire and analyze data to facilitate improved characterization, registration, and tracking of degradation and damage of special materials that enables\/ensures more affordable coatings assessment. Continue to validate tools to improve characterization and failure modes of specialty multilayer coatings. Continue to develop automation for robotic technologies for visual inspections that will realize human-assisted inspection capabilities and begin to provide capabilities for automated multi-spectral characterization."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $1.260 million. Funding increased is due to the transfer and realignment of this work from the Special Material Inspection Technologies effort in PE 0603112F, Advanced Materials for Weapons Systems, Project 633153, Non-Destructive Inspection Development, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced System Monitoring Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced systems status monitoring technologies to provide on-board and embedded sensing to gain continuous awareness of the state of key subsystems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior years, this work is performed under the Advanced System Monitoring Technologies effort in PE 0603112F, Advanced Materials for Weapons Systems, Project 633153, Non-Destructive Inspection Development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.712"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.712"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate advanced analytical methods to more accurately assess the location, and register spatial location, of damage detected using nondestructive inspection data and results. Develop augmented reality technologies to improve the process of performing non-destructive evaluation tasks, acquiring and archiving data and reporting results, and enabling improved inspector guidance and visualization. Continue development and transition of novel approaches to collect, analyze, transport, archive, and use digital nondestructive inspection data and information. Continue enhanced methods for compiling, reporting, collecting and rapidly analyzing digital nondestructive testing and evaluation data necessary for improved damage detection and characterization. Demonstrate and transition technologies to locate damage to composite structures without coating removal and to inspect composite structures with complex geometry. Continue the transition and integration of computational materials science tools with provide data necessary for life prediction methods to enable risk-based life management."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $3.712 million.  Funding increased due to the transfer and realignment of this work from the Advanced System Monitoring Technologies in PE 0603112F, Advanced Materials for Weapons Systems, Project 633153, Non-Destructive Inspection Development, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "633946"
                    },
                    "ProjectTitle": {
                        "val": "Materials Transition"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "14.806"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.806"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "15.807"
                        },
                        "BudgetYearThree": {
                            "val": "16.121"
                        },
                        "BudgetYearFour": {
                            "val": "16.444"
                        },
                        "BudgetYearFive": {
                            "val": "16.778"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates advanced materials and processing technologies for fielded and planned Air Force weapon, airframe, and propulsion applications.  Advanced materials and processes that have matured beyond applied research are characterized, critical data are collected, and critical evaluations in the proposed operating environment are performed.  This design and scale-up data improves the overall affordability of promising materials and processing technologies, providing needed initial incentives for their industrial development.\n\nIn FY 2021, the entirety of Project 633946, Materials Transition, is transferred from PE 0603112F, Advanced Materials for Weapon Systems, to PE 0603030F, AF Foundational Development\/Demos, Project 633946, Materials Transition, as part of the Air Force RDT&E BA 03 PE consolidation, in order to realign technology areas that better support the National Defense Strategy, Air Force Future Operating Concept and AF Science and Technology Strategy, April 2019. The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Materials and Manufacturing Technology Directorate located in Wright Patterson Air Force Base, Ohio. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Vehicle Materials Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate materials and processes technologies for air vehicle and subsystems to enhance lift, propulsion, Low-Observable (LO) performance, power generation management, and affordability of air vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior years, this work is performed under the Air Vehicle Materials Technology effort in PE 0603112F, Advanced Materials for Weapons Systems, Project 633946, Materials Transition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.143"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.143"
                                            },
                                            "Text": {
                                                "val": "Continue development of technologies for organic engine lifing analysis for enhanced engine component risk management capability. Continue development, characterization, and transitioning development of materials to protect infrared apertures on next generation hardened assets. Continue to validate and verify results of microstruture-sensitive lifing methodologies that lower life cycle cost and advance performance characteristics of airframe and engine components in order to initiate development of next generation modeling tools that incorporate residual stress effects on component life. Initiate development and characterization of materials for application in nuclear systems and protected infra-red apertures for next-generation hardened assets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $8.143 million. Funding increased due to the transfer and realignment of this work from the Air Vehicle Materials Technologies effort in PE 0603112F, Advanced Materials for Weapons Systems, Project 633946, Materials Transition, as part of the RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Temperature Material Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate affordable, novel high temperature materials\/structures and thermal management concepts to enable future defense capabilities for prompt global strike concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior years, this work is performed under the High Temperature Material Technologies effort in PE 0603112F, Advanced Materials for Weapons Systems, Project 633946, Materials Transition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.663"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.663"
                                            },
                                            "Text": {
                                                "val": "Continue to work on multimaterial structures that optimally address operational temperature zones for hot structure and expendable thermal protection systems made out of advanced ceramics, ceramic matrix composites, hybrids, advanced and affordable metals, and intermetallics. Complete transition 2700-degree Fahrenheit ceramic matrix composites for turbine hot section components to industry. Continue to develop high performance metals for next-generation turbine disk and low cost propulsion, aerostructure and munitions components. Continue development and demonstrate advanced materials and process control to enable complex structural components via additive manufacturing. Continue establishing a metallic additive design center. Continue development of low cost metallic turbine engine disks made via powder processing technologies for use in high temperature, aggressive environment. Continue transitioning computational and data analytics tools that enable production of affordable, complex shape metal components made via additive manufacturing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $6.663 million. Funding increased due to the transfer and realignment of this work from High Temperature Material Technologies effort in PE 0603112F, Advanced Materials for Weapons Systems, Project 633946, Materials Transition, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635280"
                    },
                    "ProjectTitle": {
                        "val": "Manufacturing Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "40.401"
                        },
                        "BudgetYearOneBase": {
                            "val": "40.401"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "45.943"
                        },
                        "BudgetYearThree": {
                            "val": "46.987"
                        },
                        "BudgetYearFour": {
                            "val": "48.036"
                        },
                        "BudgetYearFive": {
                            "val": "49.012"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project executes technical programs to maintain and develop an affordable and reliable industrial base and manufacturing capability that will be responsive to warfighter needs.  The Project develops and improves manufacturing technologies and processes to enable cost reduction, improve component and system quality, and enhance industrial capability.  Value stream modifications and manufacturing throughput improvements are effected to shorten cycle times of weapon systems during design, development, production and sustainment.  Manufacturing Technologies objectives are conducted through industrial partnerships which enable the demonstration of manufacturing technologies for existing weapon system upgrades and\/or for new warfighter systems.  Efforts in the program have been coordinated through the Department of Defense Science and Technology Executive Committee process to harmonize efforts and eliminate duplication.\n\nIn FY 2021, the entirety of Project 635280, Manufacturing Technologies, is transferred from PE 0603680F, Manufacturing Technology Program, to PE 0603030F, AF Foundational Development\/Demos, Project 635280, Manufacturing Technologies, as part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019.  The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Materials and Manufacturing Technology Directorate located in Wright Patterson Air Force Base, Ohio. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainment Manufacturing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and transition pervasive affordability and producibility technologies for the sustainment of weapons systems and processes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior years, this work is performed under the Sustainment Manufacturing Technologies effort in PE 0603680F, Manufacturing Technology Program, Project 635280, Manufacturing Technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.312"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.312"
                                            },
                                            "Text": {
                                                "val": "Continue to advance high demand specialized manufacturing technologies to develop cost effective conventional production, overhaul, and specialty material repair technologies to enable affordable sustainment of aircraft systems. Continue to develop and distribute advanced manufacturing techniques and concepts for agile sustainment and automation technology development for inspection and depot maintenance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $11.312 million. Funding increased due to the transfer and realignment of this work from the Sustainment Manufacturing Technologies effort in PE 0603680F, Manufacturing Technology Program, Project 635280, Manufacturing Technologies, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Manufacturing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and transition affordable advanced manufacturing technologies for weapons systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior years, this work is performed under the Advanced Manufacturing Technologies effort in PE 0603680F, Manufacturing Technology Program, Project 635280, Manufacturing Technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.089"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.089"
                                            },
                                            "Text": {
                                                "val": "Continue to refine development and demonstration of advanced agile manufacturing and repair capabilities for more affordable and increased availability of advanced turbine and small engine propulsion technologies, intelligence, surveillance and reconnaissance and communications technologies, transparent ceramics producibility, and the producibility of air armaments. Continue to refine development of high demand distributed agile manufacturing applications and structures affordability with a focus on low cost attritable systems and open pod architecture. Continue transitioning successful technologies. Continue the development and demonstration of manufacturing capabilities for producibility and affordability of aerospace structures and hypersonics and identification of transformational processing needs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $5.100 million. Funding increased due to the transfer and realignment of this work from the Advanced Manufacturing Technologies effort in PE 0603680F, Manufacturing Technology Program, Project 635280, Manufacturing Technologies, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635323"
                    },
                    "ProjectTitle": {
                        "val": "Directed Energy Bioeffects Parameters"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.278"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.278"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.602"
                        },
                        "BudgetYearThree": {
                            "val": "6.734"
                        },
                        "BudgetYearFour": {
                            "val": "6.869"
                        },
                        "BudgetYearFive": {
                            "val": "7.008"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project develops, demonstrates, and transitions technologies to predict, evaluate, and mitigate the effects of directed energy on personnel and mission performance, and exploits the offensive capabilities of directed energy systems. This project develops the human components of the guidelines for testing, deployment, and protection from high power microwave and high energy laser systems and uses this information to enhance the effectiveness of these weapon systems in air, space, and cyber operations. This project develops tools and plug-ins that enhance mission and engagement models, provide predictive risk analysis for deployment of Directed Energy systems, and analyzes systems for use in the Department of Defense.  This project develops tools and analysis techniques to model and demonstrate the use of fielded protection on Airman performance, and informs developers of design specifications to optimize design of novel weapon systems.\n\nIn FY 2021, the entirety of Project 635323, Directed Energy Bioeffects Parameters, is transferred from PE 0603456F, Human Effectiveness Advanced Technology Development, to PE 0603030F, AF Foundational Development\/Demos, Project 635323, Directed Energy Bioeffects Parameters, as part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019.  The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Airman Systems Technology Directorate located in Joint Base San Antonio Fort Sam Houston, Texas. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Directed Energy Bioeffects"
                                    },
                                    "Description": {
                                        "val": "This project combined two efforts into a single effort to better align the directed energy modeling simulation and analysis supporting both radio-frequency and laser (optical) bioeffects advanced demonstration. Develop and demonstrate modeling capabilities to assess collateral hazards from high power directed energy laser and radio frequency (RF) systems, including the use of probabilistic risk assessment techniques and analysis of system level effects on the Airman. Develop and demonstrate optical protective technologies for aircrew and ground personnel to provide protection against directed energy threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior years, this work is performed under the Optical Radiation Bioeffects effort and the Radio Frequency Bioeffects effort in PE 0603456F, Human Effectiveness Advanced Technology Development, Project 635323, Directed Energy Bioeffects Parameters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.278"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.278"
                                            },
                                            "Text": {
                                                "val": "Provide hazard analysis for High Energy Laser flight safety reports. Readdress safety analysis for advancing Department of Defense directed energy concepts for safety review and technical review boards.  Continue development of high peak power assessment models and tools to address real world concerns. Conclude evaluation of next generation of nuclear flash-blindness technologies and the impact on mission performance. Continue integration of radio frequency hazard, optical radiation hazard, and vision analysis and tools into Advanced Framework for Simulation, Integration and Modeling (AFSIM) architecture and the Endgame Framework architecture for future transitions in Joint weaponeering and targeteering tool suites.  Begin development of Integrated Vision Modeling libraries to inform display design and advance protection technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $5.278 million. Funding increased due to the transfer and realignment of this work from the Radio Frequency Bioeffects effort and the Optical Radiation Bioeffects effort from PE 0603456F, Human Effectiveness Advanced Technology Development, Project 635323, Directed Energy Bioeffects Parameters, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635324"
                    },
                    "ProjectTitle": {
                        "val": "Human Dynamics and Terrain Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.499"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.499"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.276"
                        },
                        "BudgetYearThree": {
                            "val": "3.655"
                        },
                        "BudgetYearFour": {
                            "val": "3.407"
                        },
                        "BudgetYearFive": {
                            "val": "7.904"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project develops, demonstrates, and transitions technologies to sustain airman performance in adverse operational and\/or training environments (e.g., heat, altitude, high G), monitor and mitigate in-flight unexplained physiological events (e.g., hypoxia, hyperoxia), and prevent human performance related mishaps through real-time monitoring and mitigation—particularly through highly automated or autonomous systems.\n\nIn FY 2021, the entirety of Project 635324, Human Dynamics and Terrain Demonstration, is transferred from PE 0603456, Human Effectiveness Advanced Technology Development to PE 0603030F, AF Foundational Development\/Demos, Project 635324, Human Dynamics and Terrain Demonstration, as part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019.  The Project and associated efforts will continue to be managed by the Air Force Research Laboratory Airman Systems Technology Directorate located in Wright Patterson Air Force Base, Ohio. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sensing and Assessment"
                                    },
                                    "Description": {
                                        "val": "This project combined two efforts into a single effort to better align product development.  Develop products that integrate biological, physiological, neural, environmental, and behavioral sensing capabilities with validated analytics and assessments to sustain and enhance airman performance in adverse operational and\/or training environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior years, this work is performed under the Human Analyst Augmentation effort and the Human Trust and Interaction effort in PE 0603456F, Human Effectiveness Advanced Technology Development, Project 635324, Human Dynamics and Terrain Demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.499"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.499"
                                            },
                                            "Text": {
                                                "val": "Initiate Integrated Cockpit Sensing (ICS) effort to develop validated sensor suite providing real-time pilot alerting and data storage for unexplained physiological event (UPE) root cause analysis.  Perform sensor component down select following laboratory environmental (altitude chamber, centrifuge) testing.  Conduct sensor component flight demonstrations in T-6 and F-16.  Conduct ground-based demonstration of prototype integrated capability in F-35 simulation and simulator-based training exercises."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $5.499 million. Funding increased due to the transfer and realignment of this work from the Human Analyst Augmentation effort and the Human Trust and Interaction effort in PE 0603456F, Human Effectiveness Advanced Technology Development, Project 635324, Human Dynamics and Terrain Demonstration, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635351"
                    },
                    "ProjectTitle": {
                        "val": "Technology Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "16.933"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.933"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "17.731"
                        },
                        "BudgetYearThree": {
                            "val": "16.319"
                        },
                        "BudgetYearFour": {
                            "val": "16.685"
                        },
                        "BudgetYearFive": {
                            "val": "19.063"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project develops and demonstrates mature Air Force Research Laboratory (AFRL) sustainment technologies such as: materials, corrosion, maintenance\/repair techniques, state awareness\/non-destructive inspection, health management, life prediction, low observable materials and processes, composite materials and logistics for transition into fielded Air Force systems to reduce life cycle sustainment costs and increase readiness. Technologies matured and demonstrated impact affordability and availability of fielded aerospace weapon systems by reducing sustainment costs, extending service life, and maintaining  mission readiness and capability. This program develops and demonstrates maintenance, life cycle management, and system\/fleet decision making technologies that can be implemented to address operational sustainment issues and could influence future system sustainability decisions via risk reduction to support inclusion into new systems. Studies are conducted to analyze processes and methodologies for application of technologies to address sustainment issues across the force, identifying cross cutting applications for fielded systems, and opportunities for building in sustainability into future applications. This program also develops and demonstrates affordable advanced composites for aircraft structures of fielded and emerging systems.  This includes studies, analysis, and tests for application of composites to address sustainment and affordability issues across the force. Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) process to harmonize efforts and eliminate duplication.\n\nIn FY 2021, the entirety of Project 635351, Technology Sustainment, is transferred from PE 0603199F, Sustainment Science and Technology (S&T), to PE 0603030F, AF Foundational Development\/Demos, Project 635351, Technology Sustainment, as part of the Air Force RDT&EBA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019.  The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Materials and Manufacturing Technology Directorate located in Wright Patterson Air Force Base, Ohio. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "System Health Management\/Assessment Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and transition state awareness\/system health management technologies. Conduct studies and analyses to design sustainability into future applications. The short-term tasks in this area are selected based on warfighter needs identified via a semi-annual, competitive process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior years, this work is performed under the System Health Management\/Assessment Technologies effort in PE 0603199F, Sustainment Science and Technology (S&T), Project 635351, Technology Sustainment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.520"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.520"
                                            },
                                            "Text": {
                                                "val": "Continue completion of the development of a system to reduce maintenance requirements of carbon monoxide detection system. Continue health assessments and capability development for fielded air\/space\/cyber systems and components. Continue development and demonstration of diagnostic technology airframe\/engine, launch vehicle, spacecraft, intercontinental ballistic missiles (ICBMs), and components. These efforts are in Air Force mission areas of Air, Space, and Cyber. Initiate new efforts based on competitive selection processes in FY 2020."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $5.520 million. Funding increased due to the transfer and realignment of this work from the Systems Health Management\/Assessment Technology effort in PE 0603199F, Sustainment Science and Technology (S&T), Project 635351, Technology Sustainment, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prevention\/Enhanced Maintainability Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and transition maintenance and sustainment technologies to improve component design, maintenance, replacement, and concepts for performance improvement and reduced maintenance burden. The short-term tasks in this effort are selected based on warfighter needs identified via a semi-annual, competitive process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior years, this work is performed under the Prevention\/Enhanced Maintainability Technologies effort in PE 0603199F, Sustainment Science and Technology (S&T), Project 635351, Technology Sustainment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.896"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.896"
                                            },
                                            "Text": {
                                                "val": "Continue rapid repair and materials development for aircraft battle damage repair of advanced fighter aircraft. Continue advanced canopy technology development. Continue total body nondestructive evaluation system for outer mold line inspection of advanced fighter aircraft. Continue development of materials and processes to reduce maintenance burden on low observable systems. Continue efforts to demonstrate high reliability of repair and maintenance technologies to increase service time between maintenance actions. Continue to develop, demonstrate, and transition maintenance and sustainment technologies to improve component design, maintenance, repair, replacement, and concepts for maintainer training, extending part life, and reduced maintenance burden spanning Air Force mission areas of Air, Space, and Cyber. Continue to develop abrasion resistance coating to protect composite material substrates for low observable systems. Continue to develop a flexible crack-blunting primer. Initiate other new efforts based on competitive selection processes in FY 2020."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $5.896 million. Funding increased due to the transfer and realignment of this work from the Prevention\/Enhanced Maintainability Technologies, PE 0603199F, Sustainment Science and Technology (S&T), Project 635351, Technology Sustainment, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management\/Improved Reliability Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and transition technologies to improve existing and new components, fleet management\/ decision-making tools, and supply chain\/sustainment infrastructure to decrease downtime and costs, and increase reliability. The short-term tasks in this effort are selected based on warfighter needs identified via a semi-annual, competitive process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior years, this work is performed under the Management\/Improved Reliability Technologies effort in PE 0603199F, Sustainment Science and Technology (S&T), Project 635351, Technology Sustainment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.517"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.517"
                                            },
                                            "Text": {
                                                "val": "Continue system development to provide prognostic capabilities for avionics components and analysis techniques to extend engine component service life. Continue efforts to develop system fleet management decision-making tools, maintenance\/repair data base technologies and techniques, and supply chain\/infrastructure approaches to reduce sustainment costs. These efforts span Air Force mission areas of Air, Space, and Cyber. Initiate new efforts based on competitive selection processes in FY 2020."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $5.517 million. Funding increased due to the transfer and realignment of this work from the Management\/Improved Reliability Technologies effort in PE 0603199F, Sustainment Science and Technology (S&T), Project 635351, Technology Sustainment, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}