{
    "id": "2021-Navy-PB-1319-MJBOOK-0-0-744c7ee94c2cc798fbfd935e35baade9caa8a86b67e6f22ecedd75220314848f-1",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601152N"
        },
        "ProgramElementTitle": {
            "val": "In-House Lab Independent Res"
        },
        "R1LineNumber": {
            "val": "2"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "19.123"
            },
            "CurrentYear": {
                "val": "19.121"
            },
            "BudgetYearOne": {
                "val": "19.113"
            },
            "BudgetYearOneBase": {
                "val": "19.113"
            },
            "BudgetYearTwo": {
                "val": "19.492"
            },
            "BudgetYearThree": {
                "val": "19.895"
            },
            "BudgetYearFour": {
                "val": "20.295"
            },
            "BudgetYearFive": {
                "val": "20.701"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Office of Naval Research's (ONR) mission is to ensure the technological advantage of U.S. Naval forces. ONR fosters scientific research necessary for the discovery, development and delivery of new technologies. Naval laboratories funded by ONR provide cutting-edge solutions and to Navy and national challenges. The In-house Laboratory Independent Research (ILIR) program provides opportunities to strengthen the Naval Science and Engineering (S&E) workforce capabilities through basic research conducted at the Naval Warfare Centers and Laboratories. These research efforts address high risk\/high payoff warfighter science and technological needs, as well as attract the next generation of researchers to consider employment within the Department of the Navy. ILIR also provides opportunities for advanced degrees, technical publications, presentations, and patents. The Science and Engineering Apprenticeship Program (SEAP) and the Naval Research Enterprise Intern Program (NREIP) summer programs encourage students to pursue science and engineering careers, further their education via mentoring by laboratory personnel, and participate in research, which can lead to employment within the Department of the Navy.\n\nToday's Sailors and Marines are enabled by naval Science and Technology (S&T). Since 1946, the Office of Naval Research (ONR) has fostered scientific research related to the maintenance of maritime superiority and national defense.  ONR manages the Department of the Navy's (DON) portfolio of naval Basic and Applied research, and Advanced Technology Development investments to ensure naval forces can effectively deter conflict, but when called upon, fight, win and come home safe. Current investments hedge against uncertainty, providing solutions to commanders today, and options for the future. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy through research priorities set by the Chief of Naval Research, coordinated across the Naval Research Enterprise (NRE), and outlined in the Naval R&D Framework.\n\nThis Program Element (PE) funds Basic Research and systematic study directed toward greater knowledge or understanding of the fundamental aspects of phenomena and of observable facts without specific applications towards processes or products in mind. The work in this PE can be classified between Technology Readiness Level (TRL) 1 (basic principles observed and reported) and TRL 2 (technology concept and\/or application formulation). \n\nDue to the number of efforts in PE 0601152N, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.237"
                },
                "CurrentYear": {
                    "val": "19.121"
                },
                "BudgetYearOne": {
                    "val": "19.113"
                },
                "BudgetYearOneBase": {
                    "val": "19.113"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.123"
                },
                "CurrentYear": {
                    "val": "19.121"
                },
                "BudgetYearOne": {
                    "val": "19.113"
                },
                "BudgetYearOneBase": {
                    "val": "19.113"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.114"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.114"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: No significant change."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "In-House Lab Independent Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "19.123"
                        },
                        "CurrentYear": {
                            "val": "19.121"
                        },
                        "BudgetYearOne": {
                            "val": "19.113"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.113"
                        },
                        "BudgetYearTwo": {
                            "val": "19.492"
                        },
                        "BudgetYearThree": {
                            "val": "19.895"
                        },
                        "BudgetYearFour": {
                            "val": "20.295"
                        },
                        "BudgetYearFive": {
                            "val": "20.701"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Office of Naval Research's (ONR) mission is to ensure the technological advantage of U.S. Naval forces. ONR fosters scientific research necessary for the discovery, development and delivery of new technologies. Naval laboratories funded by ONR provide cutting-edge solutions and to Navy and national challenges. The In-house Laboratory Independent Research program provides opportunities to strengthen the Naval Science and Engineering workforce capabilities through basic research conducted at the Naval Warfare Centers and Laboratories. These research efforts address high risk\/high payoff warfighter science and technological needs, as well as attract the next generation of researchers to consider employment within the Department of the Navy. ILIR also provides opportunities for advanced degrees, technical publications, presentations, and patents. The Science and Engineering Apprenticeship Program (SEAP) and the Naval Research Enterprise Intern Program (NREIP) summer programs encourage students to pursue science and engineering careers, further their education via mentoring by laboratory personnel, and participate in research, which can lead to employment within the Department of the Navy.\n\nThis project sustains U.S. Naval S&T superiority, provides new technological concepts for the maintenance of naval power and national security, and mitigates scientific surprises, while exploiting scientific breakthroughs and providing options for new Future Naval Capabilities. It addresses the S&T research areas of the Naval Research and Development Framework for long term Navy and Marine Corps improvements. It is in consonance with future warfighting concepts and doctrine developed at the Naval Warfare Development Command and the Marine Corps Combat Development Command and enables technologies that significantly improve the Joint Chiefs of Staff's Future Joint Warfighting Capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "In-House Laboratory Independent Research (ILIR)"
                                    },
                                    "Description": {
                                        "val": "The In-house Laboratory Independent Research program provides opportunities to strengthen the Naval Science and Engineering workforce capabilities through basic research conducted at the Naval Warfare Centers and Laboratories. These research efforts address high risk\/high payoff warfighter science and technological needs, as well as attract the next generation of researchers to consider employment within the Department of the Navy. ILIR also provides opportunities for advanced degrees, technical publications, presentations, and patents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.588"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide funding for ILIR program which enables laboratories to sponsor focused, high-risk\/potential high reward basic research to the Navy and Marine Corps on a discretionary basis. Each project is funded for at most three years with the goal being to transition successful technologies to either a higher level of research or to a program of record.  Approximately 120 projects will be funded all aligned with the Research and Development (R&D) framework focus areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.580"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.580"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Further develop and maintain the Science and Engineering workforce by providing funding to Naval Warfare Centers and Laboratories to foster high risk\/ high reward basic research initiatives of Naval interest. Each of the Naval sites will evaluate existing research projects and propose new topics. All efforts will be selected based on warfighter needs, researcher capabilities, and science and technology alignment."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Science Technology Engineering and Math (STEM) Efforts at Navy Labs"
                                    },
                                    "Description": {
                                        "val": "This effort will support both the Science and Engineering Apprenticeship Program (SEAP) and the Naval Research Enterprise Intern Program (NREIP) summer programs to encourage participating students to pursue science and engineering careers, to further their education via mentoring by laboratory personnel and their participation in research, and to make them aware of Department of the Navy (DON) research and technology efforts, which can lead to employment within the DON. Participating students will spend eight to ten weeks during the summer doing research at approximately 19 to 20 DON laboratories."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.533"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.533"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide opportunities for approximately 300 high school students and 600 college students, both undergraduate and graduates, to participate in research at multiple Department of Navy Laboratories during the summer via the NREIP for undergraduate and graduate students and the SEAP for high school students.  These paid internships last between 8-10 weeks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.533"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.533"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide opportunities for high school (SEAP) and college\/ graduate students (NREIP) to participate in Navy and Marine Corps-relevant research at Naval Warfare Centers and Laboratories. Increase the number of participating sites, mentors, and interns from previous fiscal years. Distribute summary charts of each intern's work and accomplishments to Naval sites and conduct return-on-investment analysis to improve participant impact and future retention."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        }
                    }
                }
            ]
        }
    }
}