{
    "id": "2021-Army-PB-2040-JBOOK-821e4f1a97cc5b6a86b77baeda02830249eeb59416dd3b812483bd95efbec56d-0",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA1-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601101A"
        },
        "ProgramElementTitle": {
            "val": "In-House Laboratory Independent Research"
        },
        "R1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "11.391"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is realigned with continuity of effort to the following:\n?\tPE 0601102A Defense Research Sciences"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE supports basic research at the Army laboratories through the In-House Laboratory Independent Research (ILIR) program.  Basic research lays the foundation for future developmental efforts by identifying fundamental principles governing various phenomena and appropriate pathways to exploit this knowledge.  The ILIR program serves as a catalyst for major technology breakthroughs by providing laboratory directors flexibility in implementing novel research ideas, by nurturing promising young scientists and engineers, and is used to attract and retain top doctoral degreed scientists and engineers.  The ILIR program also provides a source of competitive funds for peer reviewed efforts at Army laboratories to stimulate high quality, innovative research with significant opportunity for payoff to Army warfighting capability.  \n\nThis PE supports ILIR at the United States (U.S.) Army Futures Command's six Research, Development, and Engineering Centers (Project 91A), and at the U.S. Space and Missile Defense Command (SMDC)  (Project F16).\n\nWork in the PE provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.579"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.391"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.188"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.188"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "91A"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-AMC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.432"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned to:\nProgram Element (PE) 0601102A Defense Research Sciences\n* Project AA1 ILIR - AMC"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project funds basic research within the Army Future Command's (AFC) six Research, Development, and Engineering Centers (RDECs) and lays the foundation for future developmental efforts by identifying the fundamental principles governing various phenomena and appropriate pathways to exploit this knowledge. \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Edgewood Chemical Biological Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in chemistry, biology, biotechnology, and aerosol for countering improvised explosive devices (IEDs), obscurants, and\/or target defeat.  Work in this effort provides theoretical underpinnings for PE 0602622A (Chemical, Smoke, and Equipment Defeating Technologies)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.955"
                                            },
                                            "Text": {
                                                "val": "Conducted fundamental research in hierarchical systems through selective deposition and growth of metal-organic frameworks; synthetic biology focuses on understanding genetic drift, mutation rates, as well as the structure function relationships of proteins; and extended physical and mathematical investigations into aerosol particle charge behaviors that help develop knowledge on their behavior during deposition into the atmosphere as well as in the respiratory tract."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armaments Research, Development and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in weapons component development, explosives synthesis\/detection and area denial.  Work in this effort provides theoretical underpinnings for PE 0602307A (Advanced Weapons Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.409"
                                            },
                                            "Text": {
                                                "val": "Continued to conduct basic research that provides the underpinnings necessary for developing new explosives and propellants, smaller and more lethal warheads, lighter and stronger composite materials for guns and weapon platforms, algorithms for future intelligent munitions, and area denial technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tank-Automotive Research, Development and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in ground vehicle technologies to include power, mobility, and unmanned systems.  Work in this effort provides theoretical underpinnings for PE 0602601A (Combat Vehicle and Automotive Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.207"
                                            },
                                            "Text": {
                                                "val": "Solicited research proposals to improve understanding and accelerate technology development focused on those topics of strategic importance to the Army ground vehicle community such as; semi-, fully-, and multiple autonomous vehicle operation and control, ground vehicle cybersecurity threat detection algorithms and resilience, lightweight materials and dissimilar material joining for thick section materials, advanced energy storage materials, corrosion modeling, and early detection mechanisms, and electrophoretic displays."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Natick Soldier Research, Development, and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in food sciences, textiles, and lightweight materials with potential for individual protection. Work in this effort provides theoretical underpinnings for PE 0601102A (Defense Research Sciences), Project H52 (Equipment for the Soldier)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.102"
                                            },
                                            "Text": {
                                                "val": "Combined theoretical and experimental studies to investigate point contact antenna response to infrared\/visible laser beams and understand photon-assisted tunneling (PAT), conductance, and rectification to advance future capability of lightweight, tunable visible\/infrared Soldier borne power harvesting systems.  Explored creating liquid crystals with tunable melting points and establish an understanding of the phases, and phase transitions of liquid crystals when confined in polymer matrices to enable future development of lightweight ?smart? textiles that can efficiently respond to external stimuli."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation and Missile Research, Development and Engineering Center: Missile Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in guided missile and rocket systems, directed energy weapons, unmanned vehicles, and related components.  Work in this effort provides theoretical underpinnings for PE 0602303A (Missile Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.302"
                                            },
                                            "Text": {
                                                "val": "Investigated optimal signal detection using mutual information to improve radar performance; explored the connection between nonlinear dynamics and communication theory to engineer chaotic oscillators in wireless datalinks, radar, and acoustic sensor devices; design hybrid nano-antennas based on nested and nearly overlapping plasmonic resonant modes for enhanced sensing, detection, energy harvesting, and nanoscale light manipulation; explored effects of low pressure collision broadening and interatomic forces for atom-based inertial navigation sensors; investigated linear and nonlinear optical materials with dielectric constant near zero for accurate clocks used for Global Positioning System (GPS) and inertial navigation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation and Missile Research, Development and Engineering Center: Aviation Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds basic research for aviation enabling technologies in the areas of aerodynamics, structural dynamics, and material science.  Work in this effort provides theoretical underpinnings for PE 0602211A (Aviation Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.313"
                                            },
                                            "Text": {
                                                "val": "Conducted research on measurement techniques such as a hub-based camera system for rotor blade deformation measurements, microelectromechanical systems based sensors for unsteady airfoil pressure gradient measurements, and tomographic particle image velocimetry for volumetric flow measurements; conducted research on parallel-in-time computational fluid dynamics algorithms to realize the computation speed benefits of emerging peta-scale computer architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications-Electronics Research, Development, and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research for communication and network enabling technologies in the areas of antenna design, network management, power generation and storage, and sensors.  Work in this effort provides theoretical underpinnings for PE 0602705A (Electronics and Electronic Devices)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.143"
                                            },
                                            "Text": {
                                                "val": "Conducted research on techniques for reducing the computational complexity and burden associated with massive multiple input ? multiple output antenna arrays; researched the mathematical relationship between the electric permittivity, magnetic permeability and thickness of the metamaterial in a conformal antenna; research energy harvesting which has a net zero or net positive effect on the metabolic rate by only harvesting energy during certain stages of the gait cycle; researched deep learning algorithms and confidence-based likelihoods associated with classification decisions; innovated and created new integrable material solutions to enable smaller, lower cost phase shifters and tunable filters for use in radar, electronic warfare and communications systems; researched phase shifting diode networks to use with 2-dimensional planar phased array with integrated antennas that operate at 60GHz ~ 1 THz; and researched material parameters and device models for high fidelity simulation of III-V and II-VI optoelectronics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.001"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F16"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-SMDC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.959"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned to:\nProgram Element (PE) 0601102A Defense Research Sciences\n* Project AA2 ILIR - SMDC"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project provides In-house Laboratory Independent Research (ILIR) at the United States (US) Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT).  This basic research on lasers and directed energy lays the foundation for future developmental efforts on high energy lasers and directed energy systems by identifying the fundamental principles governing various directed energy phenomena.  \n\nWork in this Project is related to, and fully coordinated with, efforts in PE 0602307A (Advanced Weapons Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SMDC In-house Laboratory Independent Research"
                                    },
                                    "Description": {
                                        "val": "Funds basic research to investigate laser propagation phenomenology for application in modeling and simulation and future directed energy weapons design.  Activities in this effort transition to High Energy Laser Technology in PE 0602307A (Advanced Weapons Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.959"
                                            },
                                            "Text": {
                                                "val": "Completed data analysis and verification of engineering models to determine the viability of increasing the power to 10?s of watts for a diode pumped Xenon gas laser; achieved lasing of a diode pumped xenon laser at 1-2 watts output power; developed a laboratory bench top experiment of a direct-diode concept to combine 10?s of diode sources into a single laser beam at the milli-watt level to understand key laser metrics and evaluating scalability of the approach to watt class; and completed assessment of adaptive optics algorithms and hardware configurations for correcting a high energy laser beam (greater than 10kW) for propagation in the presence of deep turbulence at long ranges (>10 km)"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}