{
    "id": "2021-Army-PB-2040-JBOOK-ad016dd9ebfbe1f27853ca49333275c9694f893e3957d91046dc979378596c58-9",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604822A"
        },
        "ProgramElementTitle": {
            "val": "General Fund Enterprise Business System (GFEBS)"
        },
        "R1LineNumber": {
            "val": "145"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "35.468"
            },
            "CurrentYear": {
                "val": "42.883"
            },
            "BudgetYearOne": {
                "val": "21.201"
            },
            "BudgetYearOneBase": {
                "val": "21.201"
            },
            "BudgetYearTwo": {
                "val": "14.804"
            },
            "BudgetYearThree": {
                "val": "10.149"
            },
            "BudgetYearFour": {
                "val": "6.212"
            },
            "BudgetYearFive": {
                "val": "6.255"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "136.972"
            }
        },
        "ProgramElementNote": {
            "val": "Effective February 2, 2017, the Department of Defense Instruction (DoDI) 5000.75 was issued to establish policy for use of Business Capability Acquisition Cycle for Defense Business Systems, applying to the General Fund Enterprise Business System (GFEBS). GFEBS is currently in Phase 5, Capability Support."
        },
        "ProgramElementMissionDescription": {
            "val": "DV6 - General Fund Enterprise Business System-Sensitive Activities (GFEBS-SA): GFEBS-SA is a designated National Security System (NSS) leveraging the GFEBS base system as the Army's core financial management system certified by the Chief Financial Officers Council. To protect sensitive information and enable clean auditability, the Army requires a separate instance of GFEBS operated on a secure network for processing sensitive and classified financial transactions that cannot be processed in the fully-fielded GFEBS base system without compromising classified information or missions, or endangering soldiers. Therefore, GFEBS-SA is an essential financial program designed to enable the auditability that is needed to comply with the Chief Financial Officers (CFO) Act, the Federal Financial Management Improvement Act (FFMIA), and prevent compromise of data that could cause grave harm to U.S. forces. GFEBS-SA is envisioned as a fully functional GFEBS application operated on a secure network (SIPR), leveraging off of the sustained system design while providing additional implementation that includes additional requirements designed to protect sensitive intelligence operations and special operations missions. It will process Secret Collateral and below information while providing GFEBS capabilities such as distribution and execution of appropriated funds, cost management, financial reporting, and asset management. GFEBS-SA will be implemented and deployed to 3,000 users across 100 locations worldwide. GFEBS-SA will support information exchanges with organizations that support the Army's sensitive activities mission, including cross-security domain integration between SIPR and NIPR with GFEBS and other system partners. Services will be capable of being upgraded throughout the life of the program in order to incorporate advances in best business practices and technology, and will modify capability to maintain a synchronized software baseline with the GFEBS base system to maintain efficiencies in capability enhancements, training documentation, and sustainment support. \nIn FY 2021 the GFEBS-SA system will reach Full Deployment and the RDTE funding requested will complete system upgrades and enhancements which will re-synchronize the system baseline with the GFEBS base system to account for any capability upgrades that were made to the base system while GFEBS-SA was in development. \n\nGF5 - General Fund Enterprise Business System (GFEBS): GFEBS is the Army's core financial management system for administering its General Fund. Full Deployment was reached in 2012 and the system is currently in the Capability Support (sustainment) phase of the Business Acquisition Cycle, focused on modernization, cyber security, and system enhancements  while also conducting capability enhancements to meet policy and deliver a more accurate picture of Army financial awareness. GFEBS was implemented to fulfill the needs and enable the Army to comply with the Federal Financial Management. GFEBS was developed using a commercial off-the-shelf Enterprise Resource Planning system that is certified by the Chief, Financial Officer Council and provides six core financial functions (United States General Ledger (USGL), Cost Management, Funds Control, Payable Management, Real Property, Receivable Management and Reports). \nGFEBS required RDTE funding for FY 2021 is to provide capability enhancements designed to meet Yellow Book audit readiness standards, and continue to make system changes as prioritized by the functional sponsor and user community through the Process Owners Group, a Senior Executive Service\/General Officer-level board. The RDTE funding will support the additional focus on completing system enhancements which enable an audit-ready Army, ensure a modern and sustainable system, and enable the retirement of legacy systems freeing up funding for investment into the modern ERP; as well as modernization efforts aligned with the Original Equipment Manufacturer's (SAP) next generation capability."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "36.81"
                },
                "CurrentYear": {
                    "val": "46.683"
                },
                "BudgetYearOne": {
                    "val": "28.725"
                },
                "BudgetYearOneBase": {
                    "val": "28.725"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "35.468"
                },
                "CurrentYear": {
                    "val": "42.883"
                },
                "BudgetYearOne": {
                    "val": "21.201"
                },
                "BudgetYearOneBase": {
                    "val": "21.201"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.342"
                },
                "CurrentYear": {
                    "val": "-3.8"
                },
                "BudgetYearOne": {
                    "val": "-7.524"
                },
                "BudgetYearOneBase": {
                    "val": "-7.524"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-3.8"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.342"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-7.524"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.524"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "For FY 2021, the overall change is a result of changes to each of the child funding lines within the GFEBS Program Element.\n\nGFEBS-SA (DV6) decreased in FY 2021 in the new President's Budget based on the accelerated timeline set forth by the Vice Chief of Staff of the Army. The schedule acceleration moves Full Deployment forward from its original FY 2021 scheduled date which decreases the RDTE request in FY 2021; leaving only the amount needed to provide enhancements which re-synchronize the system's baseline.\n\nGFEBS (GF5) increased in FY 2021 in the new President's Budget based on the additional focus on completing the audit-related system enhancements which will give the Army an auditable financial system. The GFEBS Process Owners Group and Functional Governance Board have developed a list of enhancement items and have put the highest priority on those items which enable an audit-ready Army, ensure a modern and sustainable system, and enable the retirement of legacy systems freeing up funding for investment into the modern ERPs. Specifically, the additional enhancements will improve the Army's fund balance with Treasury reducing service provider personnel needed to support reconciliation activities.  This allows the Army to focus resources on mission critical activities. The increased funding also supports modernization efforts aligned with the Original Equipment Manufacturer (SAP) next generation capability. The modernization activities include code de-customization, data enablement, and improved automated data access to prevent end of support for the current database and platform.  Funds will also support acquisition trades and market research on alternatives for SAP based finance\/logistics consolidation to evaluate potential efficiencies by reducing platforms and licenses.  \n\nA congressional mark of $3.8 million was placed on FY2020 RDTE in the GFEBS (GF5) line due to GFEBS prior year carryover."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DV6"
                    },
                    "ProjectTitle": {
                        "val": "General Fund Enterprise Business System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "33.965"
                        },
                        "CurrentYear": {
                            "val": "35.782"
                        },
                        "BudgetYearOne": {
                            "val": "5.099"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.099"
                        },
                        "BudgetYearTwo": {
                            "val": "2.072"
                        },
                        "BudgetYearThree": {
                            "val": "2.113"
                        },
                        "BudgetYearFour": {
                            "val": "2.155"
                        },
                        "BudgetYearFive": {
                            "val": "2.198"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "83.384"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project DV6 is for General Fund Enterprise Business System - Sensitive Activities (GFEBS-SA)."
                        },
                        "ProjectMissionDescription": {
                            "val": "DV6 - General Fund Enterprise Business System-Sensitive Activities (GFEBS-SA): GFEBS-SA is a designated National Security System (NSS) leveraging the GFEBS base system as the Army's core financial management system certified by the Chief Financial Officers Council. To protect sensitive information and enable clean auditability, the Army requires a separate instance of GFEBS operated on a secure network for processing sensitive and classified financial transactions that cannot be processed in the fully-fielded GFEBS base system without compromising classified information or missions, or endangering soldiers. Therefore, GFEBS-SA is an essential financial program designed to enable the auditability that is needed to comply with the Chief Financial Officers (CFO) Act, the Federal Financial Management Improvement Act (FFMIA), and prevent compromise of data that could cause grave harm to U.S. forces. GFEBS-SA is envisioned as a fully functional GFEBS application operated on a secure network (SIPR), leveraging off of the sustained system design while providing additional implementation that includes additional requirements designed to protect sensitive intelligence operations and special operations missions. It will process Secret Collateral and below information while providing GFEBS capabilities such as distribution and execution of appropriated funds, cost management, financial reporting, and asset management. GFEBS-SA will be implemented and deployed to 3,000 users across 100 locations worldwide. GFEBS-SA will support information exchanges with organizations that support the Army's sensitive activities mission, including cross-security domain integration between SIPR and NIPR with GFEBS and other system partners. Services will be capable of being upgraded throughout the life of the program in order to incorporate advances in best business practices and technology, and will modify capability to maintain a synchronized software baseline with the GFEBS base system to maintain efficiencies in capability enhancements, training documentation, and sustainment support. \n\nIn FY 2021 the GFEBS-SA system will reach Full Deployment and the RDTE funding requested will complete system upgrades and enhancements which will re-synchronize the system baseline with the GFEBS base system to account for any capability upgrades that were made to the base system while GFEBS-SA was in development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Software Development"
                                    },
                                    "Description": {
                                        "val": "Software development includes all RDTE activities related to the development of the GFEBS-SA system itself. This includes the systems engineering management, planning, and blueprinting as well as the system integrator putting hands on keyboards to integrate the GFEBS solution into the Secret (SIPR) environment to include developing the required interfaces to allow GFEBS-SA to interact with partner systems; and the hardware and software tools necessary to facilitate development. After Full Deployment occurs in FY 2021, RDTE funding is required to allow the GFEBS-SA system capability to remain synchronized with the base GFEBS system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.741"
                                            },
                                            "Text": {
                                                "val": "FY 2019 funding provided support to continue the software development of the GFEBS-SA product; development of interfaces with partners involved in auditability of classified financial information; system engineering, planning, and analysis; establishment and hosting costs in the Cloud environment; cybersecurity support; and pre-deployment planning activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.531"
                                            },
                                            "Text": {
                                                "val": "During FY 2020, the program will enter the final stages of testing and deployment of the system.  The RDT&E funding will include costs for the final delivery of the GFEBS-SA solution, the systems engineering management to finalize and deliver updated system documentation following developmental\/operational testing, and the completion of all cybersecurity processes in order to receive Authority to Operate. Note that since the FY20 submission the integration testing with major data systems was delayed for 45 days due to a waiver requirements for non-Treasury Disbursing Office compliance in accordance with OUSD(C) policy. This has pushed the Full Deployment date back into 1QFY2021; however, all previously planned FY 2020 development\/operational testing and deployment activities are still planned to occur."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.099"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.099"
                                            },
                                            "Text": {
                                                "val": "In FY 2021 the GFEBS-SA system will reach Full Deployment and the RDTE funding requested will complete system upgrades and enhancements which will re-synchronize the system baseline with the GFEBS base system to account for any capability upgrades and platform modernization that were made to the base system while GFEBS-SA was in deployment. This synchronization allows GFEBS to remain on-track in meeting Congressionally-mandated auditability requirements. Additionally, funds support efforts to integrate sensitive activity capability across the Enterprise."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in funding from FY 2020 to FY 2021 is due to the system reaching Full Deployment in 1QFY2021 resulting in the completion of design, development, and testing. The remaining RDTE funds are used to complete system upgrades and enhancements which will re-synchronize the system baseline with the GFEBS base system to account for any capability upgrades or functional updates that were made to the base system while GFEBS-SA was in development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Testing"
                                    },
                                    "Description": {
                                        "val": "Testing includes all efforts related to test planning, Developmental Testing (DT), User Acceptance Testing (UAT), Operational Test & Evaluation (OT&E), and the system integrator labor and site services aligned with each."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.96"
                                            },
                                            "Text": {
                                                "val": "FY 2019 testing support included test planning activities for the Developmental Test and User Acceptance Test, as well as funding for external services such as the Joint Interoperability Test Command (JITC)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.982"
                                            },
                                            "Text": {
                                                "val": "During FY 2020, User Acceptance Testing and Developmental Testing will occur prior to and post IOC. These costs support the Government Test requirements with the Joint Interoperability Test Command (JITC) and the Army Test and Evaluation Command (ATEC) as well as ensuring the System Integrators and Command Test Operators are available to support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "All testing events will have been scheduled and funded by the end of FY 2020, therefore there is no testing funding necessary in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Support"
                                    },
                                    "Description": {
                                        "val": "Program Support includes program management and training activities. Costs include government management and travel, facilities, and development of recurring training materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.664"
                                            },
                                            "Text": {
                                                "val": "FY 2019 Program Support included all activities within the program office. Costs included government management; government technical support; facilities; system engineering and program management tools associated with program execution (i.e., logistics software, program management database and tracking tools, office software, etc.); and support contractors who provide technical expertise, day-to-day program execution, and acquisition support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.309"
                                            },
                                            "Text": {
                                                "val": "Program support costs in FY 2020 includes Program Management Office personnel providing non-technical support (acquisition, operations, financial, logistics, etc.), organizational change management planning and execution of site visits to communicate the Army auditability objectives mission and purpose to partner commands, and the development of recurring training tools."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The GFEBS-SA system will be fully deployed in FY 2021, therefore program support funding will be requested to be paid with OMA immediately upon reaching the Capability Support Authorization to Proceed (ATP) in accordance with DoDI 5000.75."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Center Hosting"
                                    },
                                    "Description": {
                                        "val": "Data center hosting includes all costs associated with hosting of each environment in the Cloud; which include pre-development, staging, production, continuity of operations (COOP), Quality Assurance, and program management tools. Other resources included in these costs are HANA, the cross-domain investment, and the SIPR circuit Attribute Based Access Control (ABAC) data hosting."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.6"
                                            },
                                            "Text": {
                                                "val": "GFEBS-SA set up initial environments with a Cloud service provider. The funding then provided the recurring infrastructure and managed services costs needed to support the established environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.336"
                                            },
                                            "Text": {
                                                "val": "By the end of FY 2020, GFEBS-SA will be fully operational on each hosting environment in preparation for system deployment to all sites."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The GFEBS-SA system will be fully deployed in FY 2021, therefore data center hosting funding will be requested to be paid with OMA immediately upon reaching the Capability Support Authorization to Proceed (ATP) in accordance with DoDI 5000.75."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.624"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B55511"
                                    },
                                    "Title": {
                                        "val": "GFEBS SENSITIVE ACTIVITIES"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.424"
                                        },
                                        "CurrentYear": {
                                            "val": "11.248"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "17.672"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "GFEBS-SA will be fully deployed in FY 2021; therefore, there are no procurement dollars budgeted in the GFEBS-SA line for FY 2021 and beyond. GFEBS base program procurement dollars will be used to prevent end of service life by the Original Equipment Manufacturer, SAP, and enable a migration of the GFEBS-SA database from Oracle to SAP as part of the synchronization between GFEBS and GFEBS-SA in FY2021.  Additionally, procurement funds will be leveraged to support deployments in conjunction with GFEBS-SA Full Deployment schedule to sites not currently running the GFEBS base system.\n\nGFEBS-SA OMA requirements begin in FY 2021, which is the scheduled Full Deployment date. These requirements will be incorporated into the GFEBS base system Future Years Defense Program (FYDP) request."
                        },
                        "AcquisitionStrategy": {
                            "val": "Plan, develop, and manage GFEBS-SA as a separate instance from GFEBS base program on the SIPRNet to support delivery of capabilities for this designated National Security System (NSS) in support of the sensitive activity commands. The GFEBS-SA solution was acquired as a sole source contract with Accenture Federal Services as a single increment. The contract is a hybrid of Firm Fixed Price and Cost Plus Fixed Fee CLINs to support development efforts and to encourage Accenture Federal Services to deliver a solution in support of the Vice Chief of Staff of the Army recommendation to accelerate the schedule to ensure operational security and Army audit requirements. The contract was awarded in April 2017.\n\nSoftware is being developed through a single build to achieve full capability. GFEBS-SA will consist of a single software release delivered in a limited deployment to the Initial Operational Test and Evaluation (IOT&E) unit, followed by a full deployment to all other users upon successful completion of IOT&E.\n\nThe program will require modernization enhancements after full deployment. These modernization enhancements will require a stream of RDT&E funding to keep the GFEBS-SA system synchronized with the base system by making modifications needed for audit readiness, compliance, and upgrades required to keep the system up-to-date with SAP standards and Functional Governance Board requirements."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.624"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.624"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "The current contract is a hybrid of FFP, CPFF, and CR CLINs for system development, landscape configuration, test and evaluation, solution delivery, and certification\/accreditation. \n\nCost to Complete assumes a service life through FY 2030. Some of this support will take place on a follow-on contract."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Accenture Federal LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "35.938"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "17.741"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "17.531"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.099"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.099"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "20.227"
                                                    },
                                                    "TotalCost": {
                                                        "val": "96.536"
                                                    },
                                                    "TargetValue": {
                                                        "val": "88.300"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data Center Hosting"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Defense Information Systems Agency"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.487"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.6"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.336"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "25.423"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PdM GFEBS SA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "20.044"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.664"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.309"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "30.017"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC\/ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.15"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.96"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.982"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.092"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_DV6_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Program Management"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Data Center Hosting"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Software Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone B (ATP 3)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Operating Capability (IOC)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment (FD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "License Procurement"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Deployment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Re-synchronization w\/ GFEBS Baseline"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Modernization Enhancements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Support (Sustainment)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "GF5"
                    },
                    "ProjectTitle": {
                        "val": "General Fund Enterprise Business System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.503"
                        },
                        "CurrentYear": {
                            "val": "7.101"
                        },
                        "BudgetYearOne": {
                            "val": "16.102"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.102"
                        },
                        "BudgetYearTwo": {
                            "val": "12.732"
                        },
                        "BudgetYearThree": {
                            "val": "8.036"
                        },
                        "BudgetYearFour": {
                            "val": "4.057"
                        },
                        "BudgetYearFive": {
                            "val": "4.057"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "53.588"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "GF5 - General Fund Enterprise Business System (GFEBS): GFEBS is the Army's core financial management system for administering its General Fund. Full Deployment was reached in 2012 and the system is currently in the Capability Support (sustainment) phase of the Business Acquisition Cycle, focused on modernization, cyber security, and system enhancements  while also conducting capability enhancements to meet policy and deliver a more accurate picture of Army financial awareness. GFEBS was implemented to fulfill the needs and enable the Army to comply with the Federal Financial Management. GFEBS was developed using a commercial off-the-shelf Enterprise Resource Planning system that is certified by the Chief, Financial Officer Council and provides six core financial functions (United States General Ledger (USGL), Cost Management, Funds Control, Payable Management, Real Property, Receivable Management and Reports). \n\nGFEBS RDTE funding in FY 2021 will support the additional focus on completing the audit-related system enhancements which will give the Army an auditable financial system designed to meet Yellow Book audit readiness standards as outlined by the United States Government Accountability Office, as well as support the continuation of system changes as prioritized by the functional sponsor and user community through the Process Owners Group, a Senior Executive Service\/General Officer-level board. The GFEBS Process Owners Group and Functional Governance Board have developed a list of enhancement items and have put the highest priority on those items which enable an audit-ready Army, ensure a modern and sustainable system, and enable the retirement of legacy systems freeing up funding for investment into the modern ERPs. Specifically, the additional enhancements will improve the Army's fund balance with Treasury reducing service provider personnel needed to support reconciliation activities. This allows the Army to focus resources on mission critical activities. The funding also supports modernization efforts aligned with the Original Equipment Manufacturer's (SAP) next generation capability. The modernization activities include code de-customization, data enablement, and improved automated data access to prevent end of support for the current database and platform. Funds will also support acquisition trades and market research on alternatives for SAP based finance\/logistics consolidation to evaluate potential efficiencies by reducing platforms and licenses."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Capability Enhancement"
                                    },
                                    "Description": {
                                        "val": "Capability enhancements provide changes to the system that are needed to update the infrastructure as required to meet SAP requirements and best practices, and to support evolving statutory and regulatory requirements. The capability enhancement initiatives are needed to increase the GFEBS capability and performance to maintain compliance with Federal Financial Management Improvement Act (FFMIA), Business Enterprise Agency (BEA), Standard Financial Information Structure (SFIS) requirements, and Yellow Book auditability. These requirements are established and prioritized through a General Officer (GO)\/Senior Executive Service (SES)-level Process Owners Group and Functional Governance Board."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.503"
                                            },
                                            "Text": {
                                                "val": "FY 2019 RDTE provided funding to continue the development of critical capability enhancements requested by the Financial Integration Process Owners Group. These enhancements support the audit, compliance, and legacy system retirement efforts of the GFEBS system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.779"
                                            },
                                            "Text": {
                                                "val": "FY 2020 RDT&E funding will be used to perform system enhancements\/upgrades as requested by the Process Owners Group and Functional Governance Board. With increased focus on making the Army auditable, many of these upgrades are aligned with the auditability of GFEBS and have been highly prioritized. The focus for enhancements funded with RDT&E during FY 2020 will be on these audit-related enhancements. Note that the program received a $3.8 million congressional mark which reduces the ability to complete all but two of the previously planned system enhancements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.102"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.102"
                                            },
                                            "Text": {
                                                "val": "The RDTE funds requested in FY 2021 support the additional focus on completing the audit-related system enhancements which will give the Army an auditable financial system designed to meet Yellow Book audit readiness standards as outlined by the United States Government Accountability Office, as well as support the continuation of system changes as prioritized by the functional sponsor and user community through the Process Owners Group, a Senior Executive Service\/General Officer-level board. The GFEBS Process Owners Group and Functional Governance Board have developed a list of enhancement items and have put the highest priority on those items which enable an audit-ready Army, ensure a modern and sustainable system, and enable the retirement of legacy systems freeing up funding for investment into the modern ERPs. Specifically, the additional enhancements will improve the Army's fund balance with Treasury reducing service provider personnel needed to support reconciliation activities. This allows the Army to focus resources on mission critical activities. The funding also supports modernization efforts aligned with the Original Equipment Manufacturer's (SAP) next generation capability. The modernization activities include code de-customization, data enablement, and improved automated data access to prevent end of support for the current database and platform. Funds will also support acquisition trades and market research on alternatives for SAP based finance\/logistics consolidation to evaluate potential efficiencies by reducing platforms and licenses."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "RDTE funding has increased from FY 2020 to FY 2021 based on the additional focus of completing the audit-related system enhancements which will give the Army an auditable financial system designed to meet Yellow Book audit readiness standards as outlined by the United States Government Accountability Office. The GFEBS Process Owners Group and Functional Governance Board have developed a list of enhancement items and have put the highest priority on those items which enable an audit-ready Army, ensure a modern and sustainable system, and enable the retirement of legacy systems freeing up funding for investment into the modern ERPs. Specifically, the additional enhancements will improve the Army's fund balance with Treasury reducing service provider personnel needed to support reconciliation activities. This allows the Army to focus resources on mission critical activities. The increased funding also supports modernization efforts aligned with the Original Equipment Manufacturer's (SAP) next generation capability. The modernization activities include code de-customization, data enablement, and improved automated data access to prevent end of support for the current database and platform. Funds will also support acquisition trades and market research on alternatives for SAP based finance\/logistics consolidation to evaluate potential efficiencies by reducing platforms and licenses."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.322"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BE4168"
                                    },
                                    "Title": {
                                        "val": "General Fund Enterprise Business System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.552"
                                        },
                                        "CurrentYear": {
                                            "val": "3.754"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.448"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.448"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.566"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "17.320"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OMA - ERPE-ERPA \/ 438001000 \/ 5T0"
                                    },
                                    "Title": {
                                        "val": "GFEBS OMA"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "99.176"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "99.176"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "OPA - FY 2021 Procurement dollars in the amount of $4.448 million supports software and hardware infrastructure upgrades to bring GFEBS reporting and analytics in-line with processing performance thresholds established in the GFEBS Capabilities Production Document (CPD). Software upgrades support auditability requirements as well as the compliance of the system's required software standards. GFEBS base program procurement dollars will be used to prevent end of service life by the Original Equipment Manufacturer, SAP, and enable a migration of the GFEBS-SA database from Oracle to SAP as part of the synchronization between GFEBS and GFEBS-SA in FY 2021.  Additionally, procurement funds will be leveraged to support deployments in conjunction with GFEBS-SA Full Deployment schedule to sites not currently running the GFEBS base system.\n\nOMA - [P&R Form System does not show amounts for FY 2020 through FY 2025] FY 2021 and beyond OMA dollars include funding for both GFEBS and GFEBS-SA programs. OMA-funded support includes data center hosting, software\/hardware maintenance, capability support, and capability enhancements."
                        },
                        "AcquisitionStrategy": {
                            "val": "GFEBS is currently in the Capability Support (sustainment) phase as specified in DoDI 5000.75. On 15 January 2018, the responsibility for system support of the GFEBS system transitioned from the original developer contract to a contract created to focus more on sustainment support and cost control. The current sustainment contract provides specific contracting methodologies to track all capability support functions as well as all the system enhancement requirements as set forth by the user community through the Process Owners Group; a Senior Executive Service\/General Officer-level board that prioritizes user needs. Many of these enhancements require RDT&E funding as determined through a set of established business rules.\n\nThe next step on the program's contracting strategy includes a transition of all Capability Support functions to the Army Shared Services Center, and the transition of all prioritized system enhancements to a Portfolio follow-on contract supporting enhancements for the GFEBS and GFEBS-SA systems which allows the programs to realize efficiencies through a \"build once, deploy twice\" development strategy."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.322"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.322"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Total value of contract includes capability support (OMA) and enhancement services through January 15, 2023."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "IBM Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bathesda, Maryland"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "130.569"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.503"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.779"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "16.102"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "16.102"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "185.769"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_GF5_0.png"
                                }
                            }
                        ],
                        "ScheduleProfileNote": {
                            "val": "System enhancements include prioritized capabilities based on functional needs in areas such as Audit Enablement and Compliance, Legacy System Divestiture, Cash Accountability, Improved Funds Balance with Treasury, Cost of Army Operations, and Financial Reporting and Analytics."
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Map\/Blueprint\/Build Release 1.1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2005"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2006"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MS B1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Realization -  Release 1.2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2006"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Release 1.3 - Replace STANFINS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment Decision Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Release 1.4:  Replace SOMARDS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment Decision Review 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Hardware Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Sustainment Contract w\/ Capability Enhancement Task Order (Current)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Army Shared Services Sustainment w\/ Capability Enhancement Option (Follow-on)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Enhancements FY18"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "System Enhancements FY19"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "System Enhancements FY20"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "System Enhancements & SAP Modernization FY21"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "System Enhancements & SAP Modernization FY22"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "System Enhancements & SAP Modernization FY23"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "System Enhancements & SAP Modernization FY24"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "System Enhancements & SAP Modernization FY25"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}