{
    "id": "2021-Navy-PB-1319-JBOOK-29075b3c2af92ab5fcca1096cf65ecac9cc771240d227e79d45bc59626cdea42-12",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602750N"
        },
        "ProgramElementTitle": {
            "val": "Future Naval Capabilities Applied Research"
        },
        "R1LineNumber": {
            "val": "13"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "135.523"
            },
            "CurrentYear": {
                "val": "152.012"
            },
            "BudgetYearOne": {
                "val": "167.590"
            },
            "BudgetYearOneBase": {
                "val": "167.590"
            },
            "BudgetYearTwo": {
                "val": "180.900"
            },
            "BudgetYearThree": {
                "val": "184.622"
            },
            "BudgetYearFour": {
                "val": "188.333"
            },
            "BudgetYearFive": {
                "val": "192.100"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Office of Naval Research (ONR) works closely across the Department of the Navy (DON) and Naval Research Enterprise (NRE) to develop high priority technological capabilities needed by the operational forces. From their beginnings, the U.S. Navy and Marine Corps have leveraged technology innovation to gain decisive advantage. However, breakthroughs don't happen overnight. Critical to sustaining the pipeline of new capabilities, is maintaining a priority-driven portfolio of naval science and technology (S&T) to deliver solutions to known requirements, and experiment with potential game-changing ideas. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy. Specifically, this PE develops component technologies in the Future Naval Capabilities (FNC) Program primarily to address cost, schedule and performance challenges in acquisition programs, accelerating delivery. The term Technology Candidate refers to component applied research efforts, which contingent on success, will continue development as FNCs in PE 0603673N Advanced Technology Development. Efforts in this PE are coordinated with related work in the USMC Technology Candidates Activity of PE 0602131M Marine Corp Landing Force Technology.\n\nThis Program Element (PE) funds Applied Research, which is the systematic study to understand the means to meet a recognized and specific need. Most of the work in this PE can be classified between Technology Readiness Level (TRL) 2 (technology concept and\/or application formulation) and TRL 4 (component and\/or breadboard validation in laboratory environments).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "137.701"
                },
                "CurrentYear": {
                    "val": "154.755"
                },
                "BudgetYearOne": {
                    "val": "167.590"
                },
                "BudgetYearOneBase": {
                    "val": "167.590"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "135.523"
                },
                "CurrentYear": {
                    "val": "152.012"
                },
                "BudgetYearOne": {
                    "val": "167.590"
                },
                "BudgetYearOneBase": {
                    "val": "167.590"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.178"
                },
                "CurrentYear": {
                    "val": "-2.743"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-6.743"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "4.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.178"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: No significant change.\n\nTechnical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Future Naval Capabilities Applied Research"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "135.523"
                        },
                        "CurrentYear": {
                            "val": "148.012"
                        },
                        "BudgetYearOne": {
                            "val": "167.590"
                        },
                        "BudgetYearOneBase": {
                            "val": "167.590"
                        },
                        "BudgetYearTwo": {
                            "val": "180.900"
                        },
                        "BudgetYearThree": {
                            "val": "184.622"
                        },
                        "BudgetYearFour": {
                            "val": "188.333"
                        },
                        "BudgetYearFive": {
                            "val": "192.100"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Future Naval Capabilities (FNC) budget activity (BA) 2 investments develop candidate FNC technologies in an agile fashion by exploiting technology advances that respond rapidly to Naval needs. This approach facilitates an optimum response when developing and maturing the technology options that can be developed further in Program Element (PE) 0603673N, Future Naval Capabilities Advanced Technology Development.\n\nThe FNC Program favors a high level of collaboration.  PE R-2 activities are mostly organized by the Office of Naval Research (ONR) Science and Technology Departments, which are tasked to collaborate with the acquisition stakeholders and their resource sponsors. A complete accounting of the technology candidates being developed and a full disposition of each technology development effort funded in this PE is provided annually to the Congressional oversight committees."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Maneuver Warfare (EMW) and Combating Terrorism"
                                    },
                                    "Description": {
                                        "val": "The objective of this activity is to develop and mature technologies in asymmetric and irregular warfare, distributed operations, information warfare, survivability and self-defense to a point where they can be proposed and continued as FNCs in PE 0603673N, Future Naval Capabilities Advanced Technology Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.639"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.723"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Future Naval Capabilities (FNC) Technology Candidate development in FY 2020 will continue to focus on the technologies noted in the FY 2019 plans. Investments include technologies that: improve warfighter effectiveness in command, control, computers and communication for small unit naval expeditionary warfighters; enhance fires capabilities so warfighters employed in small, distributed units will have the tools they need to locate and decisively destroy larger enemy forces; improve force protection for small units and individual warfighters against a myriad of enemy attack modes; improve human performance by developing new training technologies, knowledge products, architectures, and systems that can accelerate mental, emotional and cognitive decision-making skill; mature emerging technologies for future intelligence, surveillance and reconnaissance systems; develop and mature new maintenance technologies for expeditionary combat systems; develop new expeditionary energy technologies that support distributed operations from the individual Marine to small units; develop novel technologies and innovative concepts that will improve the maneuverability of the Marine Corps Air Ground Task Force by enhancing the movement of troops and equipment from shipboard to inland objectives; and mature new technologies that will improve the standoff detection and neutralization of improvised explosive devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.613"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.613"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Extend focus on the technologies that will enhance long-range fires capabilities so warfighters employed in small distributed units will have the tools they need to locate and decisively destroy larger enemy forces  \n- Progress and expand in the area of providing new training technologies, knowledge products, architectures, and systems that can accelerate mental, emotional and cognitive decision-making skill, to include human-machine teaming and greater naval capability to detect, localize and neutralize mines and improvised explosive devices that challenge the naval forces ability to operate in contested maritime environments \n- Establish novel technologies and innovative concepts that will improve the maneuverability of the Marine Corps Air Ground Task Force by enhancing the movement of troops and equipment from shipboard to inland objective\n\nEmerging technologies for future intelligence, surveillance and reconnaissance systems will transition to the Future Naval Capabilities program. \n\nEfforts to enhance expeditionary forces use of artificial intelligence, autonomy, and material development in areas of naval logistics will be initiated. This includes developing technologies to improve warfighter effectiveness in command, control, computers and communication for small unit naval expeditionary warfighters"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 to FY 2021 increase is due to increased investment in the areas of expeditionary logistics, training to improve human performance and decision making, and mine countermeasures."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C4ISR and Special Projects"
                                    },
                                    "Description": {
                                        "val": "The objective of this activity is to develop and mature technologies in data science, mathematical optimization, computational and information sciences, quantum information sciences, electronics, command and control, combat systems, communications, cyber security, cyber operations, electronic warfare, sensing and surveillance, and precision timing and navigation, as well as technologies for surface and airborne vehicles, and cruise missile defense weapons to a point where they can be proposed and continued as Future Naval Capabilities (FNC) in program element (PE) 0603673N, Future Naval Capabilities Advanced Technology Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "64.908"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "55.720"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Future Naval Capabilities (FNC) Technology Candidate development in FY 2020 will continue to focus on technologies noted in the FY 2019 plans. \n\nInvestments include technologies that: advance techniques and algorithms for information processing and integration, information operations, information assurance, cyber protection, communications and networking, computational decision-making, accurate decision making, and command and control technologies with a specific focus on enabling rapid; exploit advancements in electronics, sensors and network technologies enabling new and innovative uses of the electromagnetic spectrum in areas of surface and aerospace surveillance, communications, electronic combat, and precision time and navigation; improve adaptive persistent surveillance capabilities; develop new digital radio frequency technologies supporting active aperture, phased arrays capable of performing multiple functions simultaneously; improve soft-kill performance and real-time assessment, as well as provide multiple means to detect and measure incoming threats. \n\nFY20 investments focuses on the following areas: communications and networking; decision tools; cyber; sensor deception and defeat; advanced sensing, counter ISR and processing; cross platform technologies; and advanced systems and components. The objectives of communications and networking include maturing promising communications and networking technologies and enable rapid transition to the fleet. The objectives of sensor deception and defeat include maturing the underlying technologies, techniques and algorithms that degrade, neutralize, or destroy an adversary's combat capability. The objectives of decision tools include dedicating applied research to develop decision tools to allow Commanders to rapidly and confidently move from data-to-options-to-informed decisions. The objectives of cyber include maturing innovative cyber approaches to enhance resilience, safety, reliability, and efficiency of cyber systems in warfighting platforms. The objectives of advanced sensing and processing thrust is to maturing sensing system and processing technologies to deliver enhanced operational capabilities for Intelligence, Surveillance, Reconnaissance and Targeting applications. The objectives of cross platform technologies include maturing electro-magnetic enabling technologies that rely on geographic separation of platform sensors to deliver enhanced operational capabilities. The objectives of advanced systems and components include maturing the underlying components and systems for improved electro optical (EO), radio frequency (RF) and Precision, Navigation, and Timing (PNT) systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "56.429"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "56.429"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Future Naval Capabilities (FNC) Technology Candidate development in FY 2021 will continue to focus on the following thrust areas:  Communications and Networking; Decision Tools; Cyber; Sensor Deception and Defeat; Advanced Sensing and Processing; Cross Platform Technologies, and Advanced Systems and Components.  \n\nThe objectives of Communications and Networking include maturing promising communications and networking technologies to enable distributed maritime operations. The objectives of Sensor Deception and Defeat include maturing the underlying technologies, techniques and algorithms that degrade, neutralize, or destroy an adversary's C4ISR capability. The objectives of Decision Tools include dedicating applied research to develop decision tools to allow Commanders to rapidly and confidently move from data-to-options-to-informed decisions. The objectives of Cyber include maturing innovative cyber approaches to enhance the resilience, safety, reliability, and efficiency of cyber systems in warfighting platforms. The objectives of Advanced Sensing and Processing include maturing sensing system and processing technologies to deliver enhanced operational capabilities for Intelligence, Surveillance, Reconnaissance and Targeting applications. The objectives of Cross Platform Technologies include maturing electro-magnetic enabling technologies that rely on geographic separation of platform sensors to deliver enhanced operational capabilities. The objectives of Advanced Systems and Components include maturing the underlying components and systems for improved Electro Optical (EO), Radio Frequency (RF) and Precision, Navigation, and Timing (PNT) systems.\n\nExtend efforts in developing: \n- Government Off the Shelf (GOTS) software router and apps to meet Fleet resilient networking objectives in contested warfighting scenarios.\n- A low-cost, high-fidelity network deception framework (CyberMoat) that lies to attackers on-demand and automated tools to coerce malware agents to deceive adversary Command and Control.\n- An operating system that enables automatic and efficient use of heterogeneous computing architectures for cyber resilience without requiring change to legacy source code.\n- Key technologies for off-board RF illumination sources to enable Multi-Input Multi-Output and receive-only sensing in a distributed environment.\n- Ultra-efficient neural network hardware.\n\nInitiate the development of new Technology Candidates selected to start in FY 2021 in the areas of Communications and Networking, Sensor Deception and Defeat, Decision Tools, Cyber, Advanced Sensing and Processing, Cross Platform Technologies, and Advanced Systems and Components."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY20 to FY21 increase is due to initiation of new Technology Candidates selected to start in FY 2021 in the areas of Communications and Networking, Sensor Deception and Defeat, Decision Tools, Cyber, Advanced Sensing and Processing, Cross Platform Technologies, and Advanced Systems and Components."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ocean Battlespace Sensing"
                                    },
                                    "Description": {
                                        "val": "The objective of this activity is to enable maritime domain access and distributed operations for Naval forces in contested ocean environments through superior maritime battlespace awareness and undersea threat detection, identification and neutralization. Specifically, activities will develop and mature technologies that ultimately support undersea warfare, subsurface\/seabed warfare, antisubmarine warfare, and mine warfare including mine countermeasures and naval mining. Activities will also develop and mature methods and technological approaches for environmental sensing and prediction for the maritime battlespace. The desired outcome for efforts in this activity is to mature the applied research results to a point where they can be focused on particular enabling capabilities and proposed to be continued as Future Naval Capabilities (FNC) in program element (PE) 0603673N, Future Naval Capabilities Advanced Technology Development. Additionally, a subset of technologies explored herein are intended to support expeditionary access and will be further matured, focused, and ultimate demonstrated under the USMC's Advanced Technology Demonstration effort in PE 0603640M MC Advanced Technology Demo."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.399"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.476"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Future Naval Capabilities (FNC) Technology Candidate development in FY 2020 will continue technologies noted previously in the FY 2019 plans with a primary focus on improving the ability to exploit environmental sensing, modeling and prediction to enable more effective anti-submarine warfare (ASW) and mine warfare (MIW) applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.299"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.299"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts in technologies for precise localization and neutralization of fully buried mines; understanding how to achieve noise reduction for expeditionary Surveillance Towed Array Sensor System (SURTASS) including sensing approaches and noise rejection algorithm development.\n\n- Conclude efforts in understanding how to potentially miniaturize and marinize existing fuel cells for use in a large- diameter unmanned underwater vehicle; algorithm development for theater-level Anti-Submarine Warfare (ASW) battle management; integrated minefield planning where specific efforts include evaluation of prototype algorithms for staff-level planning of mixed minefields, multiple minefields, and alternative delivery techniques; and studying air-sea process impacts for in-air Electromagnetic (EM) propagation.\n\n- Initiate efforts in high temperature superconducting approaches to minesweeping; innovative naval mine delivery methods; advanced acoustic sources for floating and mobile ASW sensing systems as well as expeditionary SURTASS; and storm surge and inundation forecasting models."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sea Warfare and Weapons"
                                    },
                                    "Description": {
                                        "val": "The objective of this activity is to develop and mature technologies that enable superior warfighting capabilities for surface and sub-surface naval platforms and undersea weaponry to a point where they can be proposed and continued as Future Naval Capabilities in program element (PE) 0603673N, Future Naval Capabilities Advanced Technology Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.738"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.921"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The focus in FY 2020 will be on maturing technologies for future FNCs (Future Naval Capabilities) involving off-board refueling and data transfer, autonomous situational awareness, hazard avoidance, and high temperature superconducting magnetic influence sweep payloads for unmanned surface vehicles; advanced batteries to increase torpedo range and endurance; robust power control for integrated surface ship power and combat systems; precision lift in austere at-sea environments for surface ship replenishment and weapons reload; digital tools to automate operation and control of unmanned platforms integrated with manned platforms in mission environments; and in situ repair of shipboard copper-nickel heat exchanger tubing.  Additionally, applied research will begin on emerging technologies in the areas of autonomy, digital analytics for platforms and logistics, platform maintenance and sustainability, undersea weapons, advanced manufacturing, and energy systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.565"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.565"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate efforts in:\n- Addressing platform endurance and resiliency; naval force sustainment; and logistics. These efforts include signature management, undersea weapons improvements, digital twin development and ship hull-based coatings.\n\nContinue efforts in:\n- Undersea platform signature management and control to support the tactical submarine evolution science and technology plan. \n- Technologies to improve the long-range operational capabilities of undersea weapons. \n- \"Digital twin\" development with the expansion to integrate condition-based maintenance; and power and energy to improve overall platform resiliency.\n- Methods to produce rapidly low cost, high performance autonomous unmanned platforms.\n- Improved environmentally benign platform coatings to reduce maintenance costs and improve platform hydrodynamic efficiency.  \n\nConclude efforts in:\n- Precision lift in austere at-sea environments. These efforts were transitioned to an OSD funded effort for at-sea test and evaluation. \n- The unmanned vehicle commercial battery effort anticipating transition into ongoing development programs.\n- Offboard Refueling and Data Transfer for Unmanned Surface Vehicles and Robust Combat Power Control as the efforts will be proposed as candidates for Future Naval Capabilities.\n- Tech Candidate Innovation and Prototype Activities. Specific efforts are being covered under another program element to more closely align work with the Navy's innovation initiative."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 to FY 2021 increase is due to initiation of efforts in addressing platform endurance and resiliency; naval force sustainment; and logistics. These efforts include signature management, undersea weapons improvements, digital twin development and ship hull-based coatings."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warfighter Performance"
                                    },
                                    "Description": {
                                        "val": "The objective of this activity is to develop and mature technologies that enhance Naval warfighting effectiveness and efficiency within the broad array of Warfighter Performance science and technology domains (Undersea Medicine, Biological Sciences, Bio-robotics, Capable Manpower, Command Decision Making, Force Health Protection, Human\/Robot Interaction, Noise-Induced Hearing Loss, and Training and Simulation) to a point where they can be proposed and continued as Future Naval Capabilities (FNC) in program element (PE) 0603673N, Future Naval Capabilities Advanced Technology Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.115"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.150"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Technologies developed under this activity enhance Naval operators use of: Autonomy, Artificial Intelligence, and Robotics (AAR), including cross-domain facilitated communication between operators and unmanned vehicles; Communications and Networking\/Cyber (CN\/C) technologies such as expeditionary command, control, communications, intelligence, surveillance, and reconnaissance (C4ISR); Advanced Analytics and Decision Making (AADM) capabilities including Naval training tools and decision-assist technologies for denied and degraded environments; Manpower, Performance, Protection, and Medical support (MPPM) capabilities such as directed energy bioeffects, monitoring performance in austere environments, and predictors of blast injury."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate efforts in:\n- Applied Human-level artificial intelligence and autonomy that enables the ability for each operator to control multiple autonomous platforms and payloads\n- Social media incorporation for command, control, communications, intelligence, surveillance, and reconnaissance (C4ISR)\n- Multi-media, forecasting, and Live, Virtual, and Constructive capabilities to improve manpower selection, training, education, and job performance\n- Human protection, performance, and biomedical capabilities to increase warfighter lethality and survivability and biotechnologies to provide alternatives to conventional material resources.\n\nContinue efforts on:\n- Modeling and simulation of warfighting environments and systems for training and rehearsal, including cyber and information warfare operations and use of new autonomous systems, technologies for monitoring and forecasting human performance during training and operations, and technologies for a non-rigid 1 atmosphere dive suit.\n\nConclude efforts on:\n- Energy harvesting using microbial fuel cells, data analytics for workplace behavior capture and trend analysis, and detailed physiological human modeling for injury prediction."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 to FY 2021 increase is due to increased investment in autonomous vehicle control improvement, innovative social media applications and biotechnology development for alternative material resources."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval Air Warfare and Weapons"
                                    },
                                    "Description": {
                                        "val": "The objective of this activity is to develop and mature technologies in directed energy, energetic materials, autonomy, electromagnetic launch, and high speed conventional air and surface weapons to a point where they can be proposed and continued as Future Naval Capabilities in PE 0603673N, Future Naval Capabilities Advanced Technology Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.724"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.022"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The focus of FY2020 will be on maturing technologies for future FNCs that will improve kinetic and non-kinetic capabilities of existing and future naval weapon systems, as well as introduce technological advancements into core Naval operations.  Technology investments will be made to introduce artificial intelligence and machine learning into mission planning, make generational enhancements to rocket motor propulsion, investigate sub-system advancement for hypersonic weapons, mature directed energy applications for defense, expand aircraft and ship self-defense capabilities, create alternate aircraft repair methodologies, and improve aircraft-ship interoperability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.094"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.094"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate efforts on:\n- Investigate solid fuel ramjet technology applications to missiles and projectiles for increased range, speed and maneuverability\n- Leverage ongoing collaborative weapons technologies for application to additional munitions and weapons\n- Leverage ongoing reactive materials initiatives for application to additional munitions and weapons. \n\nContinues efforts on:\n- Developing, designing and testing solid state, High-Power Microwave (HPM) systems for enhanced lethality\n- Development of advanced technologies leading to kinetic-kill defenses against adversary hypersonic weapons\n- Development of a pulsed laser to defeat advanced threats.\n\nComplete efforts on:\n- The investigation of advanced air-to-surface\/ground seeker technologies;\n- Advanced technologies for the development of Naval hypersonic weapons and improved high value, low density aircraft self-defense against next generation air-to-air threats."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 to FY 2021 increase is due to increased investments for investigations in semi-autonomous collaborative weapons technologies, greatly expanded reactive materials application to warheads, and non-traditional rocket motor technologies."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "4.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "C4ISR and special projects"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in C4ISR and special projects"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}