{
    "id": "2021-Army-PB-2040-JBOOK-2ce7b76ca8f41dbc06183380f90728d4a8e40b9122c9effab5b4a02fdffb364e-17",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605803A"
        },
        "ProgramElementTitle": {
            "val": "Technical Information Activities"
        },
        "R1LineNumber": {
            "val": "203"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "28.237"
            },
            "CurrentYear": {
                "val": "30.060"
            },
            "BudgetYearOne": {
                "val": "26.244"
            },
            "BudgetYearOneBase": {
                "val": "26.244"
            },
            "BudgetYearTwo": {
                "val": "22.032"
            },
            "BudgetYearThree": {
                "val": "22.575"
            },
            "BudgetYearFour": {
                "val": "23.118"
            },
            "BudgetYearFive": {
                "val": "23.449"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "175.715"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports upgrading the accuracy, timeliness, availability, and accessibility of scientific, technical, and management information at all levels of the Army Research and Development (R&D) community. Management of this information is critical to achieve the goals established by the Army's Senior Leadership. Use of accurate and timely technical information is essential to successfully meeting the milestones required on the path to the future force, allowing Army Science and Technology (S&T) leadership to refine investment strategy and quickly react to emerging opportunities and issues. This PE includes initiatives to improve information derivation, storage, access, display, validation, transmission, distribution, and interpretation, along with initiatives to develop and enhance a single business model for Army S&T knowledge management information technology and to provide for Independent Review Team analysis of technology maturity as part of the Technology Area Readiness Assessment. Conducts Army S&T strategic planning, prioritization, analysis and assessment (Projects 720 and 727). This PE also addresses the need to increase the competitiveness and availability of scientific, engineering, and technical skills in the DoD and National workforce through outreach programs aimed at middle school through college students and teachers. Project 730 provides funding for assessments in attitudes and opinions, longitudinal trends in Soldier and leader perceptions, and emerging issues that provide senior Army leaders with information on Soldiers' perceptions to inform personnel policy and program decision-making concerning manpower, personnel, and training issues. Project 731 provides funding for support for Army high performance computing centers. Project 733 provides funding for improvements to the Army's acquisition process, while Project C16 supports combatant commanders and major Army commands by providing science advisors to address scientific and technical issues and by providing engineering teams to solve field Army technical problems. Project DW3 supports Army Geospatial Enterprise (AGE) Implementation with systems engineering, architecture, and test and certification of Army Acquisition Systems. Finally, this PE funds studies by the Board on Army Science and Technology (BAST) (Project C18). Coordination of this PE with the other Services is achieved through inter-service working groups.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Research, Development, and Engineering Command (RDECOM), Aberdeen Proving Ground, MD; the Army Research Institute for the Behavioral and Social Sciences (ARI), Ft. Belvoir, VA; the Army Corps of Engineers' Engineer Research and Development Center (ERDC), Vicksburg, MS; Medical Research and Materiel Command (MRMC), Ft. Detrick, MD; Space and Missile Defense Command (SMDC), Huntsville, AL; the Army Geospatial Center (AGC) in Alexandria, VA; Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, MI; the Information Management Office, Arlington, VA; and the Office of the Assistant Secretary of the Army, Acquisition, Logistics and Technology."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "29.024"
                },
                "CurrentYear": {
                    "val": "25.06"
                },
                "BudgetYearOne": {
                    "val": "25.698"
                },
                "BudgetYearOneBase": {
                    "val": "25.698"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "28.237"
                },
                "CurrentYear": {
                    "val": "30.06"
                },
                "BudgetYearOne": {
                    "val": "26.244"
                },
                "BudgetYearOneBase": {
                    "val": "26.244"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.787"
                },
                "CurrentYear": {
                    "val": "5"
                },
                "BudgetYearOne": {
                    "val": "0.546"
                },
                "BudgetYearOneBase": {
                    "val": "0.546"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "5"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.787"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.546"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.546"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "720"
                    },
                    "ProjectTitle": {
                        "val": "Tech Info Func Actv"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.616"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.616"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides funding for technology transfer activities to support acquisition, storage, and utilization of technical information for both military and domestic applications. Effective exploitation of science and technology (S&T) information is critical to achieving the goals established by senior Army leadership. Activities include: Army support for Federal Laboratory Consortium (FLC) as required by Public Law; the Army Science Board; the Army Science Conference; S&T database management efforts; and administration of the Army's Small Business Innovation Research (SBIR) and Small Business Technology Transfer Program (STTR) in accordance with the Small Business Innovation Development Act of 1982, the Small Business Research and Development Enhancement Act of 1992 and subsequent reauthorizing legislation. Technology transfer activities make technical information available to both the public and private sectors to reduce duplication in Research and Development programs and to increase competitiveness in the United States (U.S.) business community. Database management efforts support development of decision aids, databases, and automation support for the management and execution of the Army Research, Development, Test and Evaluation (RDTE) appropriation. In addition, this Project provides funding for patent legal expenses and fees for all U.S. Army Research, Development, and Engineering Command (RDECOM) subordinate commands and laboratories, as required by the Omnibus Budget Reconciliation Act.  \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n  \nWork is performed by RDECOM, Aberdeen Proving Ground, MD and the US Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Provide Army Funding Support for Federal Laboratory Consortium as Required by Public Law 104-113"
                                    },
                                    "Description": {
                                        "val": "Public Law 104-113 requires the Army to provide funding for the federal laboratory consortium which is a network of federal agencies that provide a platform where technologies can be strengthened and promoted to return dividends to our economy. Beginning in Fiscal Year 2020, funding for the Federal Laboratory Consortium has been realigned to Project 727."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.252"
                                            },
                                            "Text": {
                                                "val": "Provided Army funding support for Federal Laboratory Consortium as required by Public Law 104-113."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Provide Funding for Patent Fees and Patent Legal Expenses for U.S. Army Materiel Command  (AMC) Commands and Laboratories"
                                    },
                                    "Description": {
                                        "val": "The Army Research Laboratory turns high-value Army S&T investments into patented technologies in an effort to convert research into jobs and innovations for the Warfighter. The funded efforts are used for patent fees and legal expenses required for the patent application process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.941"
                                            },
                                            "Text": {
                                                "val": "Provided funding for patent fees and patent legal expenses for AMC commands and laboratories."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Provide Funding for S&T Strategic Planning and Support"
                                    },
                                    "Description": {
                                        "val": "S&T strategic planning and support is a critical component to the overall Army mission as it reaffirms Army leadership guidance, reinforces commitment to basic research, and leverages a landscape of game-changing technologies that can provide future innovations and capabilities to the Warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.267"
                                            },
                                            "Text": {
                                                "val": "Provided funding for S&T Strategic Planning and Support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Administer S&T Database Computer Engineering Support Contract and Support RDECOM Databases S&T Management Support"
                                    },
                                    "Description": {
                                        "val": "The S&T database computer engineering support contract provides management support of RDECOM's databases as well as supports the development of the Army Research Laboratory S&T information activities to include campaign plans envisioned to lead to enhanced land power capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.922"
                                            },
                                            "Text": {
                                                "val": "Administered S&T database computer engineering support contract and support RDECOM databases S&T management support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Administrative Support for the Army's SBIR and STTR Programs"
                                    },
                                    "Description": {
                                        "val": "Army SBIR and Army STTR programs. In 1982, Congress, through the Small Business Innovation Development Act (P.L. 97-219) established the SBIR program to foster the involvement of US based small businesses in federal research and development (R&D). The SBIR program is designed to increase the participation of small, high-technology firms in the federal R&D endeavor and give driven businesses the opportunity to provide innovative R&D solutions in response to critical Army needs.  The STTR program expands the public\/private sector partnership to include the joint venture opportunities for small business and the nation's premier nonprofit research institutions. The most important role of the STTR program is to foster the innovation necessary to meet the nation's scientific and technological challenges in the 21st century. The SBIR\/STTR support services include program and technical advisory support services on a broad level. The Army SBIR\/STTR Program Management Office mission requires synergized, integrated business solutions that concentrates on small business technological advances, and eliminates redundancy in a codified and consistent method that reduces confusion and ambiguity for the thousands of small businesses that participate in the SBIR and STTR programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.234"
                                            },
                                            "Text": {
                                                "val": "Provided the Army SBIR\/STTR Program Offices with the resources necessary to execute Congressionally-mandated programs.  The Army SBIR\/STTR Program Offices procured program management and technical services required to support the programs. The support services include a broad range of program and technical assistance services such as programming; database support; drafting of letters, reports, newsletters, briefings, presentation materials and correspondence; analyses; documentation for record keeping and reporting; helpdesk; and web portal development and support. The services assisted the Program Offices in planning, coordinating, implementing, and orchestrating SBIR\/STTR functions to include current and new approaches, processes and procedures as required by United States Code, Title 15, Section 638, Fiscal Year 2012 National Defense Authorization Act, Public Laws 112-81, and in Public Laws 97-219, 99-443, 102-564 and 106-554."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "727"
                    },
                    "ProjectTitle": {
                        "val": "Tech Info Activities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.787"
                        },
                        "CurrentYear": {
                            "val": "10.556"
                        },
                        "BudgetYearOne": {
                            "val": "11.087"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.087"
                        },
                        "BudgetYearTwo": {
                            "val": "11.672"
                        },
                        "BudgetYearThree": {
                            "val": "12.095"
                        },
                        "BudgetYearFour": {
                            "val": "12.395"
                        },
                        "BudgetYearFive": {
                            "val": "12.523"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "78.115"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds the oversight of science, research, and technology investments within the Department of the Army. These efforts include developing strategic direction, policy development, oversight and management of the Army's S&T portfolio including resource allocation. It includes contractor support required to implement a set of management decision aids, databases, and tools to support technical and budgetary decisions at the Department of the Army (DA). Additionally, covers the development and tracking of S&T metrics across the enterprise and supports development if Army plans, programs and policies for OSD and Congress. Most of the efforts in this project are on-going activities to support Army Research, Development, and Acquisition programs. Effective exploitation of Science and Technology (S&T) information is critical to achieving the goals established by Senior Army Leadership for the future force. Funding in this program supports Independent Review Team analysis of technology maturity as part of Technology Area Readiness Assessments.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Office of the Assistant Secretary of the Army, Acquisition, Logistics and Technology, The Pentagon, Washington, DC."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Conduct and support S&T program portfolio assessments and analysis."
                                    },
                                    "Description": {
                                        "val": "Supports identification, development and demonstration of technology options that inform and enable effective and affordable capabilities for the Soldier Providing Soldiers with the technology to win. Support Air, C3I, Ground Maneuver, Soldier, Basic Research and Lethality Portfolio Directors, responding to scientific, technical and programmatic challenges. Support Independent Review Team analysis of technology maturity as part of Technology Area Readiness Assessments. Serve as Office of the Deputy Assistant Secretary of the Army, Research and Technology (DASA(R&T)) central point of contact for S&T Metrics, Strategic Portfolio Analysis Review, evaluate technical risks, assess earned value and technical and financial health of S&T projects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.17"
                                            },
                                            "Text": {
                                                "val": "Tracked, managed and provided programmatic support for applied research and advanced technology development efforts in vulnerability assessments; acted as the S&T SMEs and provided Portfolio leads forecasted for science and technology ?outputs? aligned with Programs of Record; provided ODASA (R&T) summary briefing in the SPAR; ensured tight alignment and coupling to existing PoRs and identified where misalignment between Portfolio technology projections\/timelines and\/or emerging technology options were not yet reflected at the PoR level. Identified technology for effective and affordable capabilities in the S&T portfolios: Basic Research, Innovation Enablers, Medical, Soldier\/Squad, Command, Communications and Command, Control, Communications, Computers and Intelligence (C3I), Air, Lethality and Ground Maneuver."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.256"
                                            },
                                            "Text": {
                                                "val": "Track, manage and provide programmatic support for applied research and advanced technology development efforts in vulnerability assessments; act as the S&T SMEs to provide Portfolio leads what is forecasted for science and technology ?outputs? to align with Programs of Record; provide ODASA (R&T) summary briefing in the Strategic Portfolio Analysis Review (SPAR); ensure tight alignment and coupling to existing PoRs and will identify where misalignment between Portfolio technology projections\/timelines and\/or emerging technology options are not yet reflected at the PoR level. Identify technology for effective and affordable capabilities in the S&T portfolios: Basic Research; Innovation Enablers; Medical; Soldier\/Squad; Command, Control, Communications, Computers and Intelligence (C3I); Air; Lethality; and Ground Maneuver.\n\nConduct studies of emerging topics based on Army S&T strategy and senior leader initiatives through the Board on Army Science and Technology (BAST) and the National Academies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.1"
                                            },
                                            "Text": {
                                                "val": "Will track, manage and provide programmatic support for applied research and advanced technology development efforts across the Army modernization priorities; will act as the S&T SMEs to provide Portfolio leads what is forecasted for critical science and technology 'outputs' to align with Programs of Record; will ensure tight alignment and coupling to existing PoRs and will identify where misalignment between Portfolio technology projections\/timelines and\/or emerging technology options are not yet reflected at the PoR level. Will perform cross portfolio coordination and assessment; and evaluate and assess cost, schedule and technical progress against metrics to determine project health. Will assess progress of S&T projects, support Cross-functional team deep dives, evaluate technical risks and assess earned value for S&T projects. Will identify technology for effective and affordable capabilities in all the S&T portfolios: Basic Research; Medical; Soldier; Command, Control, Communications, Computers and Intelligence (C3I); Air; Lethality; and Ground Maneuver. Will conduct studies of merging topics based on Army S&T strategy and senior leader initiatives through the Board on Army Research and Development (BOARD) and the National Academies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This increase is due to the alignment of resources to ASAALT to provide oversight and executive management of the entire Army S&T portfolio for resource allocation decisions supporting the S&T planning, programming and budget execution process."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support Army S&T strategic planning, analysis, and prioritization."
                                    },
                                    "Description": {
                                        "val": "Coordinates efforts with and across the Army S&T portfolios; manage proposal nomination and selection process; track and provide oversight of ongoing efforts; recommend resolutions\/prioritization in the event of conflicting requirements and\/or resource constraints; support the full spectrum of Planning, Programming and Budget Execution (PPBE) as it relates to the Army S&T Program. Provide senior level technical and analytical support for the Joint Capability Technology Demonstration (JCTD) program and Technology Maturation Initiative (TMI) by assisting with investment analysis, strategies and oversight. Provide financial management recommendations and insights with regards to JCTDs, TMI, Manufacturing Technology (ManTech) and Defense Manufacturing Initiatives. A variety of scientific and technical taxonomies applied at the task level allow responsive reporting on S&T programs to Congressional, OSD and Army leadership. Beginning in Fiscal Year 2020, funding for the Federal Laboratory Consortium has been realigned to this line of effort from Project 720."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.376"
                                            },
                                            "Text": {
                                                "val": "Developed strategic analyses to look across the S&T portfolios and provided recommendations to the Director of Integration for S&T efficiencies and collaborative opportunities; supported ODASA(R&T) lead for future force; continued to coordinate efforts with and across the Army S&T portfolios; supported the PDM process, tasks and guidance for Equipping PEG; developed prioritized decrement lists and recommended alternatives for a balanced portfolio; and supported the plan and execution for the ASTAG, the ASTWG and the WTC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.6"
                                            },
                                            "Text": {
                                                "val": "Develop strategic analyses to look across the S&T portfolios and will provide recommendations to the Director of Integration for S&T efficiencies and collaborative opportunities; support ODASA(R&T) lead for future force; continue to coordinate efforts with and across the Army S&T portfolios; support the PDM process, tasks and guidance for Equipping PEG; develop prioritized decrement lists and recommend alternatives for a balanced portfolio; and support the plan and execution of the S&T Oversight Committees. Beginning in Fiscal Year 2020, funding for the Federal Laboratory Consortium has been realigned to this line of effort from Project 720."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.537"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.537"
                                            },
                                            "Text": {
                                                "val": "Will develop strategic analyses to look across the S&T portfolios and will provide recommendations to the Director of Integration for S&T efficiencies and collaborative opportunities; will ensure that resources align to strategy; will support S&T policy development; will support ODASA(R&T) lead for future force; will coordinate efforts within and across the Army S&T portfolios and engage in tri service leveraging; will support the PDM process, tasks and guidance for Equipping PEG; will develop prioritized decrement lists and recommend alternatives for a balanced portfolio; and will support the plan and execution of the S&T Oversight Committees. Evaluate projects within ManTech to support potential joint Service efforts and activities of Joint Defense ManTech. Support Army Prototyping Board planning and execution, and evaluation and tracking implementation of transition agreement policy."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This increase is due to the alignment of resources to ASAALT to provide strategic direction and ensure S&T investments are aligned to meet strategic goals."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Provide funding and support for Army Acquisition Program Technology Readiness Assessments for Program Milestone Decisions."
                                    },
                                    "Description": {
                                        "val": "Coordination and alignment with Programs of Record. Demonstrate technical feasibility at system and subsystem level. As path for technology spirals to acquisition, ensure a rapid insertion of new technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.268"
                                            },
                                            "Text": {
                                                "val": "Supported the S&T investment strategy for the entire Army; provided options for the future across to sustain overmatch against adversaries and create opportunities to meet new challenges and fight in new ways; continued Independent Review Team (IPT) analysis of technology maturity as part of Technology Readiness Assessments as required by DoDI 5000.2; and acted as the central point of contact for Systems Red Teaming and Technology Vulnerability Assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Support the S&T investment strategy for the entire Army; provide options for the future across to sustain overmatch against adversaries and to create opportunities to meet new challenges and fight in new ways; continue Independent Review Team (IRT) analysis of technology maturity as part of Technology Readiness Assessments as required by DoDI 5000.2; and act as the central point of contact for Systems Red Teaming and Technology Vulnerability Assessments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.25"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.25"
                                            },
                                            "Text": {
                                                "val": "Will support the S&T investment strategy for the entire Army; will provide options for the future across to sustain overmatch against adversaries and to create opportunities to meet new challenges and fight in new ways; will continue Independent Review Team (IRT) analysis of technology maturity as part of Technology Area Readiness Assessments; will provide oversight and management of the Army's Technology Maturation Initiative; will develop and track S&T metrics across the enterprise; will identify S&T transitions in SPAR to identify follow-on funding requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This increase is due to the alignment of resources to ASAALT to track S&T metrics across the enterprise."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Provide Army support to Assistant Secretary of Defense for Research and Engineering Executive Staff for Department of Defense (DoD) wide Science and Technology oversight."
                                    },
                                    "Description": {
                                        "val": "Supports Army engagement in DoD\/Under Secretary of Defense for Research and Engineering and cross agency Communities of Interest (COI) and committees."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.973"
                                            },
                                            "Text": {
                                                "val": "Participated in Defense Advanced Research Projects Agency (DARPA) engagements and awareness of DARPA Programs with links to Army S&T; supported Army S&T Engagements with DARPA Program Managers and Leadership; and supported execution of ongoing programs, events and functional responsibilities, effectively communicating with all Army stakeholders and partners including other services, OSD, industry and academia."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.2"
                                            },
                                            "Text": {
                                                "val": "Participate in Defense Advanced Research Projects Agency (DARPA) engagements and awareness of DARPA Programs with links to Army S&T; support Army S&T Engagements with DARPA Program Managers and Leadership; and support execution of ongoing programs, events and functional responsibilities, effectively communicating with all Army stakeholders and partners including other services, OSD, industry and academia."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.2"
                                            },
                                            "Text": {
                                                "val": "Participate in DoD Communities of Interest engagements and awareness of COI Programs with links to Army S&T; support Army S&T Engagements with USDRE Managers and Leadership; and support execution of ongoing programs, events and functional responsibilities, effectively communicating with all Army stakeholders and partners including other services, OSD, industry and academia."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Conduct and support technology wargaming"
                                    },
                                    "Description": {
                                        "val": "Crowd-sources future capabilities from the Army S&T enterprise, academia, and non-traditional DoD thinkers. Provides context and analysis on emerging national and international S&T trends in annual Emerging Trends report. Develops predictive technologies to identify disruptive technologies earlier. Analyzes international efforts in army S&T priorities and create a report to help inform decisions involving research partnerships."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.094"
                                            },
                                            "Text": {
                                                "val": "Crowd-source future capabilities from the Army S&T enterprise, academia, and non-traditional DoD thinkers. Refine crowd-sourced efforts, adding Subject-Matter Expert review to create a functional decomposition of potential capabilities and analysis of potential technologies using bibliographic-based data analytics (universities, personnel, countries performing the research). Assign probabilities and perform Monte Carlo Simulation to create a here-to-there narrative for how basic science advances can produce an Army capability through a Technology Sequence Analysis (TSA). Implement a predictive technology tool, making it available to the S&T user base. Update international S&T report yearly, adding emerging S&T areas and dropping those that are no longer army S&T priorities. Continue to update and provide context and analysis on emerging national and international S&T trends in annual Emerging Trends Report."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort complete in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.406"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "730"
                    },
                    "ProjectTitle": {
                        "val": "Pers & Trng Analys Act"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.317"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.317"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds the Army's behavioral and social science research in attitudes and opinions assessment, longitudinal trends in Soldier and leader perceptions, and emerging issues. The research provides a unique capability to address a number of issues that directly or indirectly affect Soldier and unit performance and readiness, such as identifying the impact of personnel policies on Soldier outcomes and identifying emerging and potential personnel challenges. Requirements for this research is solicited on a recurring basis from the Secretary of the Army (SA), Chief of Staff of the Army (CSA), Army Deputy Chief of Staff (DCS) G-1, and the Assistant Secretary of the Army for Manpower and Reserve Affairs (ASA (M&RA)). \n\nWork in this Project is managed by the United States Army Research Institute for the Behavioral and Social Sciences (ARI), Ft. Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PERS & TRNG ANALYS ACT"
                                    },
                                    "Description": {
                                        "val": "This effort conducts attitude and opinion research to identify longitudinal trends and emerging issues to inform senior Army leader decision making and shape ARI's long-range S&T program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.317"
                                            },
                                            "Text": {
                                                "val": "Conduct research on critical issues identified by the SA, CSA, DCS G-1, and ASA (M&RA)."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "731"
                    },
                    "ProjectTitle": {
                        "val": "Army High Performance Computing Centers"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.543"
                        },
                        "CurrentYear": {
                            "val": "1.995"
                        },
                        "BudgetYearOne": {
                            "val": "2.037"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.037"
                        },
                        "BudgetYearTwo": {
                            "val": "2.1"
                        },
                        "BudgetYearThree": {
                            "val": "2.137"
                        },
                        "BudgetYearFour": {
                            "val": "2.133"
                        },
                        "BudgetYearFive": {
                            "val": "2.154"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "17.099"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides funding for the high performance computing (HPC) research environment, research, education, infrastructure sustainment, and outreach support associated with Army High Performance Computing Centers at the United States (U.S.) Army Combat Capabilities Development Command (CCDC), specifically, CCDC Army Research Laboratory (ARL) and CCDC Ground Vehicle Systems Center (GVSC). The Army High Performance Computing Centers provide high fidelity modeling, simulation, and analysis of materials, systems, and operational constructs. The Centers work with researchers at Army laboratories and research, development, and engineering centers to explore new HPC computing environments, algorithms in the computational sciences to address critical technology issues in computational research areas.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork is performed by ARL, Aberdeen Proving Ground, MD and GVSC, Warren, MI."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustain the High Performance Computing Environment and Infrastructure in Support of the CCDC Army Research Laboratory (ARL)"
                                    },
                                    "Description": {
                                        "val": "The HPC center provides levels of computational capacity to the Army's tactical operational realms and provide innovative HPC capabilities to increase the effectiveness of Army Soldiers around the world. Algorithm design and software engineering approaches are investigated to effectively partition and use binary processing cores to reduce time to solution for Army-relevant problems. Factors such as performance, portability, and power will be considered in conjunction with developing new models to quantify computing capabilities in hybrid systems to facilitate algorithm signature mapping to available resources."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.543"
                                            },
                                            "Text": {
                                                "val": "Sustained HPC environment and infrastructure for advanced heterogeneous computing architecture including data sciences computing architectures, special access systems infrastructure, programmable HPC Networking infrastructure, and ARL computational sciences Open Campus systems. Sustained software so that the software can take advantage of advanced computing architectures, HPC networking, and visualization that are mission critical for Army Science and Engineering (S&E) and Test and Evaluation (T&E) applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.904"
                                            },
                                            "Text": {
                                                "val": "Will support HPC environment and infrastructure by developing new methods for large-scale data processing needs and physics-based simulation applications. Sustain and port new software and legacy software to ensure compatibility with emerging computing systems, HPC networking, and visualization for mission critical applications. Sustain classified and above secret computing environments, providing application support for these special needs. Expand and support ARL Open Campus computational processing and simulation needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.037"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.037"
                                            },
                                            "Text": {
                                                "val": "Will support infrastructure, enabling hardware\/software and other HPC capabilities while developing and implementing new methods for large-scale data analytic needs in addition to those associated with traditional physics -based simulation applications. Expand the customer base to non-traditional users to enable critical and highly impactful analyses of large and disparate data sets across all services. Sustain and expand the secret, above secret and special access computational environments according to emerging security and customer requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Economic adjustment"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.091"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "733"
                    },
                    "ProjectTitle": {
                        "val": "Acquisition Tech Act"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.412"
                        },
                        "CurrentYear": {
                            "val": "9.278"
                        },
                        "BudgetYearOne": {
                            "val": "4.8"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.8"
                        },
                        "BudgetYearTwo": {
                            "val": "4.867"
                        },
                        "BudgetYearThree": {
                            "val": "4.942"
                        },
                        "BudgetYearFour": {
                            "val": "5.009"
                        },
                        "BudgetYearFive": {
                            "val": "5.122"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "37.430"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds improvements to the Army's acquisition programmatic and financial data by applying decision support and expert information systems, supporting analysis and evaluation of alternative acquisition strategies, and ability to measure effectiveness in meeting Army modernization strategy requirements.  This Project provides the environment for the analysis and evaluation of new information technologies, concepts and applications for integrated management activities and supports the integration of technology to provide the Army Acquisition Executive with sound data for decision-making.  This Project also supports critical analyses for Army senior leadership in support of Army Modernization efforts.  These analyses are used by leadership in making acquisition, procurement, and logistics decisions in order to provide quality equipment to the Soldiers.  \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by organizations within the Assistant Secretary of the Army (Acquisition, Logistics and Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ACQUISITION TECH ACT"
                                    },
                                    "Description": {
                                        "val": "This effort will deploy and beta test application programs and user interface utilities for executive level information systems that offer Standard Query Language services to the Army Acquisition Executive corporate and Army databases.  This effort will analyze an acquisition programs fiscal programming and budgeting requirements against enacted appropriations, conduct long range programming, planning and policy analysis, resource allocation analysis, cost tracking, and analysis.  Robust requirements will then be transitioned to a Program Executive Officer for full implementation across the Program Executive Offices and respective Project and Product Management Offices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.412"
                                            },
                                            "Text": {
                                                "val": "Distribute and beta test application programs and user interface utilities for executive level information systems that offer Standard Query Language services to Army Acquisition Corps corporate and global databases. Analyze acquisition program financial programming and budgeting requirements. Continue development of long-range planning and policy analysis, resource allocation analysis, cost tracking, and analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.857"
                                            },
                                            "Text": {
                                                "val": "Establish and phase the implementation of an Integrated Program Management Environment framework that enables centralized, role-based access to trusted and authoritative data from disparate Acquisition Domain data sources.  Beta-test an interim program management resource tool as a proof of concept pilot within the Army.  This tool will be scaled and deployed across the Army Program Executive Offices to capture programmatic and financial data for acquisition programs of record and investments.   Report progress to Army Acquisition Executive for go\/no-go decision to fully implement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.8"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.8"
                                            },
                                            "Text": {
                                                "val": "Upon decision by the Army Acquisition Executive, continue the phased implementation of the Program Management Environment framework to incorporate acquisition metrics to measure the progress of all Army acquisition programs and investment efforts.   This project will allow organizations within the Army Acquisition Executive and Army Staff to quickly access acquisition programmatic or financial information needed without the necessary burden to a program office for data calls.  This is the continuation of a deliberate effort to build a larger acquisition domain which will capture and utilize acquisition programs data from concept to divestiture."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funds realigned to support higher priority requirements consistent with Army Modernization strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.421"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "C16"
                    },
                    "ProjectTitle": {
                        "val": "FAST"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.602"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.602"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides support for the Field Assistance in Science and Technology (FAST) program. The FAST program provides Science Advisors, recruited from Army Materiel Command (AMC) headquarters and all Major Subordinate Commands (MSC) to serve combatant commands and major commands worldwide. FAST tours of duty provide significant professional growth opportunities for the Army's scientists and engineers and enable them to focus AMC resources on rapidly identifying and solving field technical problems that enable the improvement of readiness, safety, training, and reduce operations and support (O&S) costs. The FAST activity is supported by Quick Reaction Coordinators within the engineering centers. The FAST program recoups many times its cost in O&S savings. FAST also provides emerging technology demonstration opportunities to the engineering centers an Annual Program Review to facilitate sharing of lessons learned between science advisors at combatant commands, assists Combatant Commanders (COCOMS) with their annual Science and Technology Conferences. FAST also maintains close coordination with the Navy Science Advisor Program (Naval Fleet Forces Technology Integration Office). FAST supports warfighters in contingency operations with embedded Science and Technology Assistance Teams (STATs) as well as Science and Technology Acquisition Corps Advisors (STACAs).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by: AMC, Redstone Arsenal, AL; and Research, Development and Engineering Command (RDECOM), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Respond to combatant commanders worldwide with technological solutions."
                                    },
                                    "Description": {
                                        "val": "This activity: responds to combatant commanders worldwide with technological solutions to urgent materiel problems they identify; deploys science advisors with U.S. Task Forces in support of combatant commanders; executes annual Program Review; provides additional support needed to participate in combatant commander exercises; responds to corresponding Warfighter requests for information (RFIs), providing project support to offset capability gaps identified by the Warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.602"
                                            },
                                            "Text": {
                                                "val": "Responded to combatant commanders worldwide with technological solutions to urgent materiel problems they identify; deployed science advisors with U.S. Task Forces in support of combatant commanders; executed annual Program Review; provide additional support needed to participate in combatant commander exercises; responded to corresponding Warfighter RFI's; and provided project support to offset capability gaps identified by the Warfighter."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "C18"
                    },
                    "ProjectTitle": {
                        "val": "BAST"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.865"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.865"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds the Board on Army Science and Technology (BAST). The BAST functions under the auspices of the National Research Council (NRC) and provides an external, independent, and objective source of advice to the Army. The BAST serves as a convening authority for the discussion of science and technology issues of importance to the Army and oversees independent Army-related studies conducted by the National Academies. Working in close coordination with the Army, the BAST helps define problems, brings together experts to study these problems, and provides recommendations. Committees are assembled in accordance with established NRC procedures and BAST studies often take 12 months or more to conclude.  \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is executed extramurally by the U.S. Army Research Laboratory, Army Research Office (ARO), Research Triangle Park, NC."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Provide Studies and Conduct Periodic Meetings to Help Identify, Assess, and Recommend Emerging Opportunities in Science and Technology (S&T) Fields Applicable to the United States (U.S.) Army"
                                    },
                                    "Description": {
                                        "val": "To acquire a greater understanding of emerging technology opportunities that support a plethora of Army-relevant capability gaps, technologies are continuously assessed both nationally and internationally. In addition, periodic meetings are conducted to discuss and recommend strategic research areas critical to advancing the Warfighter's capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.865"
                                            },
                                            "Text": {
                                                "val": "Studied emerging topics based on Army S&T strategy and senior leader initiatives and plan to initiate a new National Academies study."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CC2"
                    },
                    "ProjectTitle": {
                        "val": "Expeditionary Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "5"
                        },
                        "BudgetYearOneBase": {
                            "val": "5"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY2021 this project is being realigned from:\n- Program Element 0605801A Medical Command Support\n* Project MO2 Med Cmd Spt (Non-AMHA)\n\n- Program Element GZ2400 Bradley Modification program"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project evaluates the feasibility and potential application of disruptive technologies to Army capability gaps. Expeditionary Technology Search (xTechSearch) partners with small, non-traditional companies to apply novel techniques and applications to Army problems through a non-dilutive prize competitions, business accelerators, and outreach activities. These programs will uncover novel dual-use technology solutions that otherwise would not be identified by the Department of Defense. \n\nWork in this Project is performed by the United States Army Futures Command.\n\nThe cited work is consistent with the Under Secretary of Defense fro Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Technology Search (xTechSearch)"
                                    },
                                    "Description": {
                                        "val": "Funds technical scouting and competition in Army-wide disciplines through rigorous technical assessment, Soldier feedback, mentorship sponsoring, and cash prizes."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5"
                                            },
                                            "Text": {
                                                "val": "Conduct biannual competitions with small, non-traditional companies seeking to apply their product or idea towards a prescribed focus area."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2021 funds have been realigned from Program Element 0605801A Medical Command Support, Project MO2 Med Cmd Spt (Non-AMHA) and Program Element GZ2400 Bradley Modification Program."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW3"
                    },
                    "ProjectTitle": {
                        "val": "Army Geospatial Enterprise Implementation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.095"
                        },
                        "CurrentYear": {
                            "val": "8.231"
                        },
                        "BudgetYearOne": {
                            "val": "3.32"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.32"
                        },
                        "BudgetYearTwo": {
                            "val": "3.393"
                        },
                        "BudgetYearThree": {
                            "val": "3.401"
                        },
                        "BudgetYearFour": {
                            "val": "3.581"
                        },
                        "BudgetYearFive": {
                            "val": "3.65"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "28.671"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides geospatial domain expertise to Mission Command (MC) in implementing the Army Geospatial Enterprise (AGE) across all MC Systems to ensure interoperability across the Army, with National Agencies and UAP partners; ensures Army systems can consume geospatial data from National-Geospatial Intelligence Agency (NGA) and with National System for Geospatial-Intelligence (NSG) partners as required by Department of Defense Instruction (DoDI) 5000.56; standardizes geospatial data between echelons and ensures Standard, Sharable Geospatial Foundation (a Mission Command Essential Capability) across Mission Command; and sustains core mission of operations. Project enables an interoperable geospatial baseline system of systems in theater, which is a near-term requirement that cannot be deferred. Geospatial is a Mission Command Essential Capability and a critical enabler for the Common Operating Environment (COE), Army modernization and the warfighter."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Program Increase"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enterprise Support Branch (formerly Geospatial Acquisition Support Office)"
                                    },
                                    "Description": {
                                        "val": "This effort provides the geospatial systems engineering, architecture, and test and certification required to ensure Army Acquisition Systems meet Program Executive Office (PEO)\/Program Manager (PM) and Common Operating Environment (COE) geospatial requirements which ensure geospatial interoperability across Mission Command and with our National and UAP partners; Develops new geospatial standards and evaluates emerging geospatial technologies early in their development processes to enable an interoperable geospatial baseline system of systems in theater, which is a near-term requirement that cannot be deferred."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.095"
                                            },
                                            "Text": {
                                                "val": "Extended the AGE within the Command Post Computing Environment (CE), Mounted and Mobile Hand-Held CE's; developed alternatives for providing Standard, Shareable Geospatial Foundation (a Mission Command Essential Capability) to Mission Command Systems in a disconnected, Intermittent or Limited environment; developed and recommended standards to distribute SSGF from National to Tactical; developed \"to be\" AGE roadmap for Mission Command which ensured interoperability between Mission Command systems, the NSG, and our UAP partners; and provided geospatial domain expertise for six geospatial Enabling Technology Support Services (ETSS) for the Common Operating Environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.156"
                                            },
                                            "Text": {
                                                "val": "Will continue to extend the AGE implementation within the Command Post Computing Environment, Mounted and Mobile Hand-Held CE's; continue to develop alternatives for providing Standard, Sharable Geospatial Foundation (a Mission Command Essential Capability) to Mission Command Systems in a disconnected, Intermittent or Limited environment; develop and recommend standards to distribute SSGF from National to Tactical; initiate implementation AGE roadmap for Mission Command ensuring interoperability between Mission Command systems, the NSG, and our UAP partners; and provide geospatial domain expertise for Army modernization and enabling technologies of the Common Operating Environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.32"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.32"
                                            },
                                            "Text": {
                                                "val": "Will extend AGE within the Command Post Computing Environment, Mounted and Mobile Hand-Held CE's and to support Army modernization; develop and promulgate geospatial standards and technology alternatives for providing Standard, Sharable Geospatial Foundation (a Mission Command Essential Capability) to Mission Command Systems in a disconnected, Intermittent or Limited environment; develop and recommend technologies and processes to provide an interoperable 2D and 3D SSGF from National to Tactical; continue to execute roadmap to enable geospatial interoperability between Mission Command systems, the NSG, and our UAP partners; and provide geospatial domain expertise for Mission Command, Army modernization and enabling technologies of the Common Operating Environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY20 to FY21 increases are due to programmed inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.075"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}