{
    "id": "2021-AirForce-PB-3600-MJBOOK-0-0-4ccc939241b47239c36ee98d5519ce37a7e18b46d494a025321d2035cb3d38d7-6",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602202F"
        },
        "ProgramElementTitle": {
            "val": "Human Effectiveness Applied Research"
        },
        "R1LineNumber": {
            "val": "7"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "109.598"
            },
            "CurrentYear": {
                "val": "134.795"
            },
            "BudgetYearOne": {
                "val": "115.222"
            },
            "BudgetYearOneBase": {
                "val": "115.222"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "119.441"
            },
            "BudgetYearThree": {
                "val": "115.417"
            },
            "BudgetYearFour": {
                "val": "118.210"
            },
            "BudgetYearFive": {
                "val": "120.454"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program conducts applied research in the area of airmen training, airmen system interfaces, bioeffects, and understanding and shaping adversarial behavior. The Learning and Operational Readiness project conducts research to increase the agility of training for readiness while advancing learning and performance assessment science and practice. The Human Dynamics Evaluation project conducts research to discover, demonstrate, and transition capabilities which optimize and safe-guard Airman physical and cognitive performance allowing for the maximum potential of the multi-domain Airman. The Sensory Evaluation and Decision Science project conducts research to discover, demonstrate, and transition communication enhancements, and decision analytics to generate maximally effective warfighting teams resulting from the integration of Airmen and increasingly intelligent machines. The Bioeffects project conducts novel and operational exposure bioeffects research, exposure effects analysis and national\/international exposure standards for the Air Force to enable, sustain, and enhance Airman performance and protection during deployment and application of advanced chemicals\/materiel in air superiority platforms and warfighting directed energy systems.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602203F, 0602204F, 0602602F, 0602605F, 0602788F, 1206601SF, and 0602298F.\n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "119.018"
                },
                "CurrentYear": {
                    "val": "131.795"
                },
                "BudgetYearOne": {
                    "val": "131.809"
                },
                "BudgetYearOneBase": {
                    "val": "131.809"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "109.598"
                },
                "CurrentYear": {
                    "val": "134.795"
                },
                "BudgetYearOne": {
                    "val": "115.222"
                },
                "BudgetYearOneBase": {
                    "val": "115.222"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-9.420"
                },
                "CurrentYear": {
                    "val": "3.000"
                },
                "BudgetYearOne": {
                    "val": "-16.587"
                },
                "BudgetYearOneBase": {
                    "val": "-16.587"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "3.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.439"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-6.981"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-16.587"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-16.587"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2019 in Other Adjustments of $6.981 million is due to realignment of funds to PE 0602212F to support Research and Development Projects, 10 U.S.C. Section 2363, an amendment to PL 110-417, 10 U.S.C. Section 2358 and 10 U.S.C. 2805(d)(1)(B).\n\nDecrease in FY 2021 is due to the realignment and consolidation of the Future AF Capabilities Applied Research efforts\/activities to PE 0602020F, Future AF Capabilities Applied Research, Project 620200, Enterprise Transformational Applied Research, to better align with the Air Force S&T Strategy SECAF April 2019 and provide Congress with increased transparency on transformational Air Force S&T activities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "621123"
                    },
                    "ProjectTitle": {
                        "val": "Learning and Operational Readiness"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "20.665"
                        },
                        "CurrentYear": {
                            "val": "22.495"
                        },
                        "BudgetYearOne": {
                            "val": "22.606"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.606"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "23.079"
                        },
                        "BudgetYearThree": {
                            "val": "21.785"
                        },
                        "BudgetYearFour": {
                            "val": "22.094"
                        },
                        "BudgetYearFive": {
                            "val": "22.315"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project advances research to measure, accelerate, and expand the cognitive skills necessary to improve airmen training and mission performance. These discoveries will provide Airmen the knowledge, skills, and experiences to dominate the decision environment. Research is conducted in two focus areas: personalized learning and cognitive modeling. Personalized learning focuses on scientific discovery and exploratory application of adaptive personalization technologies to provide more effective learning which will increase mission readiness. Cognitive modeling leverages computational methods to understand the human mind and\/or facilitate the development of models capable of operating as intelligent teammates, adversaries, or coaches, and cognitive performance prediction systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Personalized Learning"
                                    },
                                    "Description": {
                                        "val": "Research enhances distributed mission operations (DMO) and live virtual constructive (LVC) environments and identifies technology requirements for training in live and immersive environments. Continuous learning strategies improve mission training, command and control (C2), intelligence, surveillance and reconnaissance (ISR), and cyber missions.\n\nIn FY 2021, this effort is renamed from Continuous Learning to Personalized Learning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.705"
                                            },
                                            "Text": {
                                                "val": "Initiate validation of objective performance metrics in operationally relevant testbeds. Mature personalized learning technologies. Begin training scenario development and simulated mission rehearsals with focus on contested and degraded operational environments. Execute integrated multi-domain training evaluations to assess modeling and simulation capabilities and limitations. Begin studies to evaluate an optimized mix of live, synthetic, and blended training technologies and architecture standards to determine standards for proficiency based training and readiness assessments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.309"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.309"
                                            },
                                            "Text": {
                                                "val": "Continue to mature emerging technologies for the Readiness Product Line by advancing proficiency-based training through persistent, high resolution human and system measurement and secure multi-classification-level training integration. Balance the applied research portfolio with exploratory research in novel methods for adaptive, multi-objective instruction and interactive task learning, as well as the development of quantitative measures to estimate uncertainty in proficiency measurement and prediction."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $0.604 million.  Funding increased due to civilian pay reprice adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cognitive Modeling"
                                    },
                                    "Description": {
                                        "val": "Research explores application of mathematical and computational modeling to understand the human mind and factors that will enhance or degrade cognitive performance. Simulations of training in mission-relevant environments (e.g., flight simulators, multi-domain operations) will optimize learning strategies during training to increase\/accelerate mission readiness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.665"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.790"
                                            },
                                            "Text": {
                                                "val": "Initiate research to extend fatigue models to unmanned aerial vehicles (UAV) and special operations. Begin research to generalize model-based mission planning capabilities to multi-domain command & control (C2) operational planning. Demonstrate multiscale models for real-time cognitive load estimation and prediction in operationally relevant environments. Demonstrate predictive models of toxin-induced cognitive and performance decrements in a laboratory environment. Mature trainable agent research to integrate machine learning to acquire knowledge from operational data. Transition retention-based scheduling system for training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.297"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.297"
                                            },
                                            "Text": {
                                                "val": "Continuing research and development toward the maturation of emerging technologies for Readiness and Sensing & Assessment production lines. Initiating maturation of models of physiology with computational cognitive models to predict cognitive performance under low-oxygen and chemical exposure conditions. Continue maturation of framework for rapidly developing high-fidelity representations of human cognitive behavior and performance. Continue research and development of high-cognitive-fidelity models capable of broader social interactions within Air Force relevant environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $0.493 million.  Funding decreased due to civilian pay reprice adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "None"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625328"
                    },
                    "ProjectTitle": {
                        "val": "Human Dynamics Evaluation"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "28.820"
                        },
                        "CurrentYear": {
                            "val": "51.449"
                        },
                        "BudgetYearOne": {
                            "val": "27.941"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.941"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "28.549"
                        },
                        "BudgetYearThree": {
                            "val": "27.268"
                        },
                        "BudgetYearFour": {
                            "val": "27.877"
                        },
                        "BudgetYearFive": {
                            "val": "28.307"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops technologies to sense, assess, and augment Airman physical and cognitive performance by conducting biological\/bioengineering research focused in the areas of 1) cognitive science, 2) systems biology and performance, and 3) molecular sensing and physiology. Cognitive sciences develops and validates assessments of current and predicted cognitive states combined with personalized cognitive performance enhancement techniques and incorporation of technologies to augment these states. Systems biology and performance integrates the full spectrum of biosciences to discover the underlying mechanisms of airman performance. Molecular sensing and physiology will utilize real-time non-invasive physiological and environmental monitoring to assess the biological state of the airman for the purposes of maintaining and enhancing airman performance.  Project also conducts research to predict physiological impacts of extreme, dynamic aerospace environments on aircrew safety, and performance."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase - Warfighter physiology program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "1.469"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally directed efforts"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "Not Applicable"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Increase - Hypoxia research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.811"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally directed efforts"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "Not Applicable"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Future AF Capabilities Applied Research"
                                    },
                                    "Description": {
                                        "val": "Investigate, design, and develop science and technologies supporting future Air Force capabilities to provide compelling advantage to the warfighter.  To the greatest extent practical, research efforts will utilize modeling and simulation and cross-discipline systems integration (For example:  air and space vehicles, avionics, propulsion, materials, human performance, cybersecurity, command, control, communications, computer and intelligence, sensors, electronic warfare, and conventional\/unconventional weapons).\n\nThe National Defense Strategy and Air Force Science and Technology (S&T) Strategy will inform investments over the FYDP.\n\nIn FY 2019, this work was performed under multiple projects and efforts within the following Air Force S&T Programs: 0602102F, Materials; 0602201F, Aerospace Vehicle Technologies; 0602202F, Human Effectiveness Applied Research; 0602203F, Aerospace Propulsion; 0602204F, Aerospace Sensors; 1206601F, Space Technology; 0602602F, Conventional Munitions; 0602605F, Directed Energy Technology; and 0602788F, Dominant Information Science and Methods."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.666"
                                            },
                                            "Text": {
                                                "val": "Investigate and mature science and technology that enables future warfighting concepts to provide leap-ahead capabilities.  The National Defense Strategy and Air Force S&T Strategy focus this science and technology toward, but not limited to, the following capabilities: 1) global persistent awareness; 2) resilient information sharing; 3) rapid, effective decision-making; 4) complexity, unpredictability, and mass; and 5) speed and reach of disruption and lethality."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2021, this work is performed in PE 0602020F, Future AF Capabilities Applied Research, Project 620200, Enterprise Transformational Applied Research, Transformational Capability Incubator effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $19.666 million. Funding decreased due to realignment and consolidation of Future AF Capabilities Applied Research effort to PE 0602020F, Future AF Capabilities Applied Research, Project 620200, Enterprise Transformational Applied Research, Transformational Capability Incubator effort, to better align with the Air Force S&T Strategy SECAF April 2019 and provide Congress with increased transparency on transformational Air Force S&T activities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Analyst Augmentation"
                                    },
                                    "Description": {
                                        "val": "Conduct research to enhance human components of intelligence, surveillance and reconnaissance (ISR).  Develop ability to improve human analytic efficiency and effectiveness with fewer personnel and in increasingly complex mission space.  Develop the ability to improve human cognitive performance of the ISR weapon system through improved data exploitation and intelligence content synthesis. Conduct research to optimize multi-domain ISR airman performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.377"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.691"
                                            },
                                            "Text": {
                                                "val": "Develop fundamental design principles and theories in human-machine teaming, human performance, psychological processes, and physiological indicators focused on system analytics and multi-domain integrated concepts. Design and envision capabilities to improve analytic insight and reasoning, and integrated multi-domain planning and execution. Integrate threat detection, characterization, and tracking algorithms into human-machine teaming systems to improve decision making for multi-domain operational planners. Develop robust and dynamic synthetic intelligence mission data to stimulate, evaluate, and validate software tools for multi-domain operational planners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, Human Analyst Augmentation work will be performed under the System Analytics effort and the Collaborative Interfaces and Teaming effort in Project 625329, Sensory Evaluation and Decision Science."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $9.691 million. Funding decreased due to realignment of Human Analyst Augmentation research to the System Analytics effort under Project 625329, Sensory Evaluation and Decision Science."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Trust and Interaction"
                                    },
                                    "Description": {
                                        "val": "Conduct research in cross-cultural communication and automated speech translation tools for Air Force missions.  Conduct research to address important aspects of trust in airman-machine teams including investigating how an airman knows an autonomous or semiautonomous system is safe to use and whether the system, data, conclusions, and decision recommendations can be trusted."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.306"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.784"
                                            },
                                            "Text": {
                                                "val": "Advance and mature human machine teaming trust and transparency standards to semi-autonomous and autonomous applications. Investigate extending translation and natural language processing research to multimedia information extraction."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, Human Trust and Interaction work will be transferred to the System Analytics effort in Project 625329, Sensory Evaluation and Decision Science."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $8.784 million. Funding decreased due to the realignment of Human Trust and Interaction research to the System Analytics effort under Project 625329, Sensory Evaluation and Decision Science."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Molecular Sensing and Physiology"
                                    },
                                    "Description": {
                                        "val": "Provides advanced science and technology solutions for the characterization and exploitation of novel molecular biosignatures attributed to physiological stress and utilizing these biosignatures to sense and assess the physiological state of airmen within their associated operational environments.  Goal of this research is to sustain and\/or augment airmen performance and alert the airmen and their commanders when they are trending toward sub-optimal performance so that intervention strategies can be implemented to restore mission effectiveness.\n\nIn FY 2021, the effort is renamed from Human Signatures to Molecular Sensing and Physiology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.857"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.091"
                                            },
                                            "Text": {
                                                "val": "Develop methodologies for air quality and physiological monitoring of personnel using machine learning techniques.  Continue to develop algorithms to characterize human detections from air based sensors.  Research and develop sensors that detect volatile organic compounds and novel biomarkers to determine Airman readiness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.675"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.675"
                                            },
                                            "Text": {
                                                "val": "Research biological recognition elements (BRE) for biosignature detection.  Investigate new biosignatures in non-invasive biofluids.  Develop reliable, wearable sensors for near real-time detection in non-invasive physiological fluids and sensors for hydration monitoring in Air Force environments.  Evaluate and down select sensors for an aircrew fatigue management system."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $0.584 million. Funding increased due to civilian pay reprice adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Systems Biology and Performance"
                                    },
                                    "Description": {
                                        "val": "Investigates the underlying molecular-biological mechanisms contributing to airman physiological and cognitive performance optimization.  Provide airman protection from performance degradation and\/or enhance performance capability under demanding training and mission activities through molecular bioscience research.\n\nIn FY 2019 and prior, this work is performed under the Molecular Bioeffects effort in Project 627757, Bioeffects.\n\nIn FY 2021, the effort is renamed from Molecular Bioeffects to Systems Biology and Performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.217"
                                            },
                                            "Text": {
                                                "val": "Study the unknown physiological events occurring in pilots using omics technology (i.e., genomics, proteomics, and metabolmics) to predict Airman physical and cognitive states in that operational environment. Refine the development of an Air Force specific in vitro screen to enable rapid and accurate assessment of potentially toxic chemicals and materials including nanoparticles. Identify a potential safe and effective fatigue counter measures to improve Airmen performance in physically or mentally intensive operational environment. Conduct studies to predict how networks that form the whole of living organisms will change over time and under varying operationally relevant conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.165"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.165"
                                            },
                                            "Text": {
                                                "val": "Apply biotechnology to investigate methods for engineering the microbiome for enhancing airman performance.  Explore synthetic biology techniques to enable performance modification and resiliency.  Develop mathematical models to predict system biology system biology performance.  Develop advanced organ and tissue human models for mechanistic assessments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $0.052 million. Funding decreased due to civilian pay reprice adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cognitive Neuroscience"
                                    },
                                    "Description": {
                                        "val": "Conduct research to develop and validate assessments of current and predicted cognitive states, enabling the development of personalized cognitive performance enhancements (e.g., neuromodulation, nutrition, physiological training, recovery approaches), supported by a foundational understanding of neurological mechanisms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2020 and prior, Cognitive Neuroscience work is performed under the Applied Neuroscience effort in Project 625329, Sensory Evaluation and Decision Science."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.902"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.902"
                                            },
                                            "Text": {
                                                "val": "Refine neuromodulation animal models for use in predicting human cognitive performance to include molecular predictors.  Integrate inclusion of stress models on cognitive performance.  Validate transcranial Direct Current Stimulation (tDCS) in operational environments and contexts.  Expand Signature Tracking for Optimized Nutrition and Training (STRONG) Laboratory research to outside units for assessing program effectiveness.  Complete a flexible domain package of cognitive workload assessment.  Continue to develop algorithms for faster, predictable decision making capabilities.  Initiate exploration of brain-machine interface research to enhance human state assessment, decision making, and trust.  Explore use of bioinformatics to predict changes in cognitive neuroscience.  Deliver enhanced lumbar spinal injury criteria and advance spinal injury prediction.  Continue development of Multi-Axis Neck Injury Criteria (MANIC) model neck injury criteria transfer functions.  Continue development of 5th and 95th percentile computational human ejection models to include expanded aircrew populations.  Conduct current trainer aircraft on-board oxygen generation system (OBOGS) test & evaluations.  Begin other fighter and new trainer aircraft OBOGS test & evaluation.  Finalize and integrate innovative single\/dual-breathing machine simulator development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $6.902 million. Funding increased due to realignment of Cognitive Neuroscience research from the Applied Neuroscience effort in Project 625329, Sensory Evaluation and Decision Science, to this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircrew Biodynamics and Protection"
                                    },
                                    "Description": {
                                        "val": "Conduct research to predict physiological impacts of extreme, dynamic aerospace environments (e.g., aircrew ejection, high altitude, high-G flight) on aircrew safety and performance.  Research and develop novel innovative protective and safety devices related to aircraft ejection systems and flight safety equipment.  Assess existing Air Force and Department of Defense safety standards and criteria for neck\/spinal injury.  Research performance of on-board oxygen generation systems (OBOGS) and implications on human physiology for current and next-generation aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2020 and prior years, Aircrew Biodynamics and Protection work is performed under the Applied Neuroscience effort in Project 625329, Sensory Evaluation and Decision Science."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.199"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.199"
                                            },
                                            "Text": {
                                                "val": "Deliver enhanced lumbar spinal injury criteria and advance spinal injury prediction.  Continue development of Multi-Axis Neck Injury Criteria model neck injury criteria transfer functions.  Continue development of 5th and 95th percentile computational human ejection models to include expanded aircrew populations.  Conduct current trainer aircraft OBOGS test & evaluations.  Begin other fighter and new trainer aircraft OBOGS test & evaluation.  Finalize and integrate innovative single\/dual-breathing machine simulator development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $7.199 million. Funding increased due to realignment of Aircrew Biodynamics and Protection research from Project 625329, Sensory Evaluation and Decision Science, Applied Neuroscience effort, to this effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625329"
                    },
                    "ProjectTitle": {
                        "val": "Sensory Evaluation and Decision Science"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "28.972"
                        },
                        "CurrentYear": {
                            "val": "33.726"
                        },
                        "BudgetYearOne": {
                            "val": "37.547"
                        },
                        "BudgetYearOneBase": {
                            "val": "37.547"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "38.862"
                        },
                        "BudgetYearThree": {
                            "val": "38.308"
                        },
                        "BudgetYearFour": {
                            "val": "38.914"
                        },
                        "BudgetYearFive": {
                            "val": "39.873"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts the discovery, development, and transition advanced interface technology, decision aiding tools, and situationally-adaptive augmentation methods to seamlessly integrate Airmen and intelligent machines into maximally collaborative warfighting teams.  Advanced technologies will enhance how Airmen fight, via improved team interactions and adaptive information throughput.  Airman-Machine interaction design is critical for achieving mission success and maintaining meaningful human control in highly complex, uncertain, and rapidly evolving environments."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program increase - Advanced technology development"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "Not applicable"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally directed efforts"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Neuroscience"
                                    },
                                    "Description": {
                                        "val": "Develop technologies to enhance Airman performance and Airman-machine collaboration in high-stress decision-making environments. Conduct research to predict physiological impacts of extreme, dynamic environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.108"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.211"
                                            },
                                            "Text": {
                                                "val": "Validate sensing and assessment technologies\/capabilities for sustained and enhanced Airman performance. Support the development of non-invasive off-body sensors for sensing biological and physiological indices of human performance. Continue to explore the utility of non-invasive peripheral nerve stimulation and other neuromodulation techniques to enhance cognitive performance. Identify the biological and physiological markers that predict enhanced cognitive performance in multiple field environments and under various stressors such as fatigue, high exertion, and oxygen deprived environments. Conduct bioinformatics studies on longitudinal data sets to inform cognitive performance augmentation strategies and refine customer decision tools. Research the novel biological and physical effects and safety implications of current and next-generation ejection seats and intense kinetic-energy scenarios involving human safety, to include the modeling & simulation of these effects on the human. Research the breathing and oxygenation systems for aircraft, investigate potential molecular and physiological sensing tools and techniques to ensure warfighter air quality safety and performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, Applied Neuroscience work will performed under the Cognitive Neuroscience effort and the Aircrew Biodynamics and Protection effort in Project 625328, Human Dynamics Evaluation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $14.211 million. Funding decreased due to the realignment of Applied Neuroscience research to the Cognitive Neuroscience effort and the Aircrew Biodynamics and Protection effort under Project 625328, Human Dynamics Evaluation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collaborative Interfaces and Teaming"
                                    },
                                    "Description": {
                                        "val": "Research new Human-Machine Teaming (HMT) technologies and concepts (e.g., information portrayal, control devices, decision aiding algorithms and adaptive agents) for effective human-machine interaction and teamwork.\n\nIn FY 2021, this effort is renamed from Human Role in Semiautonomous Systems to Collaborative Interfaces and Teaming."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.924"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.019"
                                            },
                                            "Text": {
                                                "val": "Examine novel HMT concepts and metrics in moderate-fidelity laboratory environments characterized by high-consequence, high-uncertainty missions. Examine the impact of novel HMT concepts, interfaces and agents on workload, shared situation awareness, performance, and trust using realistic laboratory environments which parallel operational challenges derived from Air Force operations, specifically focused on Multi-Domain Command & Control (MDC2)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.259"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.259"
                                            },
                                            "Text": {
                                                "val": "Execute the following: research on swift trust development and effective teaming methods between human operators in an MDC2 context; research on trust in software code; experiments to test visualizations and displays using HMT simulations, research and experimentation focused on HMT and collaborative interface design among mixed human-human and human-machine teams; research on intelligent agent development and testing; conduct research focused on development of software architectures and platforms to enable HMT for pilot-vehicle interfaces, Unmanned Aerial System (UAS) teaming, and Air Battle Management."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increase compared to FY 2020 by $4.240 million. Funding increased due to realignment of HMT research from the Human Analyst Augmentation effort under Project 625328, Human Dynamics Evaluation, to this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Visualization"
                                    },
                                    "Description": {
                                        "val": "Research the visualization, interaction and understanding of complex information to enhance warfighter decision making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.568"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.244"
                                            },
                                            "Text": {
                                                "val": "Select and evaluate analytic strategies with machine learning techniques to achieve next-generation, automated, data exploitation capability, and develop visual interfaces to enhance task performance and decision making. Develop and evaluate integration and tailoring of Explainable Artificial Intelligence (XAI) analytic methods with analytic visual interfaces. Continue data analytics research focused on human visualization of complex data. Test and modify multi-domain operator system interfaces for integrated defensive and offensive operations. Transition model of predicted visibility of objects viewed by humans under both unaided and aided conditions and develop multi-modal model integration. Test and evaluate visualizations of events and their influence on objectives and courses of action for C2 environments across the air, space and cyberspace domains. Conduct multi-sensory research and develop concepts for seamlessly integrating multiple interaction modes, such as visual, auditory, vestibular, and tactile, into integrated work aids."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, Battlespace Visualization work will be performed under the Multisensory Perceptions and Communication effort within this Project."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $7.224 million. Funding decreased due to realignment of Battlespace Visualization research to the Multisensory Perceptions and Communication effort within Project 625329, Sensory Evaluation and Decision Science."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Acoustics"
                                    },
                                    "Description": {
                                        "val": "Conducts research on advanced auditory and communication technologies that mitigate effects of noise and enhance performance in operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.372"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.252"
                                            },
                                            "Text": {
                                                "val": "Conduct research on single sensor perception and multisensory interactions, focusing on multisensory integration and facilitation, as well as multisensory conflict for issues such as spatial disorientation.  Determine optimal approaches for information presentation and communication management, incorporating both performance and preference metrics for enhanced decision making.  Conduct research on speech identification and production, and develop interfaces and techniques to support effective human-human and human-machine communication. Evaluate emerging hearing enhancement and protection technologies to provide design guidelines for capabilities supporting future operations. Continue to enhance and refine models of acoustic detection for special operations aviation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, Battlespace Acoustics work will be performed under the the Multisensory Perceptions and Communication effort within this Project."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $3.252 million. Funding decreased due to realignment of Battlespace Acoustics research to the Multisensory Perceptions and Communication effort under Project 625329, Sensory Evaluation and Decision Science."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multisensory Perceptions and Communication"
                                    },
                                    "Description": {
                                        "val": "Multisensory Perception and Communication focuses on identifying and exploiting the underlying sensory and cognitive mechanisms mediating human perception and communication in order to inform the development of multimodal interfaces and speech\/language technologies. Research will examine sensory processing, multisensory integration, and human communication processes in simple and complex environments to identify the barriers to effective information transmission and inform the development of technologies to overcome, or exploit, those barriers in order to enhance Airmen performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2020 and prior years, Multisensory Perceptions and Communication work is performed under Battlefield Visualization effort and Battlefield Acoustics effort within this Project."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.121"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.121"
                                            },
                                            "Text": {
                                                "val": "Initiate research examining impact of communication interruption on task performance and develop a prototype real-time system; Plan study examining relative contribution of vocabulary and language rhythms and sounds on human interruption strategies; Initiate new behavioral\/neurophysiological studies of multisensory perception and multimodal display research; Initiate program on multimodal contribution to automatic speech recognition and machine translation; Initiate lab experiments on perceptual jamming; Continue experiments on speech perception in complex environments; Plan new research in spatial attention monitoring; Measure and model acoustic signatures for aircraft and operational environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $14.121 million. Funding increased due to consolidation of Battlefield research from the Battlefield Visualization effort and Battlefield Acoustics effort within Project 625329, Sensory Evaluation and Decision Science, to this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System Analytics"
                                    },
                                    "Description": {
                                        "val": "System Analytics studies the macro-cognition of the Airman using computational tools to accomplish mission objectives, encompassing interactions between operators, analytics, and environment. The goal of this research area is to describe, assess, and design for effective integration of analytics into mission systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2020 and prior years, System Analytics work is performed under the Human Analyst Augmentation effort and the Human Trust and Interaction effort in Project 625328, Human Dynamics Evaluation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.167"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.167"
                                            },
                                            "Text": {
                                                "val": "Leverage ongoing research investments to: develop analytics that bring structure, meaning, and context to mission data in order to build representations to support warfighter mission systems; assess the benefits and costs of integrated data analytics by quantifying how analytics alter thinking and reasoning in order to promote effective decision making. Key research lines include assessment of analytics for full motion video, data visualization for dynamic wide area monitoring, and development of analytics to improve analytic insight and reasoning during exploitation of multiple data sources."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $13.167 million. Funding increased due to realignment of the System Analytics research from the Human Analyst Augmentation effort and the Human Trust and Interaction effort under Project 625328, Human Dynamics Evaluation, to this effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "627757"
                    },
                    "ProjectTitle": {
                        "val": "Bioeffects"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "31.141"
                        },
                        "CurrentYear": {
                            "val": "27.125"
                        },
                        "BudgetYearOne": {
                            "val": "27.128"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.128"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "28.951"
                        },
                        "BudgetYearThree": {
                            "val": "28.056"
                        },
                        "BudgetYearFour": {
                            "val": "29.325"
                        },
                        "BudgetYearFive": {
                            "val": "29.959"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research on the effects of human exposure to electromagnetic (EM) energy (direct current (DC) to radio frequency (RF) to optical), scalable directed energy weapons, and non-lethal weapons. This research addresses fundamental physical principles, as well as the biophysical interaction between directed energy and the individual or groups of individuals. Research is divided into two core focus areas: novel directed energy bioeffects and mechanisms and directed energy modeling, simulation, and analysis. The research enhances combat survivability and systems effectiveness through technologies that enable deployed forces to counter optical threats and exploit optical systems for offensive applications. In addition, basic biological investigations into the mechanisms associated with high peak power and high average power RF exposure allow for the exploitation of directed energy systems for offensive capabilities while protecting the warfighter from adversarial use of RF technologies. The novel directed energy bioeffects mechanisms research examines the physical, physiological, and neural interactions of EM with tissues to understand dose-response effects as well as reveal the means to cause or prevent a specific effect.  The directed energy modeling, simulation, and analysis research is focused on new software components that represent and optimize concepts of directed energy system employment from the Airman standpoint.  These components are matured for future transition and application for engagement-to-mission level simulations in which directed energy weapons are employed."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Optical Radiation Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research on laser bioeffects, enabling military exploitation of laser technology while providing countermeasures for optical hazards\/threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.347"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.316"
                                            },
                                            "Text": {
                                                "val": "Initiate validation and verification experiments for 3-dimensional tissue models of laser exposures. Complete studies of alternate laser wavelength bioeffects for use in high-energy lasers and the assessment of relative hazards. Transition model for probabilistic evaluation of risks from laser exposures on Air Force and Department of Defense laser ranges. Advance dose-response models to include severe retinal and skin optical radiation exposures. Develop metrics for the influence of optical distortion in evaluating developing eye protection technology. Mature models for combining separate images of same retinal or skin area into one image with higher fidelity of injury."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, Optical Radiation Bioeffects work will be transferred to the Novel Directed Energy Bioeffects and Mechanisms effort and the Directed Energy Bioeffects Modeling, Simulation and Analysis effort under Project 627757, Bioeffects."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $15.316 million. Funding decreased due to realignment of this research to the Novel Directed Energy Bioeffects and Mechanisms effort and the Directed Energy Bioeffects Modeling, Simulation and Analysis effort under Project 627757, Bioeffects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research to enable safe exploitation of directed energy technologies for communication, target identification, and weapons development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.973"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.809"
                                            },
                                            "Text": {
                                                "val": "Conduct in vivo measurement of high average power exposures and high peak power microwave exposures to identify and baseline novel bioeffects. Build thermo-acoustic dosimetry techniques for in vivo assessment of high power sources including radio frequency (RF) acoustics. Determine acute and chronic bioeffects from emerging sources such as particle beam.  Expand in vivo molecular signature of RF exposure to assess acute and chronic bioeffects of RF to inform exposure scenarios."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, Radio Frequency Bioeffects work will be transferred to the Novel Directed Energy Bioeffects and Mechanisms effort and the Directed Energy Bioeffects Modeling, Simulation and Analysis effort under Project 627757, Bioeffects."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $11.809 million.  Funding decreased due to the realignment of this research to the Novel Directed Energy Bioeffects and Mechanisms effort and the Directed Energy Bioeffects Modeling, Simulation and Analysis effort under Project 627757, Bioeffects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Novel Directed Energy Bioeffects and Mechanisms"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments to provide fundamental knowledge of mechanisms of interaction of directed energy (DE) with molecules, cells, tissues, organs, and whole organisms in support of military DE systems.  Conduct laboratory experiments to understand the mechanistic and behavioral effects of novel weapon incidents to the Airman and to understand the effects of protection strategies on Airman performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2020 and prior years, Novel Directed Energy Bioeffects and Mechanisms work is performed under the Optical Radiation Bioeffects effort and the Radio Frequency Bioeffects effort under Project 627757, Bioeffects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.818"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.818"
                                            },
                                            "Text": {
                                                "val": "Complete bioeffects studies of potential future use laser wavelengths for use in high-energy lasers and the assessment of relative hazards. Develop metrics for the influence of optical distortion in evaluating developing eye protection technology. Conduct studies to understand use of laser eye protection on Airman performance.  Conduct in vivo measurement of high average power exposures and high peak power microwave exposures to identify and baseline novel bioeffects. Build thermo-acoustic dosimetry techniques for in vivo assessment of high power sources including radio frequency (RF) thermal elastic expansion. Determine acute and chronic bioeffects from emerging sources. Expand in vivo molecular signature of RF exposure to assess acute and chronic bioeffects of RF to inform exposure scenarios."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $9.818 million. Funding increased due to realignment of Novel Directed Energy Bioeffects and Mechanism activities from the Optical Radiation Bioeffects effort and the Radio Frequency Bioeffects effort under Project 627757, Bioeffects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy Bioeffects Modeling, Simulation and Analysis"
                                    },
                                    "Description": {
                                        "val": "Conduct physics-level modeling and simulations to represent and optimize directed energy bioeffects to include direct, scalable, and collateral effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2020 and prior years, Directed Energy Bioeffects Modeling, Simulation and Analysis work is performed under the Optical Radiation Bioeffects effort and the Radio Frequency Bioeffects effort under Project 627757, Bioeffects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.310"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.310"
                                            },
                                            "Text": {
                                                "val": "Initiate validation and verification experiments for 3-dimensional tissue models of laser exposures. Transition model for probabilistic evaluation of risks from laser exposures on Air Force and Department of Defense laser ranges.  Advance dose-response models to include severe retinal and skin optical radiation and radio frequency exposures. Mature models for combining separate images of same retinal or skin area into one image with higher fidelity of injury."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $17.310 million. Funding increased due to the realignment of Directed Energy Bioeffects Modeling and Simulation activities from the Optical Radiation Bioeffects effort and the Radio Frequency Bioeffects effort under Project 627757, Bioeffects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Molecular Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Protect airman from toxic chemicals and materials and enhance performance capability under demanding training and mission activities through molecular bioscience research.  Investigate the underlying molecular-biological mechanisms contributing to airman physical and cognitive performance optimization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.821"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, this work will be performed under the Systems Biology and Performance effort (formerly known as the Molecular Bioeffects effort) under Project 625328, Human Dynamics Evaluation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not Applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Not Applicable"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}