{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-74",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605151D8Z"
        },
        "ProgramElementTitle": {
            "val": "Studies and Analysis Support – OSD"
        },
        "R1LineNumber": {
            "val": "156"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "24.752"
            },
            "PriorYear": {
                "val": "3.423"
            },
            "CurrentYear": {
                "val": "4.759"
            },
            "BudgetYearOne": {
                "val": "5.777"
            },
            "BudgetYearOneBase": {
                "val": "5.777"
            },
            "BudgetYearTwo": {
                "val": "5.163"
            },
            "BudgetYearThree": {
                "val": "5.259"
            },
            "BudgetYearFour": {
                "val": "5.871"
            },
            "BudgetYearFive": {
                "val": "6.104"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Defense-Wide Reviews (DWR) - Funding for Studies and Analysis Support - OSD for FY2021 was reduced by $958 thousand resulting from the DWR which focused on the Secretary's guidance to streamline operations, increase efficiency, and promote greater affordability within the OSD and Defense Agencies and Field Activities in order to ensure the Department's optimum alignment to the National Defense Strategy and DoD strategic guidance, with particular focus on building a more lethal, resilient, agile, and ready force while strengthening alliances, prioritizing cyber and space capabilities, and focusing on innovation to maintain the technological advantage.  The FY2021 reduction is offset by an administrative zero-sum transfer of $2.226 million from A&S."
        },
        "ProgramElementMissionDescription": {
            "val": "The Studies and Analysis Support – OUSD (P&R) serves to leverage specialized expertise and critical capabilities designed to help meet varied research, study, and analytical support needs in the manpower, personnel, human capital, force readiness, training, education, resiliency, and health services portfolio.  This funding supports intellectually rigorous, relevant and timely assessment of policies, programs, and procedures across the personnel and readiness enterprise.  Funded research, studies, program evaluations, surveys, and analysis support P&R roles in executing the National Defense Strategy in a proactive and forward leaning posture, focusing on a strategic programmatic and policy framework for the future. \n\nThis funding is leveraged to addresses key, strategic, and long-term challenges facing the Department, and include targeted assessments to support program evaluation and efficacy; comprehensive research and complex exploration to support data driven decision-making; and critical analysis to develop needed evidentiary bases for policy development or modification."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.534"
                },
                "CurrentYear": {
                    "val": "4.759"
                },
                "BudgetYearOne": {
                    "val": "4.509"
                },
                "BudgetYearOneBase": {
                    "val": "4.509"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.423"
                },
                "CurrentYear": {
                    "val": "4.759"
                },
                "BudgetYearOne": {
                    "val": "5.777"
                },
                "BudgetYearOneBase": {
                    "val": "5.777"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.111"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.268"
                },
                "BudgetYearOneBase": {
                    "val": "1.268"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.001"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.110"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "OSD - USD A&S Reductions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.226"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.226"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense-Wide Review"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.958"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.958"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "151"
                    },
                    "ProjectTitle": {
                        "val": "Studies and Analysis Support – OSD"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "24.752"
                        },
                        "PriorYear": {
                            "val": "3.423"
                        },
                        "CurrentYear": {
                            "val": "4.759"
                        },
                        "BudgetYearOne": {
                            "val": "5.777"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.777"
                        },
                        "BudgetYearTwo": {
                            "val": "5.163"
                        },
                        "BudgetYearThree": {
                            "val": "5.259"
                        },
                        "BudgetYearFour": {
                            "val": "5.871"
                        },
                        "BudgetYearFive": {
                            "val": "6.104"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Studies and Analysis Support – OUSD (P&R) serves to leverage specialized expertise and critical capabilities designed to help meet varied research, study, and analytical support needs in the manpower, personnel, human capital, force readiness, training, education, resiliency, and health services portfolio. .  This funding supports intellectually rigorous, relevant and timely assessment of policies, programs, and procedures across the personnel and readiness enterprise.  Funded research, studies, program evaluations, surveys, and analysis support P&R roles in executing the National Defense Strategy in a proactive and forward leaning posture, focusing on a strategic programmatic and policy framework for the future. \n\nThis funding is leveraged to addresses key, strategic, and long-term challenges facing the Department, and include targeted assessments to support program evaluation and efficacy; comprehensive research and complex exploration to support data driven decision-making; and critical analysis to develop needed evidentiary bases for policy development or modification."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "151 Studies and Analysis Support – OSD"
                                    },
                                    "Description": {
                                        "val": "The Studies and Analysis Support - OUSD (P&R) funds research, program evaluations, surveys and analysis.  It conducts comprehensive, independent, interdisciplinary, intellectually rigorous, relevant and timely research and analysis of policy challenges associated with the sustainment (recruitment, retention, training, education, readiness, lethality, health, and resiliency) of the Total Force necessary to execute and support the National Defense Strategy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.423"
                                            },
                                            "Text": {
                                                "val": "•\tContinue development and refinement of various models to include Environment and Personnel Management, Relationships between Resources and Readiness, and Readiness Pipelines; \n•\tContinue the development of a common framework to improve training of prevention professionals and assess training outcomes for risk and resiliency programs;\n•\tContinue to investigate additional technologies to promote more efficient and effective use of resources, increasing the effectiveness of military training, and enhancing the readiness and performance of the Total Force; and\n•\tRespond to Congressional mandates and directives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.759"
                                            },
                                            "Text": {
                                                "val": "• Conduct comprehensive, independent, interdisciplinary, intellectually rigorous, relevant and timely research and analysis of policy challenges associated with the sustainment (recruitment, retention, training, education, readiness, lethality, health, and resiliency) of the Total Force necessary to execute and support the National Defense Strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.777"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.777"
                                            },
                                            "Text": {
                                                "val": "Conduct research, analysis and complex exploration of policy challenges within the recruitment, retention, training, education, readiness, lethality, health, and resiliency of the Total Force to meet human capital development actions in support of the National Defense Strategy.\n\n• Assessing national trends with respect to the population\n• Conducting assessments of workplace climates and program strategies\n• Understanding best practices for employee engagement\/relevancy\n• Addressing force structure, capability and readiness in evolving warfighter domains\n• Understanding the future of dependent care in the DoD; modernizing our training infrastructure for the future fight\n• Adapting the recruiting\/retention environment for the modern force\n• Challenging cultural norms of force mix\n• Adapting DoD mindset for societal\/economic population changes\n• Understanding future force requirements for urbanization and population shifts\n• Understanding technological impacts on health care delivery."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 funding request was reduced by $958 thousand during the Defense Wide Review to account for contract savings resulting in less funds needed.  OUSD(P&R) has taken significant steps to improve governance of our studies program, increasing senior leader accountability and ensuring more robust return on investment. Funding decrease represents continue refinement in program processes, added rigor and accountability for studies, and increased diversity in and competition of research approaches and methodologies."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}