{
    "id": "2021-Army-PB-2040-JBOOK-2ce7b76ca8f41dbc06183380f90728d4a8e40b9122c9effab5b4a02fdffb364e-11",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605706A"
        },
        "ProgramElementTitle": {
            "val": "Materiel Systems Analysis"
        },
        "R1LineNumber": {
            "val": "197"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "21.043"
            },
            "CurrentYear": {
                "val": "21.342"
            },
            "BudgetYearOne": {
                "val": "21.859"
            },
            "BudgetYearOneBase": {
                "val": "21.859"
            },
            "BudgetYearTwo": {
                "val": "21.824"
            },
            "BudgetYearThree": {
                "val": "21.81"
            },
            "BudgetYearFour": {
                "val": "22.941"
            },
            "BudgetYearFive": {
                "val": "23.384"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "154.203"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) resources the Combat Capabilities Development Command (CCDC) Data and Analysis Center (DAC) to conduct systems and engineering analyses to support Future Force Modernization Enterprise decisions in technology, materiel acquisition, and the design, development, fielding and sustainment of Army materiel systems.  The analysis products funded by this PE are leveraged to support Materiel Acquisition decisions and influence the design, development, and sustainment of Army weapon\/materiel systems in support of the current and future force in the areas of Long Range Precision Fires, Next Generation Combat Vehicles, Future Vehicle Lift, Network\/Command, Control, Communications and Intelligence, Air and Missile Defense, Soldier Lethality and other Army Priority efforts.\n\nAs the Army's center for materiel systems analysis, the CCDC DAC provides the technical capability to support Army and DoD decision makers throughout the entire acquisition process in responding to analytical requirements across the full spectrum of materiel.  The DAC's unique in-house, consistent, integrated analytical capability is a critical asset that provides Army leadership with timely, independent, unbiased, reliable, and high quality analysis to support complex decisions required for Current Operations and the development of the Future Force.  The DAC's integrated set of skills and tools are focused on the highest Army Priorities with a core mission to deliver objective analysis, experimentation, and data across the entire life cycle to ensure Readiness today and a more lethal Future Force tomorrow.  \n\nThis PE develops and certifies system level performance and effectiveness data across a broad range of capabilities such as target acquisition, probability of inflicting catastrophic damage, personnel and vehicle survivability, mobility, network, system reliability, and several additional capability areas used in Army studies.  The PE funds the development of item-level performance methodology, and Models and Simulations (M&S) for the current and future operational environments and emerging threats.  The M&S capabilities support the development, linkage and accreditation of live, virtual, and constructive simulations, and provide unique tools that support systems analysis of individual systems and the combined arms environment.  This M&S infrastructure provides a hierarchical modeling framework that is unique to the DAC and allows for a comprehensive performance and effectiveness analysis and prediction capability that can be utilized to support trade-off and investment decisions prior to extensive and expensive hardware testing of proposed systems\/technologies.  \n\nThis PE funds the Center for Reliability Growth (CRG), to develop critical tools, methodologies, policies, guidance and educational materials required to help acquisition programs achieve required reliability during the acquisition process.  The CRG develops and applies engineering approaches to assess the reliability of Army materiel and provides recommendations on ways to improve reliability, thereby, reducing logistics footprints and life cycle costs, and extending failure-free periods for materiel.  The CRG has developed an integrated set of skills and tools focused on its core competencies to be responsive in delivering objective data and analysis across the entire life cycle to ensure Readiness today and a more lethal future force tomorrow."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.223"
                },
                "CurrentYear": {
                    "val": "21.342"
                },
                "BudgetYearOne": {
                    "val": "21.631"
                },
                "BudgetYearOneBase": {
                    "val": "21.631"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.043"
                },
                "CurrentYear": {
                    "val": "21.342"
                },
                "BudgetYearOne": {
                    "val": "21.859"
                },
                "BudgetYearOneBase": {
                    "val": "21.859"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.18"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0.228"
                },
                "BudgetYearOneBase": {
                    "val": "0.228"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.18"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.228"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.228"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "541"
                    },
                    "ProjectTitle": {
                        "val": "Materiel Sys Analysis"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.043"
                        },
                        "CurrentYear": {
                            "val": "21.342"
                        },
                        "BudgetYearOne": {
                            "val": "21.859"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.859"
                        },
                        "BudgetYearTwo": {
                            "val": "21.824"
                        },
                        "BudgetYearThree": {
                            "val": "21.81"
                        },
                        "BudgetYearFour": {
                            "val": "22.941"
                        },
                        "BudgetYearFive": {
                            "val": "23.384"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "154.203"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) resources the Combat Capabilities Development Command (CCDC) Data and Analysis Center (DAC) to conduct systems and engineering analyses to support Future Force Modernization Enterprise decisions in technology, materiel acquisition, and the design, development, fielding and sustainment of Army materiel systems.  The analysis products funded by this PE are leveraged to support Materiel Acquisition decisions and influence the design, development, and sustainment of Army weapon\/materiel systems in support of the current and future force in the areas of Long Range Precision Fires, Next Generation Combat Vehicles, Future Vehicle Lift, Network\/Command, Control, Communications and Intelligence, Air and Missile Defense, Soldier Lethality and other Army Priority efforts.\n\nAs the Army's center for materiel systems analysis, the CCDC DAC provides the technical capability to support Army and DoD decision makers throughout the entire acquisition process in responding to analytical requirements across the full spectrum of materiel.  The DAC's unique in-house, consistent, integrated analytical capability is a critical asset that provides Army leadership with timely, independent, unbiased, reliable, and high quality analysis to support complex decisions required for Current Operations and the development of the Future Force.  The DAC's integrated set of skills and tools are focused on the highest Army Priorities with a core mission to deliver objective analysis, experimentation, and data across the entire life cycle to ensure Readiness today and a more lethal Future Force tomorrow.  \n\nThis PE develops and certifies system level performance and effectiveness data across a broad range of capabilities such as target acquisition, probability of inflicting catastrophic damage, personnel and vehicle survivability, mobility, network, system reliability, and several additional capability areas used in Army studies.  The PE funds the development of item-level performance methodology, and Models and Simulations (M&S) for the current and future operational environments and emerging threats.  The M&S capabilities support the development, linkage and accreditation of live, virtual, and constructive simulations, and provide unique tools that support systems analysis of individual systems and the combined arms environment.  This M&S infrastructure provides a hierarchical modeling framework that is unique to the DAC and allows for a comprehensive performance and effectiveness analysis and prediction capability that can be utilized to support trade-off and investment decisions prior to extensive and expensive hardware testing of proposed systems\/technologies.  \n\nThis PE funds the Center for Reliability Growth (CRG), to develop critical tools, methodologies, policies, guidance and educational materials required to help acquisition programs achieve required reliability during the acquisition process.  The CRG develops and applies engineering approaches to assess the reliability of Army materiel and provides recommendations on ways to improve reliability, thereby, reducing logistics footprints and life cycle costs, and extending failure-free periods for materiel.  The CRG has developed an integrated set of skills and tools focused on its core competencies to be responsive in delivering objective data and analysis across the entire life cycle to ensure Readiness today and a more lethal future force tomorrow."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Materiel Systems Analysis"
                                    },
                                    "Description": {
                                        "val": "This activity provides for systems and engineering analyses to support the entire Future Force Modernization Enterprise decisions in technology, materiel acquisition, and the design, development, fielding and sustainment of Army materiel systems; the development of system level performance and effectiveness data and item-level performance methodology, and models and simulations; and the development of critical tools, methodologies, policies and guidance as the Center for Reliability Growth to improve reliability, extend failure-free periods, and reduce support costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.041"
                                            },
                                            "Text": {
                                                "val": "The Combat Capabilities Development Command (CCDC) Data and Analysis Center (DAC) provided critical analyses and data to support key Army acquisition milestone decisions and reviews. CCDC DAC supported Army conceptual and developmental Acquisition Category ((ACAT) 1, ACAT 2, ACAT 3, and ACAT 4) programs, including but not limited to: Family of Unmanned Aircraft Systems, Cyberspace Situational Understanding, Enhanced Heavy Equipment Transport System, Big Data Initiatives, and Cyber Electromagnetic Activities (CEMA)\/Electronic Warfare (EW).  CCDC DAC developed and enhanced Cyber, Air & Missile Defense, and life cycle cost analytic capabilities to ensure more robust analysis of potential capabilities to properly equip the Current and Future Force.  Additionally, ensured modeling and simulation readiness by properly updating and sustaining key analytic tools and models.  CCDC DAC supported a variety of trade-space efforts and analyses in support of the Army Secretariat and Staff.  This included directly participating in and providing analytical products for Army Requirements Oversight Councils (AROCs) and Army Systems Acquisition Review Councils (ASARCs) to assist senior leaders in key acquisition strategy and life cycle decisions for a variety of materiel systems\/programs.  CCDC DAC also provided analytical support to modify Test and Evaluation (T&E) planning efforts, reduce testing through the use of modeling and simulation, and provide software analysis and reliability capabilities to support T&E.  CCDC DAC conducted follow-on studies for major Army programs undergoing engineering change proposals and continued to provide essential certified weapons system performance data for all major Army studies. CCDC DAC continued efforts in support of the Army Center for Reliability Growth (CRG).  Moreover, continued to develop and enhance its comprehensive set of system performance data and essential verified and validated item\/system level methodologies, tools, and models and simulations to conduct materiel system performance analysis. This insures accurate and up-to-date analytical products are provided across the full spectrum of Army capability\/commodity areas. Overall, CCDC DAC?s analysis capabilities and products enabled Senior Leaders to properly shape and influence acquisition policy, procedures, and materiel solutions and increased readiness for our Current and Future Force."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.221"
                                            },
                                            "Text": {
                                                "val": "AMSAA will continue to provide critical analyses and data to support key Army acquisition milestone decisions and reviews. AMSAA will continue to provide critical analytical support to the Army Cross Functional Teams (CFT), and to support Army conceptual and developmental all Acquisition Category programs including but not limited to: Family of Unmanned Aircraft Systems, Cyberspace Situational Understanding, Future Vertical Lift, Optionally Manned Fighting Vehicle, Future M1 Replacement, Big Data Initiatives, and Cyber Electromagnetic Activities\/Electronic Warfare. AMSAA will further develop and enhance Cyber, Air and Missile Defense, and life cycle cost analytic capabilities to ensure more robust analysis of potential capabilities to properly equip the Current and Future Force. Additionally, AMSAA will ensure modeling and simulation readiness by properly updating and sustaining key analytic tools and models.  AMSAA will continue to support a variety of trade-space efforts and analyses in support of the Army Secretariat and Staff. AMSAA will also provide analytical support to modify Test and Evaluation (T&E) planning efforts, reduce testing through the use of modeling and simulation, and provide software analysis and reliability capabilities to support T&E. AMSAA will conduct follow-on studies for major Army programs undergoing engineering change proposals and continue to provide essential certified weapons system performance data for all major Army studies. AMSAAs technical work program relating to Analysis of Alternatives (AoA?s) (providing analytic input and certified data, as well as leading specified AoA?s), providing direct analytical support to the CFT?s, Business Case Analyses, and Cost Benefit Analyses and Risk Assessments will continue at a high level (similar to fiscal year (FY) 2018 and FY2019). AMSAA will continue efforts in support of the Army Center for Reliability Growth, as well as efforts on current operations related tasks, analyses, and model enhancements. Moreover, AMSAA will continue to develop and enhance its comprehensive set of system performance data and essential verified and validated item\/system level methodologies, tools, and models and simulations to conduct materiel system performance analysis. This will insure accurate and up-to-date analytical products are provided across the full spectrum of Army capability\/ commodity areas. Overall, AMSAA?s analysis capabilities and products will enable Senior Leaders to properly shape and influence acquisition policy, procedures, and materiel solutions and increase readiness for our Current and Future Force. AMSAA?s inclusion as one of the central members of the Futures and Modernization Analysis Center (FMAC)\/Army Futures Command (AFC) illustrates the critical contributions the organization has and continues to make in supporting Acquisition Modernization decisions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.859"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.859"
                                            },
                                            "Text": {
                                                "val": "Will continue to conduct materiel systems analysis through the development and enhancement of comprehensive sets of system performance data and essential verified and validated item\/system level methodologies, tools, and models and simulations.  Will continue to provide analytical support to Test and Evaluation (T&E) planning, to reduce testing through the use of modeling and simulation, and to provide software analysis and reliability capabilities to support T&E.  Will conduct follow-on studies for major Army programs undergoing engineering change proposals and continue to provide essential certified weapons system performance data for all major Army studies.  Will continue to provide critical tools, policies and educational materials as the Army?s Center for Reliability Growth to improve system reliability throughout the acquisition process.  Will continue to provide extensive analytical support to the Cross Functional Teams (CFTs) to include Analysis of Alternatives (AoA's), system cost\/performance tradeoffs, early technology trade-offs, weapons\/systems mix analyses, system Technical and Schedule risk assessments, business case analyses, cost benefit analyses, requirements analyses, technology insertion studies, reliability growth studies, and Physics of Failure (PoF) analyses.  Will conduct systems analysis and assessments in support of multiple efforts including Mobile-Short-Range Air Defense (M-SHORAD), Future Vehicle Lift (FVL), Assured-Positioning, Navigation and Timing (A-PNT), Network, Next Generation Combat Vehicle Quarterback, Directed Energy systems, Autonomous Vehicles, Artificial Intelligence, Multi-Domain Operations, Active Protection Systems, and Electronic Warfare, and Army Futures Command\/Combat Capabilities Development Command?s highest priority platforms, technologies and weapon systems.  For systems analyzed, will provide relevant data and results to materiel developers and senior decision makers to support acquisition decisions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to economic adjustments"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.002"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC  638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.121"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC  638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC  638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}