{
    "id": "2021-Navy-PB-1319-JBOOK-d3ab3c0a6cb9df0d0509de933fffca7d6b64566762da9a9a7f31134e06ec3a05-48",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_JustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305242M"
        },
        "ProgramElementTitle": {
            "val": "(U)Unmanned Aerial Systems (UAS) Payloads"
        },
        "R1LineNumber": {
            "val": "250"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "5.956"
            },
            "CurrentYear": {
                "val": "10.004"
            },
            "BudgetYearOne": {
                "val": "5.000"
            },
            "BudgetYearOneBase": {
                "val": "5.000"
            },
            "BudgetYearTwo": {
                "val": "2.320"
            },
            "BudgetYearThree": {
                "val": "1.338"
            },
            "BudgetYearFour": {
                "val": "7.197"
            },
            "BudgetYearFive": {
                "val": "7.676"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Unmanned Aerial System (UAS) Payload Program will provide an agile and responsive means to integrate and support the development and fielding of Strategic and Tactical Intelligence, Surveillance, and Reconnaissance (ISR) and non-ISR capabilities as well as data Processing, Exploitation, and Dissemination (PED) and Communication capabilities for all UAS's within the Navy and Marine Corps. These component, sensor, and PED capabilities will alleviate Navy and Marine Corps ISR mission needs and gaps caused by rapidly changing missions, environments, threats, and technologies as well as enhance the effectiveness and operational utility of the UAS. \n\nThe UAS Payload program element will increase the effectiveness and versatility of the Navy and Marine Corps UAS. The UAS Payload program element is to encompass future and as yet unspecified unmanned system technology integration and improvements such as GPS denied environment survey and solutions related to Position, Navigation and Timing (PNT). Additional payload capability improvements and expansion include Communication, Automation and Autonomy, Magnetic Anomaly Detection (MAD), Chemical, Biological, and Radiological\/Nuclear (CBRN) collection, Gravitational Sensing, Signals Intelligence Collection (SIGINT), Electronic Warfare Support (EW and ES), Radar Imagery, Moving Target Indicator (MTI) Detection, Tracking and Imagery, Wide Area and Hyperspectral Imagery collection, Artificial Intelligence (AI)processing, Combined Multiple Intelligence (Multi-INT), Light Detection and Ranging (LiDAR), Laser Marking and Designation (LM, LD), Acoustic Detection, Sense and Avoid, Identification of Friend or Foe (IFF), Weapons Integration, capability related PED, and Multi Mission functionality. These advanced capabilities and payloads will provide the Navy Fleet Forces, Marine Air-Ground Task Force (MAGTF) Marine Expeditionary Units (MEU) and Marine Expeditionary Forces (MEF) and their component subordinate commands (divisions and regiments) with dedicated, organic capabilities that facilitate the six functions of Marine Corps Aviation and the Marine Corps ISR Enterprise (MCISRE) across the range of military operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.956"
                },
                "CurrentYear": {
                    "val": "3.704"
                },
                "BudgetYearOne": {
                    "val": "6.044"
                },
                "BudgetYearOneBase": {
                    "val": "6.044"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.956"
                },
                "CurrentYear": {
                    "val": "10.004"
                },
                "BudgetYearOne": {
                    "val": "5.000"
                },
                "BudgetYearOneBase": {
                    "val": "5.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "6.300"
                },
                "BudgetYearOne": {
                    "val": "-1.044"
                },
                "BudgetYearOneBase": {
                    "val": "-1.044"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "6.300"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.005"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.005"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.049"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.049"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "PU 2052 was updated to reflect the transition to PE 0305242M\/PU 8277. \n\nPU 8277 was established in FY21 as a result of the PE 0305242M\/PU 2052 (Unmanned Aerial Systems (UAS) Payloads\/RQ-21 Payload Development) transition to PE 0305242M\/PU 8277 (Unmanned Aerial Systems (UAS) Payloads\/UAS Payloads). This is not an FY21 New Start and was created to better support ISR payload requirements, development, and sustainment.\n\nCongressional Add - C415 Spectral and Reconnaissance Imagery for Tactical Exploitation - Wide Area Surveillance (WAS) for $6.300M."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2052"
                    },
                    "ProjectTitle": {
                        "val": "RQ-21 Payload Development"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.956"
                        },
                        "CurrentYear": {
                            "val": "3.704"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "5.536"
                        },
                        "BudgetYearFive": {
                            "val": "5.647"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Unmanned Aerial System (UAS) Payload Program will provide an agile and responsive means to integrate and support the development and fielding of Strategic and Tactical Intelligence, Surveillance, and Reconnaissance (ISR) and non-ISR capabilities as well as data Processing, Exploitation, and Dissemination (PED) and Communication capabilities for all Small Tactical UAS's within the Navy and Marine Corps. These component, sensor, and PED capabilities will alleviate Navy and Marine Corps ISR mission needs and gaps caused by rapidly changing missions, environments, threats, and technologies as well as enhance the effectiveness and operational utility of the UAS.   \n\nThe UAS Payload program element will increase the effectiveness and versatility of the Navy and Marine Corps UAS. Additional payload capability improvements and expansion include Communication, Automation and Autonomy, Magnetic Anomaly Detection (MAD), Chemical Biological, and Radiological\/Nuclear (CBRN) collection, Gravitational Sensing,  Signals Intelligence Collection (SIGINT), Electronic Warfare Support (EW and ES), Radar Imagery, Moving Target Indicator (MTI) Detection, Tracking and Imagery, Wide Area and Hyperspectral Imagery collection, Artificial Intelligence (AI)processing, Combined Multiple Intelligence (Multi-INT), Light Detection and Ranging (LiDAR), Laser Marking and Designation (LM, LD),  Acoustic Detection, Sense and Avoid, Identification of Friend or Foe (IFF), Weapons Integration, capability related PED, and Multi Mission functionality.  The UAS Payload program element is to encompass future and as yet unspecified unmanned system technology integration and improvements such as GPS denied environment survey and solutions related to Position, Navigation and Timing (PNT).  These advanced capabilities and payloads will provide the Navy Fleet Forces,  Marine Air-Ground Task Force (MAGTF) Marine Expeditionary Units (MEU) and Marine Expeditionary Forces (MEF) and their component subordinate commands (divisions and regiments) with dedicated, organic capabilities that facilitate the six functions of Marine Corps Aviation and the Marine Corps ISR Enterprise (MCISRE) across the range of military operations.\n\nThe UAS Payload program is developing and transitioning strategic and tactical sensor and PED capabilities to UAS in the areas of SIGINT and Synthetic Aperture Radar\/Moving Target Indicator (SAR\/MTI) and continuing the integration and prototype mission kit development work in the area of Multiple Intelligence (Multi-INT) and Wide Area Surveillance (WAS) capabilities that were begun under WIPEB.\n\nSIGINT - Locate, target, and exploit adversary Signals of Interest (SOI), ability to cue other ISR sensors to specific target geolocations. \n\nSynthetic Aperture Radar\/Moving Target Indicator (SAR\/MTI) - Locate and track ground targets day or night under a wide range of atmospheric conditions and at stand-off ranges exceeding those of EO\/IR Full Motion Video(FMV) technologies.  \n\nMultiple Intelligence (Multi-INT) - Simultaneous area of regard ISR data collection and functionality of sensors operating in widely disparate modalities such as Communications Relay, EW\/ES, SIGINT, Radar, and EO\/IR.  Enables the collection of synchronized data that maximizes the effective employment envelope by collectively decreasing uncertainties, such as geolocation accuracy, simultaneously prosecuting multiple targets of interest and maximizing datalink capability across a varied range of environments and temporal periods.\n\nWide Area Persistent Surveillance (WAS) - Imaging over wide areas (multiple square kilometers, city size area) at very spacial and temporal resolution at substantial stand-off distances with full motion video (FMV)access, picture in picture user defined watch boxes, and ability to cue other ISR sensors to specific target geolocations.  Ability to monitor and disseminate processed imagery data and static full field of view or user defined FMV watch box imagery and disseminate to ground-based disadvantaged users. Mission applications include battlefield situational awareness and monitoring, providing the capability to assure access and hold at risk, as well as enabling power projection in environments that are not currently accessible.\n\nProcessing, Exploitation, and Dissemination (PED) technologies enable minimization of the physical footprint of the UAS system with enhanced mission capabilities and the sharing and merging of data across multiple domains.  Artificial Intelligence (AI) and Automated Processing supports the rapid detection, tracking, and characterization in all ISR data types and provides actionable information for fusion and tracking exploitation systems and processes.\n\n\nNote: In FY19, PE 0305242M\/PU 5501,5502, and 5504 were consolidated to PE 0305242M\/PU 2052 (Unmanned Aerial Systems (UAS) Payloads\/RQ-21 Payload Development).  In FY21, PE 0305242M\/PU 2052 (Unmanned Aerial Systems (UAS) Payloads\/RQ-21 Payload Development) transitioned to 0305242M\/PU 8277 (Unmanned Aerial Systems (UAS) Payloads\/UAS Payloads)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.512"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.588"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue SIGINT product upgrades\n-Continue SAR\/MTI product upgrades\n-Complete development of a Multi-INT SIGINT payload system prototype\n-Initiate integration efforts for Multi-INT payload system\n-Initiate WAS payload integration"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY2021 budget decrease of $2.588M due to the transition to the new PU (8277) for UAS Payload Development in FY2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.846"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue Government Engineering Technical Support, other Government Support, Contract Support Services, Program Management Support, and program related travel in support of the payload systems.\n-Continue Integrated Logistics Support (ILS), training concept development and data management\/documentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY2021 budget decrease of $0.600M due to the transition to the new PU (8277) for UAS Payload Development in FY2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.303"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue developmental and operational payload testing"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue developmental and operational payload testing"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY2021 budget decrease of $0.500M due to the transition to the new PU (8277) for UAS Payload Development in FY2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management Services"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.295"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.016"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Complete development of a Tactical EO\/IR SIGINT Integrated for Targeting (TEISIT) payload system\n-Complete development of MULTI-INT and WAS payload system architecture\n-Initiate travel in support of various payload development, integration and test efforts"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Government program management support of the SIGINT, SAR\/MTI, Multi-INT and WAS capabilities. \nManagement Services will account for Cross-Organization travel funding requirements."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY2021 budget decrease of $0.016M due to the transition to the new PU (8277) for UAS Payload Development in FY2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APN\/0444"
                                    },
                                    "Title": {
                                        "val": "STUASLO"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "52.131"
                                        },
                                        "CurrentYear": {
                                            "val": "51.740"
                                        },
                                        "BudgetYearOne": {
                                            "val": "41.858"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "33.937"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "7.921"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "31.346"
                                        },
                                        "BudgetYearThree": {
                                            "val": "30.417"
                                        },
                                        "BudgetYearFour": {
                                            "val": "29.103"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.685"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "469.714"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The UAS Payload program utilizes a hybrid acquisition model.  Development is a mixture of evolutionary and single step to full capability processes, but typically follows an incremental or spiral approach.  Advanced payloads leverages work conducted by Small Business as well as large commercial industry vendors, academic and Federally Funded Research and Development Centers (FFRDC), and various government laboratories such as the Office of Naval Research (ONR), Defense Advanced Research Projects Agency (DARPA), Air Force Research Lab (AFRL), Joint Improvised Threat Defeat Agency (JIDA), the National Security Agency (NSA), and the National Geospatial Agency (NGA).   The UAS payloads portfolio consists of a family of mission kits and spans a broad spectrum of capability areas.  Capabilities are transitioned from variously sourced, high (5-7) Technology Readiness Level (TRL) science and technology (S&T) projects to the UAS Payloads portfolio for completion of research, development, test, and evaluation (RDTE) of the capability, systems engineering development into mission kits, and entrance into the Engineering Change Proposal (ECP) process for integration into Unmanned Aircraft Systems (UAS).  Mission kits field capabilities that meet Navy threshold or objective requirements, and facilitate the six functions of Marine Corps Aviation and the Marine Corps Intelligence Surveillance, and Reconnaissance Enterprise across the range of military operations.\n\nAll payloads follow similar acquisition paths but on independent time schedules. These acquisition paths are defined by three (3) phases, each marked by a decision gate. Phase I establishes the preliminary integration design concept and conduct of technology demonstration with validation of a Technology Readiness Level (TRL) 6\/7 as the decision gate for entry into Phase II. Phase II establishes full payload-to-Unmanned Aircraft System (UAS) integration during which time all necessary program management, engineering, fabrication, test, and evaluations activities are conducted to achieve Test Article Fabrication, System Test and Evaluation, Integrated Logistics Support (ILS) and Training Concept development, and Data Management and Documentation. Validation of funding, derived requirements, project risks, cost and schedule estimates, contracting strategy and achievement of TRL 9 constitute the decision gate for entry into Phase III. Phase III is program of record transition which supports a production decision based on the exit criteria from Phase II.\n\nThe UAS Payload Development program will partner with Small Tactical Unmanned Aircraft System (STUAS) PORs to identify required payloads. Conduct RDTE processes to develop capability into TRL9 payload and production level prototypes. Conduct Developmental and Operational testing (DT\/OT). Production kits delivered to receiving STUAS platform Program of Record with initial year sustainment, but will be incumbent on POR for long-term sustainment funding."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering SIGINT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.017"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.088"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.495"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contractor Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.846"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.303"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.244"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.051"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.016"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2021PB_0305242M_2052_FILE3.JPG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Proj 2052"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "SIGINT: SIGINT Development and Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SIGINT: SIGINT Engineering Change Proposal"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SIGINT: SIGINT Operational Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SAR\/MTI: SAR\/MTI  Developmental Test (DT)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SAR\/MTI: SAR\/MTI Developmental Test Report (DTR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SAR\/MTI: SAR\/MTI Engineering Change Proposal (ECP)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SAR\/MTI: SAR\/MTI Operational Test (OT)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SAR\/MTI: SAR\/MTI Operational Test Report(OTR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SAR\/MTI: SAR\/MTI Initial Operational Capability (IOC)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Multi-Int: Multi-Int Phase I Prototype Development and Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Multi-Int: Multi-Int Phase I Systems Requirement Review (SRR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Multi-Int: Multi-Int Phase I Preliminary Design Review (PDR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Multi-Int: Multi-Int Phase I Critical Design Review (CDR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Future Payload Development: Future Payload Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "8277"
                    },
                    "ProjectTitle": {
                        "val": "UAS Payloads"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.320"
                        },
                        "BudgetYearThree": {
                            "val": "1.338"
                        },
                        "BudgetYearFour": {
                            "val": "1.661"
                        },
                        "BudgetYearFive": {
                            "val": "2.029"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Unmanned Aerial System (UAS) Payload Program will provide an agile and responsive means to integrate and support the development and fielding of Strategic and Tactical Intelligence, Surveillance, and Reconnaissance (ISR) and non-ISR capabilities as well as data Processing, Exploitation, and Dissemination (PED) and Communication capabilities for all UAS's within the Marine Corps. These component, sensor, and PED capabilities will alleviate Marine Corps ISR mission needs and gaps caused by rapidly changing missions, environments, threats, and technologies as well as enhance the effectiveness and operational utility of the UAS.  \n\nThe UAS Payload program element will increase the effectiveness and versatility of the Marine Corps UAS. Additional payload capability improvements and expansion include Communication, Automation and Autonomy, Magnetic Anomaly Detection (MAD), Chemical Biological, and Radiological\/Nuclear (CBRN) collection, Gravitational Sensing,  Signals Intelligence Collection (SIGINT), Electronic Warfare Support (EW and ES), Radar Imagery, Moving Target Indicator (MTI) Detection, Tracking and Imagery, Wide Area and Hyperspectral Imagery collection, Artificial Intelligence (AI)processing, Combined Multiple Intelligence (Multi-INT), Light Detection and Ranging (LiDAR), Laser Marking and Designation (LM, LD),  Acoustic Detection, Sense and Avoid, Identification of Friend or Foe (IFF), Weapons Integration, capability related PED, and Multi Mission functionality.  The UAS Payload program element is to encompass future and as yet unspecified unmanned system technology integration and improvements such as GPS denied environment survey and solutions related to Position, Navigation and Timing (PNT).  These advanced capabilities and payloads will provide the Marine Air-Ground Task Force (MAGTF) Marine Expeditionary Units (MEU) and Marine Expeditionary Forces (MEF) and their component subordinate commands (divisions and regiments) with dedicated, organic capabilities that facilitate the six functions of Marine Corps Aviation and the Marine Corps ISR Enterprise (MCISRE) across the range of military operations.\n\nThe UAS Payload program is developing and transitioning strategic and tactical sensor and PED capabilities to UAS in the areas of SIGINT and Synthetic Aperture Radar\/Moving Target Indicator (SAR\/MTI) and continuing the integration and prototype mission kit development work in the area of Multiple Intelligence (Multi-INT) and Wide Area Surveillance (WAS) capabilities that were begun under WIPEB.\n\nSIGINT - Locate, target, and exploit adversary Signals of Interest (SOI), ability to cue other ISR sensors to specific target geolocations. \n\nSynthetic Aperture Radar\/Moving Target Indicator (SAR\/MTI) - Locate and track ground targets day or night under a wide range of atmospheric conditions and at stand-off ranges exceeding those of EO\/IR Full Motion Video(FMV) technologies.  \n\nMultiple Intelligence (Multi-INT) - Simultaneous area of regard ISR data collection and functionality of sensors operating in widely disparate modalities such as Communications Relay, EW\/ES, SIGINT, Radar, and EO\/IR.  Enables the collection of synchronized data that maximizes the effective employment envelope by collectively decreasing uncertainties, such as geolocation accuracy, simultaneously prosecuting multiple targets of interest and maximizing datalink capability across a varied range of environments and temporal periods.\n\nWide Area Persistent Surveillance (WAS) - Imaging over wide areas (multiple square kilometers, city size area) at very spacial and temporal resolution at substantial stand-off distances with full motion video (FMV)access, picture in picture user defined watch boxes, and ability to cue other ISR sensors to specific target geolocations.  Ability to monitor and disseminate processed imagery data and static full field of view or user defined FMV watch box imagery and disseminate to ground-based disadvantaged users. Mission applications include battlefield situational awareness and monitoring, providing the capability to assure access and hold at risk, as well as enabling power projection in environments that are not currently accessible.\n\nProcessing, Exploitation, and Dissemination (PED) technologies enable minimization of the physical footprint of the UAS system with enhanced mission capabilities and the sharing and merging of data across multiple domains.  Artificial Intelligence (AI) and Automated Processing supports the rapid detection, tracking, and characterization in all ISR data types and provides actionable information for fusion and tracking exploitation systems and processes.\n\n\nNote: In FY21, funding was added back into this PE\/Project to better support ISR Pay load requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.517"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.517"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- SIGINT product correction of deficiencies \n- SAR\/MTI product correction of deficiencies\n- Multi-INT continue contractor test and UAS integration efforts\n- WAS continue Phase 1 payload system prototype development, contractor testing, and UAS integration efforts"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY2021 budget increase of $3.517M due to funds added back into this PE\/Project to better support ISR Payload requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.613"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.613"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue Government Engineering Technical Support, other Government Support, Program Management Support,. Allow for slight increase in program related travel in support of payload systems.\n-Continue Integrated Logistics Support (ILS), training concept development and data management\/documentation."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY2021 budget increase of $0.613M due to funds added back into this PE\/Project to better support ISR Payload requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue developmental and operational payload testing"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY2021 budget increase of $0.700M due to funds added back into this PE\/Project to better support ISR Payload requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management Services"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.170"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.170"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Government program management support of the SIGINT, SAR\/MTI, Multi-INT and WAS capabilities. \nManagement Services will account for Cross-Organization travel funding requirements."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY2021 budget increase of $0.170M due to funds added back into this PE\/Project to better support ISR Payload requirements."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PMC\/4787"
                                    },
                                    "Title": {
                                        "val": "UAS Payloads"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.489"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.489"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.300"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.762"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.762"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.762"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "46.554"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The UAS Payload program utilizes a hybrid acquisition model.  Development is a mixture of evolutionary and single step to full capability processes, but typically follows an incremental or spiral approach.  Advanced payloads leverages work conducted by Small Business as well as large commercial industry vendors, academic and Federally Funded Research and Development Centers (FFRDC), and various government laboratories such as the Office of Naval Research (ONR), Defense Advanced Research Projects Agency (DARPA), Air Force Research Lab (AFRL), Joint Improvised Threat Defeat Agency (JIDA), the National Security Agency (NSA), and the National Geospatial Agency (NGA).   The UAS payloads portfolio consists of a family of mission kits and spans a broad spectrum of capability areas.  Capabilities are transitioned from variously sourced, high (5-7) Technology Readiness Level (TRL) science and technology (S&T) projects to the UAS Payloads portfolio for completion of research, development, test, and evaluation (RDTE) of the capability, systems engineering development into mission kits, and entrance into the Engineering Change Proposal (ECP) process for integration into Unmanned Aircraft Systems (UAS).  Mission kits field capabilities and facilitate the six functions of Marine Corps Aviation and the Marine Corps Intelligence Surveillance, and Reconnaissance Enterprise across the range of military operations.\n\nAll payloads follow similar acquisition paths but on independent time schedules. These acquisition paths are defined by three (3) phases, each marked by a decision gate. Phase I establishes the preliminary integration design concept and conduct of technology demonstration with validation of a Technology Readiness Level (TRL) 6\/7 as the decision gate for entry into Phase II. Phase II establishes full payload-to-Unmanned Aircraft System (UAS) integration during which time all necessary program management, engineering, fabrication, test, and evaluations activities are conducted to achieve Test Article Fabrication, System Test and Evaluation, Integrated Logistics Support (ILS) and Training Concept development, and Data Management and Documentation. Validation of funding, derived requirements, project risks, cost and schedule estimates, contracting strategy and achievement of TRL 9 constitute the decision gate for entry into Phase III. Phase III is program of record transition which supports a production decision based on the exit criteria from Phase II.\n\nThe UAS Payload Development program will partner with Small Tactical Unmanned Aircraft System (STUAS) PORs to identify required payloads. Conduct RDTE processes to develop capability into TRL9 payload and production level prototypes. Conduct Developmental and Operational testing (DT\/OT). Production kits delivered to receiving STUAS platform Program of Record with initial year sustainment, but will be incumbent on POR for long-term sustainment funding."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering SIGINT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.815"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.815"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering SAR\/MTI"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "BOA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ImSAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Springville, UT"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering Multi-INT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NRL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering WAS"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "BOA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Logos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fairfax, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.802"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.802"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contractor Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.613"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.613"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.020"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.020"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2021PB_0305242M_8277_FILE1.JPG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Proj 8277"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "SIGINT: SIGINT Software Updates"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SIGINT: SIGINT Operational Test (OT)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SIGINT: SIGINT Operational Test Report (OTR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SIGINT: SIGINT Initial Operational Capability (IOC)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SIGINT: SIGINT Software Updates #1"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SIGINT: SIGINT Software Update #2"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SIGINT: SIGINT Software Update #3"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SIGINT: SIGINT Software Update #4"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SIGINT: SIGINT Software Update #5"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SAR\/MTI: SAR\/MTI Software Updates"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SAR\/MTI: SAR\/MTI Software Update #1"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SAR\/MTI: SAR\/MTI Software Update #2"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SAR\/MTI: SAR\/MTI Software Update #3"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SAR\/MTI: SAR\/MTI Software Update #4"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SAR\/MTI: SAR\/MTI Software Update #5"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Multi-Int: Multi-Int Phase I Prototype Development and Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Multi-Int: Multi-Int Phase I Developmental Test (DT)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SPRITE (WAS): WAS Phase II Systems Requirement Review (SRR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SPRITE (WAS): WAS Phase II Prototype Development and Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SPRITE (WAS): WAS Phase II Preliminary Design Review (PDR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SPRITE (WAS): WAS Phase II Critical Design Review (CDR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SPRITE (WAS): WAS Phase II Developmental Test (DT) and Operational Test  (OT)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SPRITE (WAS): WAS Phase II Operational Test Report (OTR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "6.300"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.300"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Congressional Add for Spectral and Reconnaissance Imagery for Tactical Exploitation (SPRITE) is to continue the maturation, integration, and testing of a Group III UAS Intelligence Surveillance and Reconnaissance (ISR) infra-red (IR) wide area surveillance (WAS) capability.   This effort transitions the advanced imaging and data collection and processing technologies developed by the Office of Naval Research SPRITE program into an operational ISR system. Combined, the USMC and CA funds are providing prototype payloads to meet field user evaluations and operational testing requirements.\n\nGroup III Wide Area Surveillance (WAS) provides the Marine Air Ground Task Force (MAGTF) with an organic airborne enhanced day\/night electro-optic capability. The WAS payload collects and records high resolution Electro Optical \/ Infrared (EO\/IR) images over an instantaneous several kilometer field of regard in order to conduct persistent surveillance of large areas of interest, in near real time, while recording data to enable forensics.  Mission applications include situational awareness and site monitoring at significant standoff ranges and altitudes, providing the capability to assure access and hold at risk, as well as enabling power projection in inaccessible environments.  It will provide the Marine Corps disadvantaged users spectral and reconnaissance imagery for tactical exploitation and the ability to disseminate multiple high resolution sub-sampled imagery windows to multiple users from a small tactical UAS."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Spectral and Reconnaissance Imagery for Tactical Exploitation"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "6.300"
                                        },
                                        "Text": {
                                            "val": "Engineering, flight clearance, test events, and prototype developments\/improvements to develop a Phase I SPRITE-WAS capability."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The UAS Payload program utilizes a hybrid acquisition model. Development is a mixture of evolutionary and single step to full capability processes, but typically follows an incremental or spiral approach. Advanced payloads leverages work conducted by Small Business as well as large commercial industry vendors, academic and Federally Funded Research and Development Centers (FFRDC), and various government laboratories such as the Office of Naval Research (ONR), Defense Advanced Research Projects Agency (DARPA), Air Force Research Lab (AFRL), Joint Improvised Threat Defeat Agency (JIDA), the National Security Agency (NSA), and the National Geospatial Agency (NGA). The UAS payloads portfolio consists of a family of mission kits and spans a broad spectrum of capability areas. Capabilities are transitioned from variously sourced, high (5-7) Technology Readiness Level (TRL) Science and Technology (S&T) projects to the UAS Payloads portfolio for completion of research, development, test, and evaluation (RDTE) of the capability, systems engineering development into mission kits, and entrance into the Engineering Change Proposal (ECP) process for integration into Unmanned Aircraft Systems (UAS). Mission kits field capabilities that meet Navy threshold or objective requirements, and facilitate the six functions of Marine Corps Aviation and the Marine Corps Intelligence Surveillance, and ReconnaissanceEnterprise across the range of military operations.\n\nAll payloads follow similar acquisition paths but on independent time schedules. These acquisition paths are defined by three (3) phases, each marked by a decision gate.  Phase I establishes the preliminary integration design concept and conduct of technology demonstration with validation of a Technology Readiness Level (TRL) 6\/7 as the decision gate for entry into Phase II. Phase II establishes full payload-to-Unmanned Aircraft System (UAS) integration during which time all necessary program management, engineering, fabrication, test, and evaluations activities are conducted to achieve Test Article Fabrication, System Test and Evaluation, Integrated Logistics Support (ILS) and Training Concept development, and Data Management and Documentation. Validation of funding, derived requirements, project risks, cost and schedule estimates, contracting strategy and achievement of TRL 9 constitute the decision gate for entry into Phase III. Phase III is program of record transition which supports a production decision based on the exit criteria from Phase II."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering (WAS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "BOA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Logos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fairfax, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.200"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contractor Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.500"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.600"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2021PB_0305242M_9999_FILE1.JPG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Proj 9999"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "SPRITE (WAS): WAS Phase I Preliminary Design Review (PDR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SPRITE (WAS): WAS Phase I Critical Design Review (CDR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SPRITE (WAS): WAS Phase I Prototype Development and Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SPRITE (WAS): WAS Phase I Develpmental Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}