{
    "id": "2021-Navy-PB-1319-MJBOOK-0-0-744c7ee94c2cc798fbfd935e35baade9caa8a86b67e6f22ecedd75220314848f-5",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602131M"
        },
        "ProgramElementTitle": {
            "val": "Marine Corps Lndg Force Tech"
        },
        "R1LineNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "61.593"
            },
            "CurrentYear": {
                "val": "69.104"
            },
            "BudgetYearOne": {
                "val": "50.623"
            },
            "BudgetYearOneBase": {
                "val": "50.623"
            },
            "BudgetYearTwo": {
                "val": "51.624"
            },
            "BudgetYearThree": {
                "val": "52.674"
            },
            "BudgetYearFour": {
                "val": "53.728"
            },
            "BudgetYearFive": {
                "val": "54.803"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The U.S. Navy\/Marine Corps team is the most potent naval fighting force in the world. Fundamental to their success are the technologies necessary for effective distributed maritime operations. The Office of Naval Research (ONR) combines knowledge of the naval mission with researchers to select and explore solutions critical to expeditionary warfighting needs.  \n\nThis Program Element (PE) addresses requirements outlined in the Marine Corps Operating Concept, which calls for Expeditionary Forces to conduct maneuver warfare in challenging, contested maritime environments characterized by complex terrain, technology proliferation, information and electronic warfare. Additionally, an emergent operation stressor is the contested urban environment which exemplifies the characterizations listed above. The urban environment is one of the most complex terrains with physical compartmentalization and canalization, additional physical dimensions (subterranean and multi-story structures), crowded conditions and associated threat obscuration, communications challenges, informational and human aspects, and proliferation of observation and fires technologies. This environment requires capabilities addressing all the activities within this PE and while it provides many challenges, unique opportunities are also presented and can further shape technology approaches. \n\nThese future challenges and portents demand robust technologies for the Marine Corps, but the technology options are constrained. They must have a lightweight deployable character, and the ability to operate in austere conditions with little fixed infrastructure or support while retaining the agility and lethality of an integrated maneuver force. Technology must provide full spectrum capability against robust and complex peer and near-peer adversaries while meeting Size, Weight, Power, Post limitations, and information availability within Distributed, Intermittent and Limited environments. \n\nThe approach within this PE encompasses ideas that support both revolutionary and evolutionary capabilities, and in this way considers and balances both \"push\" and \"pull\" aspects of technology projects. \n\nThis Program Element (PE) funds Applied Research, which is the systematic study to understand the means to meet a recognized and specific need. Most of the work in this PE can be classified between Technology Readiness Level (TRL) 2 (technology concept and\/or application formulation) and TRL 4 (component and\/or breadboard validation in laboratory environments).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "63.212"
                },
                "CurrentYear": {
                    "val": "56.604"
                },
                "BudgetYearOne": {
                    "val": "50.623"
                },
                "BudgetYearOneBase": {
                    "val": "50.623"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "61.593"
                },
                "CurrentYear": {
                    "val": "69.104"
                },
                "BudgetYearOne": {
                    "val": "50.623"
                },
                "BudgetYearOneBase": {
                    "val": "50.623"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.619"
                },
                "CurrentYear": {
                    "val": "12.500"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "12.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.619"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: No change from FY 2020 President's Budget request to FY 2021 President's Budget request\n\nTechnical: no significant change \n\nSchedule: no significant change"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2958"
                    },
                    "ProjectTitle": {
                        "val": "Cyberspace Activities"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "6.273"
                        },
                        "BudgetYearOne": {
                            "val": "5.200"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.200"
                        },
                        "BudgetYearTwo": {
                            "val": "5.100"
                        },
                        "BudgetYearThree": {
                            "val": "5.100"
                        },
                        "BudgetYearFour": {
                            "val": "5.100"
                        },
                        "BudgetYearFive": {
                            "val": "5.202"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project activity provides freedom of maneuver and influence in the cyber-electronic warfare domain while simultaneously denying the same to the adversary and protecting critical command systems. Technologies are being developed using a multi-disciplinary approach that combines Radio Frequency electronics, digital signal processing, computer engineering, software engineering, machine learning and data science to support Naval Expeditionary warfighters operating with size, weight and power constrained equipment in Disrupted, Intermittent, Limited environments. Areas of applied research include distributed precision time, predictive software defined radio architectures, coordinated Cyber and Spectrum maneuver to mitigate detection and exploitation, tactical Cyber visualization, discovering and mapping networks in dense urban environments, contextual awareness and blind channel characterization."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Cyber"
                                    },
                                    "Description": {
                                        "val": "This activity provides freedom of maneuver and influence in the cyber-electronic warfare domain while simultaneously denying the same to the adversary and protecting critical command systems. Technologies are being developed using a multi-disciplinary approach that combines Radio Frequency electronics, digital signal processing, computer engineering, software engineering, machine learning and data science to support Naval Expeditionary warfighters operating with size, weight and power constrained equipment in Disrupted, Intermittent, Limited environments. Areas of applied research include distributed precision time, predictive software defined radio architectures, coordinated Cyber and Spectrum maneuver to mitigate detection and exploitation, tactical Cyber visualization, discovering and mapping networks in dense urban environments, contextual awareness and blind channel characterization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.273"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Cyber related research will be conducted to develop methodologies to securely transfer information real-time across security boundaries for tactical users. Research will expand upon general cyber health assessments for distributed systems to understand cyber resilience for systems-of-systems. Develop new algorithms and tools to demonstrate Cyber-EW capabilities for tactical engagement. Cyber-related approaches will be used to better characterize digital waveforms for better situational awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- The development of new portable tools to capture software configuration management to include malware on forward deployed systems will be initiated. \n- Cyber threat identification (cyber health assessments) to include vulnerability research for ubiquitous embedded systems will focus on devices commonly carried by Marines will continue.  \n- Algorithm and tool development for Cyber-EW capabilities for tactical engagement will continue.  \n- Sense-making algorithms through machine learning for the cyber physical layer and Algorithms to assist in supply chain validation that are designed for small form-factor tools will be initiated."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2020 to FY 2021 reflects a transition of enabling technologies for dynamic radio frequency agility efforts from this activity to the Future Naval Capabilities activity in 0603640M."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3001"
                    },
                    "ProjectTitle": {
                        "val": "Marine Corps Landing Force Tech"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "54.835"
                        },
                        "CurrentYear": {
                            "val": "50.331"
                        },
                        "BudgetYearOne": {
                            "val": "45.423"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.423"
                        },
                        "BudgetYearTwo": {
                            "val": "46.524"
                        },
                        "BudgetYearThree": {
                            "val": "47.574"
                        },
                        "BudgetYearFour": {
                            "val": "48.628"
                        },
                        "BudgetYearFive": {
                            "val": "49.601"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds applied research; technology assessment, road mapping, and concept development; and less technologically mature projects within the Future Naval Capability (FNC) process as means to inform, enhance, enable, and invent future concepts and capabilities with new Science and Technology (S&T). This project is organized into ten activities, the core of which is represented by the eight Expeditionary Warfighting Capability Areas."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Command, Control, Communications, and Computers (C4)"
                                    },
                                    "Description": {
                                        "val": "This activity investigates robust, resilient, and secure networked communications pathways and capability that support an expeditionary force's distributed and disaggregated operations. Research supports both networked and local computation for communications that exploits the expeditionary forces close physical proximity to threats while mitigating shortfalls commiserate within Distributed, Intermittent and Limited environments. Expeditionary forces must operate in the cyber domain and in addition to defending communications networks, vehicles, and weapons systems, are reliant on electronic controllers for basic operations and as such are susceptible to cyber attacks.\n\nTechnologies addressed within this activity include secure, robust, self-forming, mobile communications networks; distributed computing to support information dissemination to all echelons; improved capabilities in over-the-horizon, beyond line-of-sight, and restricted environment communications and sensors; and software and data processing to support formation of an appropriate common picture. Other efforts include power management, low detectability, conforming to Size, Weight, Power, Cost constraints, and interoperability within the joint environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.430"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Command, Control, Communications and Computers (C4) research focuses on operations in the challenging warfighter electromagnetic spectrum environment by making investments in the multifunction electronic warfare domains. Mission requirements include lightweight, portable, deployable systems for expeditionary forces. Investigations include increasing bandwidth and dynamic range in portable systems. Also included are electromagnetic signature management, machine learning, countermeasures and interoperability technologies to manage control and exploitation of the electromagnetic spectrum. Focus also includes developing underlying technologies to enable multifunction operations at multiple-domain cryptography and security levels. Research is closely coordinated with the Intelligence, Surveillance, and Reconnaissance and Expeditionary Cyber research to address the multifunction requirement of future systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Research areas will expand to include novel portable materials for rapid deployment of back-up Command, Control, Communications and Computers (C4) assets, and distributed system technology enablers for operating in denied \/ contested electromagnetic (EM) environments. \n- Continued focus on operations in the challenging warfighter EM spectrum environment by making investments in the multifunction electronic warfare domains. Mission requirements include lightweight, portable, deployable systems for expeditionary forces. Investigations include increasing bandwidth and dynamic range in portable systems. \n- Electromagnetic signature management, machine learning, countermeasures and interoperability technologies will progress to manage control and exploitation of the electromagnetic spectrum. Focus includes developing underlying technologies to enable multifunction operations at multiple-domain cryptography and security levels. Research is closely coordinated with the Intelligence, Surveillance, and Reconnaissance and Expeditionary Cyber research to address the multifunction requirement of future systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2020 and FY 2021 is due to increased research investment in technologies for contested electromagnetic (EM) environments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Firepower"
                                    },
                                    "Description": {
                                        "val": "The activity investigates a large variety of weapons to provide the warfighter with a decisive, yet surgical, tactical advantage to collectively address 21st-century combined-arms warfare against peer and near-peer states. Research efforts increase the reach, lethality and capacity, while retaining mobility and tempo beneficial to expeditionary maneuver warfare. Maintaining focus on size, weight, power, cost Size, Weight, Power, Cost and Distributed, Intermittent and Limited environments stresses the technical solutions available.\n\nTechnologies being developed are intended for application on both current and future expeditionary weapons. They include, but are not limited to fuze, fire control, launch\/propulsion, lethality, and accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.843"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.595"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Resources in this activity will be used to conduct research in end-to-end navigation technologies suitable for shaping the trajectories of extended range, precision, gun-launched munitions in satellite- and network-denied environments. \nConduct research into real-time, multi-spectral target detection and identification technologies for individual shooters will continue in order to improve anomaly and object detection and decision-aid algorithms. Conduct\nresearch to develop thin film coatings that will change how munitions interact with electromagnetic waves, and for novel materials and processes to improve energetic output of explosives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Research will progress in end-to-end navigation technologies suitable for shaping trajectories of extended range, precision, gun-launched munitions in satellite- and network-denied environments. Complete application of these same technologies as they apply to extended range mortars.  \n- Proceed with research into real-time, multi-spectral target detection and identification technologies for individual shooters. This continues to improve anomaly and object detection during degraded visibility and long-range day and night situations and to improve decision-aid algorithms.  \n- Progress research to develop thin film coatings that will change how munitions interact with electromagnetic waves. \n- Development of novel materials and processes to improve energetic output of explosives will continue."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2020 to FY2021 reflects an alignment to Naval priorities and a targeted reduction in supporting technologies for extended-range mortars."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Protection"
                                    },
                                    "Description": {
                                        "val": "This activity investigates new ways and means to protect forces and materiel across all operational settings, from contested sea-land surface interfaces to complex urban environments. The portfolio protects against adversaries' challenges such as guided-rockets and missiles, mobile coastal artillery, threat Electronic Warfare, and counter Intelligence, Surveillance and Reconnaissance. Mines and obstacles both in the water and ashore also complicate amphibious landings. The activity invests in vehicle survivability aspects that are exacerbated due to Size, Weight, Power, Cost constraints inherent to Marine Corps operation and the harsh nature of the amphibious environment. \n\nTechnologies addressed include lightweight armor for ballistic and underbody blast protection, advanced sensors for counter tactical surveillance, active protection, and signature management. This activity also considers technology for payloads, packages and sensors that are needed by amphibious vehicles (both manned and unmanned) including mine counter measures; explosive hazard defeat systems; and obstacle and threat detection systems as well as technologies for improved protection for individuals against blast, ballistic and blunt impact threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.670"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research will continue to focus on detecting ambush threats and surveillance of vehicles and personnel prior to reaching threat engagement range.  Sensing modalities and advanced algorithms leveraging computer vision and machine learning will continue to be developed to provide counter targeting and tactical surveillance.  Improve signature management and control, to include material development, will be explored.  Develop improved active protection system countermeasures to expand threat set and protected area and improve robustness to operational environments and enabling technologies for countering unmanned aerial vehicles through kinetic and directed energy means."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.596"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.596"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Detection technologies related to threat ambush scenarios will be concluded. \n- Efforts for application of low-cost sensors and computer vision\/machine learning approaches will expand and be extended to include amphibious assault environment and utilization of unmanned platforms for autonomous first-wave scenarios. This will encompass operations in mined littoral and beach environments and obstacled landing areas. \n- Research will continue in enabling technologies for countering unmanned aerial vehicles threats. This addresses both an increase in number and sophistication of threat systems to include kinetic and\/or controlled interceptors as well as directed energy approaches."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Performance, Training and Education"
                                    },
                                    "Description": {
                                        "val": "This activity investigates two technology investment areas: warrior resilience, and decision-making and expertise development. Warrior resilience is focused on advanced training technologies and methodologies that enhance neural, cognitive, and physical readiness. Decision making and expertise development accelerates and improves the advancement in retention of skills in decision making, situation awareness, including individual and team adaptability and coordination on decentralized, dynamic and dispersed battlefields."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.687"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Across the three technology investment areas of 'Warrior Resilience' (WR), 'Decision Making and Expertise Development' (DMED), and Operational Tools (OT) research will continue to focus on providing small unit leaders with effective training and tools to gain them the winning edge on the battlefield. These capabilities will provide information to the warfighter at the point of friction and with increased information flow (\"the right information, presented the right way, at the right time\") to aid cognitive reasoning about the effects of the battlefield - whether physical or physiological - and mitigation of negative aspects of combat. The WR portfolio will fund research into further understanding the necessity, and ability, to train front-line (infantry) troops for maximum performance. The DMED portfolio will research and implement state-of-the-art and science of learning-based training techniques to improve the development of small unit decision making expertise. The Operational Tools portfolio will increase the ability of the warfighter to process information and speed decision making by implementing novel data collection techniques (multi-spectral collection of signals across the electro-optical spectrum) and processing of these inputs for display - in real time, as the ultimate goal - directly to the individual who requires the information to make a timely, accurate decision."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Warrior Resilience: Research in training and decision tools will progress to provide information to the warfighter at the point of friction, increase information flow to aid situational awareness of the battlefield, and mitigate negative aspects of combat. Advance research into necessity and ability to provide continual training for front-line (infantry) troops while deployed for maximum performance. \n- Decision Making and Expertise Development: Research into implementation of state-of-the-art and science of learning-based training techniques to improve the development of small unit decision-making expertise will continue. \n- Operational Tools: Further research into the ability of the warfighter to process information and speed good decision making by implementing novel data collection and visualization techniques."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligence, Surveillance, And Reconnaissance (ISR)"
                                    },
                                    "Description": {
                                        "val": "This activity investigates enhanced situational awareness, persistent surveillance, and tactical decision making through automated analysis of data and rapid integration of information and acquired knowledge.  Specific technologies in this activity effectively present actionable information to decision-makers, especially those at the lower command levels.  This includes biometric monitoring for expeditionary operations, operational Course Of Action (COA) development, and autonomous surveillance in support of distributed operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.969"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.276"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research in applying supervised learning and unsupervised learning algorithms to the Naval domain.  Continue development of strong Artificial Intelligence as applied to both images and text. Accelerate development of algorithms that can infer patterns in common intelligence and tactical pictures useful to the development of decision support tools.  Accelerate the development of planners that can learn from historical data.  Develop a question answering capability that is relevant to the Naval domain.  Exam network formation, growth and fracture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Development of algorithms that can infer patterns in common intelligence and tactical pictures useful to the development of decision support tools will be continued. \n- Utilize mission planners that will learn from historical data to demonstrate more timely and complete common intelligence pictures. \n- Use Artificial Intelligence (AI) and machine learning to automate mission planning and mission re-planning.\n- Increase research in end-to-end deep reinforced learning, as well as demonstrate warfare at machine speed that can be applied to a very large force of manned and unmanned platforms.  \n- Conduct applied research on strong artificial intelligence decision support systems that avoid bad decisions even when presented with very noisy data.  \n- Research in smart graphs, network shaping metrics, actionable visualizations, and network fractures will continue. \n- Transition select AI efforts to Innovative Naval Prototypes(INP)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2020 to FY 2021 reflects transition of artificial intelligence developments with Naval application into the Innovative Naval Prototype program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "USMC FNC Technology Candidates"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity addresses the applied research associated with the Marine Corps' participation in the Department of the Navy's (DoN) Future Naval Capabilities (FNC) Program.  The objective of the work in this Program Element (PE) is to develop and mature technologies needed by the Marine Corps to initiate FNCs in PE 0603640M Marine Corps Advanced Technology Development (ATD) that can be commenced at higher Technology Readiness Levels (TRLs).  Investments in this activity are coordinated with similar and non-duplicative efforts in PE 0602750N Future Naval Capabilities Applied Research, where the Navy's participation in the FNC Program is funded.  The FNC Program is structured to accelerate the transition of new technologies to the Fleet and Force.  Each effort is assessed for its technology maturity and transition commitment.  Funding for FNCs, which have Technology Readiness Levels (TRLs) of 4\/5 to 6 and also have transition funding commitments from acquisition Programs of Record, are resourced in PE 0603640M Marine Corps Advanced Technology Development.  Funding for technology candidates at lower TRLs (3 to 4) are resourced in this PE 0602131M, Marine Corps Landing Force Technology. ONR works closely with the Resource Sponsors and acquisition stakeholders to develop high priority technological capabilities needed by the operational forces.\n\nFNC Budget Activity (BA) 2 investments develop candidate FNC technologies in an agile fashion by exploiting technology advances that respond rapidly to naval needs. This approach facilitates an optimum response when developing and maturing the technology options that can be developed further in PE 0603640M Marine Corps Advanced Technology Development (ATD). \n\nThe FNC Program favors a high level of collaboration.  PE R-2 activities are mostly organized by the Office of Naval Research (ONR) Departments, which are tasked to collaborate with the acquisition stakeholders and their resource sponsors.  \n\nA complete accounting of the technology candidates being developed and a full disposition of each technology development effort funded in this PE is provided annually to the Congressional oversight committees."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.799"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Future Naval Capability Technology Candidate development in FY20 will continue to focus on a broad range of technologies including, but are not limited to, investments that focus on developing and maturing new capabilities for asymmetric and irregular warfare, distributed operations, information dominance, maneuverability, survivability, self-defense and expeditionary warfare."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.795"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.795"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This activity will continue to focus on developing promising technologies emerging from the FNC Applied Research program that have been matured to a Technology Readiness Level of 4 to 5. Development efforts include, but are not limited to, technologies that: \n- Enable greater signature management of the Marine Air-Ground Task Force (MAGTF) \n- Support a multi-domain sensing of the electronic spectrum, Command and Control integration and automated collaboration of warfighting functions\n- Enhance mobility, propulsion, autonomy, weapons, materials, logistics, vehicle architectures, and Electronic Warfare protection for a light armored vehicle fleet\n- Support improved warfighter feedback and enhanced learning in live, virtual and constructive environments\n- Optimize the balance between hardening and flexible software development for future dynamic engagements in contested environments with adversaries\n- Produce new repair techniques to include the use of solid-state technologies such as cold-spray and additive friction stir welding for structural repairs"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Logistics"
                                    },
                                    "Description": {
                                        "val": "This activity investigates the practical discipline and real world application of the deployment, sustainment, reconstitution, and re-deployment of forces engaged in expeditionary operations.  Logistics replaces mass with assured knowledge and speed, is equally capable ashore or afloat in austere environments, and is fully scalable to meet uncertain requirements.  This includes efficient and responsive force sustainment, planning and directing logistics operations, logistics demand reduction, fleet maintenance, and expeditionary energy.  Expeditionary Energy enhances combat capability of expeditionary warfighters by increasing the efficiency and effectiveness of energy production, storage, distribution and use. Beyond traditional energy efforts, this portfolio also looks at other issues, including energy-efficient behaviors and hybridization of energy sources. These pillars are thoroughly integrated and perpetually related in execution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.784"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.254"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Logistics development in FY20 will focus on the broad range of technologies noted in the FY19 plans section above. Research into friction stir welding, additive friction stir welding, and cold spray for structural repair of Marine Corps equipment will complete.  Research will be initiated in artificial intelligence tools to support logistics planning, execution, and combat support.  Develop enhancing autonomous logistics aerial\/ground asset teaming. Develop cyberphysical security of Digital Manufacturing methods, including Additive Manufacturing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.228"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.228"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue research to predict vehicle health and prognostics of remaining useful life for military ground vehicles and equipment in support of logistics planning, execution and combat support. Continue to investigate use of aerial unmanned logistics to provide operational and tactical level supply. Advance enhancement of combat capability by increasing energy production, storage, and distribution including curbing energy consumption of the individual Marine and other tactical assets Activities continue to involve applied research into new, rugged, low cost, and high specific power solar cell technologies, including investigation into the stability of the solar cells. Investigate developing more energy efficient componentry as part of the Marine warfighter loadout"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maneuver"
                                    },
                                    "Description": {
                                        "val": "This activity investigates new ways and means to land forces and material through contested sea-land surface interfaces to then conduct maneuver warfare. In order to enable future Amphibious Operations, research efforts will support autonomous operations across the sea-surf-ground environment, improved fuel efficiency and speed of amphibious vehicles, amphibious vehicle technologies, water performance, and amphibious payloads to change the dynamics of a surface amphibious assault. This includes the emergence manned-unmanned teaming and autonomous vehicle collaboration. \n\nThe technologies included in this work address areas of mobility, materials, propulsion, signature reduction, modularity, and unmanned systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.486"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.022"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research will focus on intelligent mobility technologies to enable greater capability in harsh off road and littoral environments.  Efforts will include better understanding of the ground interface through terrain characterization and researching enhanced platform effectors that allow the system to adapt to varying terrain approaching real time thereby increasing operational tempo.   Efforts also include the development of forward-operating autonomous unmanned systems, in communication limited and Global Positioning System denied environments, with a focus on sense-making from local-sensors at the edge.  Research will continue to improve the impacts of the surf zone and other land-sea interfaces on vehicle dynamics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.770"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.770"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Research will focus on intelligent mobility technologies to enable greater capability in harsh off road and littoral environments, with efforts including predictive and adaptive mobility testing and demonstration\n- Progress research to gain a better understanding of the ground interface through terrain characterization and researching enhanced platform effectors that allow the system to adapt to varying terrain approaching in real time, increasing operational tempo\n- Continue research for amphibious vehicle autonomy through development of components for low-cost robotic autonomy kits (e.g. Sensing & Perception, Planning & Control, Localization, World Modeling and Integration) \n- Develop sensors and autonomous behaviors to enable combat ground and amphibious vehicles to perform landing zone reconnaissance, create feint and decoys, deploy mine countermeasures, and provide direct\/indirect fires for future deployment in contested landing environment through integration of payloads developed under other activities"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Expeditionary Cyber"
                                    },
                                    "Description": {
                                        "val": "This activity provides freedom of maneuver and influence in the cyber-electronic warfare domain while simultaneously denying the same to the adversary and protecting critical command systems. Technologies are being developed using a multi-disciplinary approach that combines Radio Frequency electronics, digital signal processing, computer engineering, software engineering, machine learning and data science to support Naval Expeditionary warfighters operating with size, weight and power constrained equipment in Disrupted, Intermittent, Limited environments. Areas of applied research include distributed precision time, predictive software defined radio architectures, coordinated Cyber and Spectrum maneuver to mitigate detection and exploitation, tactical Cyber visualization, discovering and mapping networks in dense urban environments, contextual awareness and blind channel characterization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.574"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Future Concepts, Technology Assessment, And Roadmapping"
                                    },
                                    "Description": {
                                        "val": "This activity supports the planning and integration of technology development efforts across the entire Program Element (PE). In conjunction with the Concepts Based Capabilities System and the Marine Corps Warfighting Laboratory, unique and novel concepts for advanced warfighting are developed and validated. Effectiveness analyses are conducted to identify the synergistic effects that can be achieved through the integration of emerging technology with innovative tactics, doctrine, and techniques. Technology assessments are conducted to determine the supporting technologies that have the highest impact across the warfare areas, and warrant further investment within this PE. Technology Roadmapping is conducted to help identify opportunities to leverage technology development within the Department of the Navy and the Department of Defense, as well as with the commercial sector and university communities. The resultant technology investment strategy is developed and used to guide out-year technology development efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.593"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.434"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess systems of technologies that best address warfare environments and drivers described in the MOC and the Navy's A Design for Maintaining Maritime Superiority. Identify and integrate numerous technology options within expeditionary design constraints to develop technology counterparts to Operational Concepts. Create technology roadmaps, concepts, and holistic systems of systems approaches that fulfil the needs identified in Operational Concepts such as the Marine Corps' Expeditionary Advanced Based Operations Concept and Littoral Operations in a Contested Environment Concept and enhance expeditionary capabilities against peer and near-peer adversaries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.434"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.434"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Assess technologies and technology concepts that have potential alignment to the Marine Corps Operating Concept (MOC) as well as ability to support both Expeditionary Advanced Basing and Distributed Maritime Operation concepts \n- Extend development of technology roadmaps, concepts, and holistic systems of systems approaches that fulfill the needs identified in in these concepts\n- Conduct warfighter workshops and wargaming to understand highest potential for these technologies in order to shape investment priorities"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "6.758"
                        },
                        "CurrentYear": {
                            "val": "12.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "19.258"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research supporting Marine Corp Landing Force Technologies"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Interdisciplinary Expeditionary Cybersecurity Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.827"
                                        },
                                        "Text": {
                                            "val": "This program will fund the following research efforts in FY19:\n- Identification of system vulnerabilities within blue and gray\ncyberspace that affect Expeditionary Cyber operations\n- Develop proof of vulnerabilities, where applicable \n- Propose defensive technologies and methodologies for target\nplatforms"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7.500"
                                        },
                                        "Text": {
                                            "val": "This program will fund the following research efforts in FY20:\n- Identification of system vulnerabilities within blue and gray\ncyberspace that affect Expeditionary Cyber operations\n- Develop proof of vulnerabilities, where applicable \n- Propose defensive technologies and methodologies for target"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Marine Corps Asset Life-Cycle Management"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "1.931"
                                        },
                                        "Text": {
                                            "val": "Conduct research for new sensors and integrated vehicle health management systems for emerging vehicle programs and prototypes, such as the Armored Reconnaissance Vehicle, in order to enhance overall asset lifecycle management."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}