{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-9035d21372bc28631c31031b85da2fbd962d290bf8d6ca6eecbc49021508de49-28",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603769D8Z"
        },
        "ProgramElementTitle": {
            "val": "Advanced Distributed Learning"
        },
        "R1LineNumber": {
            "val": "60"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "21.437"
            },
            "PriorYear": {
                "val": "13.414"
            },
            "CurrentYear": {
                "val": "22.446"
            },
            "BudgetYearOne": {
                "val": "6.765"
            },
            "BudgetYearOneBase": {
                "val": "6.765"
            },
            "BudgetYearTwo": {
                "val": "6.478"
            },
            "BudgetYearThree": {
                "val": "5.699"
            },
            "BudgetYearFour": {
                "val": "5.699"
            },
            "BudgetYearFive": {
                "val": "5.947"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.564"
                },
                "CurrentYear": {
                    "val": "13.723"
                },
                "BudgetYearOne": {
                    "val": "13.493"
                },
                "BudgetYearOneBase": {
                    "val": "13.493"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "13.414"
                },
                "CurrentYear": {
                    "val": "22.446"
                },
                "BudgetYearOne": {
                    "val": "6.765"
                },
                "BudgetYearOneBase": {
                    "val": "6.765"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.150"
                },
                "CurrentYear": {
                    "val": "8.723"
                },
                "BudgetYearOne": {
                    "val": "-6.728"
                },
                "BudgetYearOneBase": {
                    "val": "-6.728"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.002"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.148"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Congressional"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "8.723"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.028"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.028"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "ADL Transfer from CE2T2 TJS"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense-Wide Review"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-9.700"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-9.700"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funds reserved for special research programs, e.g., SBIR\/STTR."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "776"
                    },
                    "ProjectTitle": {
                        "val": "Advance Distributed Learning (ADL)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "21.437"
                        },
                        "PriorYear": {
                            "val": "13.414"
                        },
                        "CurrentYear": {
                            "val": "22.446"
                        },
                        "BudgetYearOne": {
                            "val": "6.765"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.765"
                        },
                        "BudgetYearTwo": {
                            "val": "6.478"
                        },
                        "BudgetYearThree": {
                            "val": "5.699"
                        },
                        "BudgetYearFour": {
                            "val": "5.699"
                        },
                        "BudgetYearFive": {
                            "val": "5.947"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Defense-Wide Reviews (DWR) - Funding for the Advanced Distributed Learning (ADL) Initiative was reduced by $9.7 million in FY 2021 resulting from the DWR, which focused on the Secretary's guidance to streamline operations, increase efficiency, and promote greater affordability within the OSD and Defense Agencies and Field Activities in order to ensure the Department's optimum alignment to the National Defense Strategy and DoD strategic guidance, with particular focus on building a more lethal, resilient, agile, and ready force while strengthening alliances, prioritizing cyber and space capabilities, and focusing on innovation to maintain the technological advantage. The FY2021 reduction is offset by an administrative zero-sum transfer ($3.0 million) from PE 0804767D8Z (i.e., Combatant Commander Exercise Engagement and Training Transformation [CE2T2] from The Joint Staff [TJS])."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) describes the Advanced Distributed Learning (ADL) Initiative. This PE provides policy oversight and guidance for distributed learning (e.g., online courses, smartphone-based learning, web browser–based simulations) and supports associated modernization and coordination across DoD, coalition partners (e.g., NATO), and other federal agencies. This PE helps DoD and its partners maintain modern and interoperable digital learning systems for delivering training and education anytime and anywhere at scale. This program was originally established in 1997 in response to the NDAA (FY99, Section 378 of Public Law 105-261) and granted additional authorities via Executive Orders (e.g., EO 13111) and other supporting publications (e.g., 10 U.S. Code §2249d). \n\nThis PE’s work falls into three interrelated categories: (1) Modernization, (2) Documentation, and (3) Coordination. The modernization work involves Advanced Technology Development in technical areas such as digital learning systems interoperability, learning analytics, and learning science for delivery at scale. These efforts inform the PE’s documentation work, including the authoring and upkeep of technical guidance and policy documents such as DoD Instruction 1322.26 (“Distributed Learning”) and software interoperability specifications. Finally, coordination efforts consist of implementation support and interagency\/interorganizational coordination. \n\nThis PE’s modernization investments are driven by requirements collected from the Defense ADL Advisory Committee, a working group that represents agencies’ distributed learning equities (refer to DoDI 1322.26). These requirements are also aligned to DoD\/federal strategic direction, such as the DoD Chief Management Officer’s Digital Learning Modernization reform, Army Learning Strategy, Navy’s Sailor 2025, and Air Force Strategic Master Plan. \n\nThis PE benefits DoD in three ways. (1) Interoperability: It strengthens interagency, interorganizational, and multinational interoperability by governing distributed learning interoperability policy, maintaining current technical reference guidelines, and fostering their implementation across communities of practice. (2) Efficiencies: It saves government resources by fostering unity of effort across DoD, other federal agencies, and coalition partners for distributed learning, eliminating duplications and identifying opportunities for interagency collaboration. (3) Learning Effectiveness: It helps improve training and education effectiveness by helping DoD, federal, and coalition stakeholders acquire and implement digital learning capabilities effectively and cost-efficiently. In sum, this work supports DoD Components’ training and education missions, helping them increase personnel readiness while driving down training and education portfolio costs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advance Distributed Learning (ADL)"
                                    },
                                    "Description": {
                                        "val": "This PE serves as the innovation hub for distributed learning across the DoD and other government agencies. The ADL Initiative supports DoD-wide modernization in the domain of enterprise-wide network-based digital training and education. Activities include advanced technology design and development, demonstrations, assessments, and associated policy stewardship. Results improve the efficiency of DoD systems, increase their technical interoperability (which improves usability and reduces duplications of effort), and help DoD maintain up-to-date learning technologies that effectively support personnel readiness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.414"
                                            },
                                            "Text": {
                                                "val": "1.\tContinue implementation of revised DoDI 1322.26 requirements, while also providing coordination with Joint Services, and guidance on the incorporation of experience Application Programming Interface (xAPI) into distributed learning software systems.\n\n2.\tTotal Learning Architecture – The Total Learning Architecture (TLA) will enter its third phase of development, which is expected to incorporate multiple simultaneous application domains, building upon the FY18 Combat Profiling domain. It will also incorporate increased focus on learner records, competency specifications, and content metadata, to enable greater integration with broader talent management systems. This work also coincides with emerging DoD-wide learning technology reform efforts.\n\n3.\tLearner Profiles – The promise of new TLA applications stems from the ability to create, collect, transmit, process, and archive information on a massive scale. Collaborate with operational defense training and education organizations to help them implement at-scale instances of prototype learning data interoperability specifications, learning analytics, and visualization capabilities. Desired outcomes include developing a TLA-compliant, extensible, and open-source learner profile for use within the DoD and Government.\n\n4.\tCompetency and Credential Management - Coordinate efforts across defense and federal agencies for competency-based learning, with the associated technical guidance potentially informing DoD Instruction 1322.26’s fungible technical references. Seek a robust set of data, metadata, and interaction specifications to represent competencies and competency frameworks. Desired outcomes include an effective reference implementation of enterprise competency and credential management supporting DoD learning ecosystems; including a data strategy and associated lifecycle that creates a solid foundation for expansion of TLA.\n\n5.\tPersonal Assistant for Learning – Complete development cycles of tablet-based and web-based prototypes. Continue transition of mature specification into relevant technical guidelines and continue to investigate emerging capabilities. Initiate advanced research in preparation for immediate operational implementation of the PERvasive Learning System (PERLS), adaptive, micro-learning mobile application.\n6.\tLearning Science – Complete publication of a learning science scholarly book, summarizing best practices and specific guidance on modernizing training, education, and talent management, as an accompaniment to the emerging learning technologies. \n\n7.\tInteragency and Interorganizational Coordination – Continue coordination with defense, federal, and international stakeholders, and with relevant working groups, such as the Defense ADL Advisory Committee and NATO Training Group, to create technical alignment of distributed learning systems and find efficiencies for the government."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.446"
                                            },
                                            "Text": {
                                                "val": "1. Enterprise Course Catalog -- Consolidate distributed learning course listings to a single Defense-wide training and education course catalog, accessible through a single web-based portal. Demonstrate an initial operational capability in collaboration with the Defense Acquisition University and Joint Knowledge Online. This work directly supports DoD Chief Management Office–directed reforms (“Digital Learning Modernization”).\n\n2. Enterprise Learner Record -- Help inform and establish operational capabilities and policies for the security, privacy, and interoperability of Defense-wide learning and development records. Make progress toward an initial operational capability. This work directly supports DoD Chief Management Office–directed reforms  (“Digital Learning Modernization”) and aligns with White House Interoperable Learner Record efforts.\n\n3. Learning Services Ecosystem -- Continue to develop the technology infrastructure for the larger “learning ecosystem” (i.e., the Total Learning Architecture project); conduct pilot testing. This work indirectly supports DoD Chief Management Office reforms by providing the foundational data interoperability fabric for digital learning software systems.\n\n4. Microlearning Mobile-Learning Platform -- Implement a Defense-wide micro-learning platform that allows taking advantage of \"white space\" for training\/education (PERvasive Learning System [PERLS], see Issue Pape INV-11548). Conduct usability, verification, and validating testing.\n\n5. Learning Technologies Warehouse -- Streamline acquisition of new distributed learning capabilities via cloud-hosted environment for transitioning new technologies; demonstrate initial operational capability.\n\n6. Learning Data Semantic Interoperability -- Establish Defense-wide standards for the semantic interoperability of learner data (i.e., ensure data have shared meaning not only shared software formats). Demonstrate initial operational capability of the associated “profile server.”\n\n7. NATO STANAG 2591 -- Inform and help update the NATO “Advanced Distributed Learning” policy to better facilitate resource sharing and modern distributed learning interoperability via coordination with the NATO Training Group Individual Training and Educational Developments working group.\n\n8. Defense Learning-at-Scale Strategy -- Define an implementation roadmap for migrating distributed learning systems across DoD to meet enterprise-wide Digital Learning Modernization reforms that the DoD Chief Management Office directed. \n\n9. Enhance Joint\/Coalition exercises with ADL -- Demonstrate the efficient and effective use of (a) digital learning technologies and (b) learning analytics in large scale military exercises such as Aurora, Global Medic, and Bold Quest.  \n\n10. Mitigating Flash Software End-of-Life -- Complete final year of this project, which was a response to the Adobe Flash software end-of-life. Help facilitate DoD’s efficient transition of more than 10,000 Flash-based e-courses and set the foundations for learning technology modernization (e.g., metadata). This year’s work primarily involves dissemination of best practices, coordination, and advice to DoD leadership. \n\n11. Update Distributed Learning Policy and Guidance -- Continue to conduct research to inform Defense policy guidance on emerging distributed learning standards or implementation issues (e.g., learner data privacy). Continue to coordinate with the Defense ADL Advisory Committee to incorporate new requirements into existing Defense policy, such as new content metadata in support of the Enterprise Course Catalog. \n\n12. Competency-Based Learning Enterprise Capability -- Continue to develop the learning methods and technology to enable interoperable, enterprise-wide competency-based learning; conduct testing with Air Force and Army stakeholders. \n\n13. Federal Identity Management -- Identify and help implement the best practices for “Identity Management” (i.e., safely associating someone’s personal identity with his\/her system access and generated data) across different training and education technologies. Work involves implementing guidance from the Federal Government's Identity, Credential, and Access Management project (see M-19-17) as well as other industry best practices. Conduct testing with the Defense Counterintelligence and Security Agency. \n\n14. Cultivating Learning Science to Improve Readiness -- Investigate the best practices for the design, delivery, and management of distributed learning at large scales including pedagogy, workforce, and governance. This work complements the technical work described above by defining the associated organizational processes needed to execute the technology effectively.\n\n15. Defense Distributed Learning Requirements -- Conduct the next cycle of periodic stakeholder requirements collection to define existing gaps and future needs for Defense distributed learning. Produce an updated report.\n\n16. Distributed Secure Live-Virtual and Constructive (LVC) Air Combat System Training Capability -- The $8.723 million increase in FY20 reflects a Congressional addition to further develop a Secure LVC Advanced Training Environment that will support air combat training for 4th and 5th generation platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.765"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.765"
                                            },
                                            "Text": {
                                                "val": "1. Enterprise Course Catalog -- Consolidate distributed learning course listings to a single Defense-wide training and education course catalog, accessible through a single web-based portal. Facilitate transition to full operational capability in collaboration with the Office of Personnel Management USALearning and other Defense stakeholders. This work directly supports DoD Chief Management Office–directed reforms (“Digital Learning Modernization”).\n\n2. Enterprise Learner Record -- Continue work from FY20 to inform and establish operational capabilities and policies for the security, privacy, and interoperability of Defense-wide learning and development records. Demonstrate initial operational capability. This work directly supports DoD Chief Management Office–directed reforms  (“Digital Learning Modernization”) and aligns with White House Interoperable Learner Record efforts.\n\n3. Learning Services Ecosystem -- Continue to develop the technology infrastructure for the larger “learning ecosystem” (i.e., the Total Learning Architecture project); conduct pilot testing. This work indirectly supports DoD Chief Management Office reforms by providing the foundational data interoperability fabric for digital learning software systems.\n\n4. Microlearning Mobile-Learning Platform -- Complete final large-scale testing and transition the fully operational capability for a Defense-wide microlearning platform that allows taking advantage of \"white space\" for training\/education (PERvasive Learning System [PERLS], see Issue Paper INV-11548). Final R&D project year. \n\n5. Enhance Joint\/Coalition exercises with ADL -- Continue to incrementally enhance large-scale training exercises through (a) digital learning technologies and (b) learning analytics. Coordinate specific testing events with Joint Knowledge Online and Combatant Commands.  \n\n6. Update Distributed Learning Policy and Guidance -- Continue to coordinate with the Defense ADL Advisory Committee to incorporate new requirements into existing Defense policy, as required."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in FY2021 (-$9.7 million) reflects Defense-Wide Review reform initiatives. Reduction will consolidate leased facilities and reduce contractor support for the following areas: learning analytics, microlearning mobile-learning platform, enterprise learner record repository, and DoD learning-at-scale strategy. The reframed program will sustain technical assessment of, and limited R&D for, learning data standards and interoperability (across DoD, Federal Government, and industry), Digital Learning Modernization reforms, DoD distributed learning requirements collection, and the learning services ecosystem. It will also retain the program’s Department-wide distributed learning technology and policy advisory role focused on ensuring technology\/data standards alignment across DoD. The FY2021 reduction is offset by an administrative zero-sum transfer ($3.0 million) from PE 0804767D8Z (i.e., Combatant Commander Exercise Engagement and Training Transformation [CE2T2] from The Joint Staff [TJS])."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}