{
    "id": "2021-Navy-PB-1319-MJBOOK-0-0-744c7ee94c2cc798fbfd935e35baade9caa8a86b67e6f22ecedd75220314848f-11",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602747N"
        },
        "ProgramElementTitle": {
            "val": "Undersea Warfare Applied Res"
        },
        "R1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "75.998"
            },
            "CurrentYear": {
                "val": "98.075"
            },
            "BudgetYearOne": {
                "val": "56.397"
            },
            "BudgetYearOneBase": {
                "val": "56.397"
            },
            "BudgetYearTwo": {
                "val": "57.518"
            },
            "BudgetYearThree": {
                "val": "58.697"
            },
            "BudgetYearFour": {
                "val": "59.876"
            },
            "BudgetYearFive": {
                "val": "61.072"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Undersea Warfare Applied Research Program Element (PE) funds applied research efforts in undersea target detection, classification, localization, tracking, and neutralization. Associated efforts focus on new Anti-Submarine Warfare (ASW) operational concepts that promise to improve wide-area surveillance, detection, localization, tracking, and attack capabilities against quiet adversary submarines operating in noisy and cluttered shallow water environments. Related efforts are aimed at leveraging technologies that will protect the country's current capital investment in surveillance, submarine, surface ship, and air ASW assets. Research focused on understanding the impacts on marine mammals of manmade underwater sound is also conducted in the PE. \n\nThe activities described in this PE address future Navy and Marine Corps capabilities needed to maintain maritime superiority and ensure national security. Targeted capabilities are based on input from Naval Research Enterprise stakeholders including combatant commands, Office of the Chief of Naval Operations (OPNAV) and Headquarters Marine Corps and are designed to exploit breakthroughs in science and technology in order to deliver maximum undersea warfighting benefit to our sailors and marines. \n\nToday's Sailors and Marines are enabled by naval Science and Technology (S&T). Since 1946, the Office of Naval Research (ONR) has fostered scientific research related to the maintenance of maritime superiority and national defense.  ONR manages the Department of the Navy's (DON) portfolio of naval Basic and Applied research, and Advanced Technology Development investments to ensure naval forces can effectively deter conflict, but when called upon, fight, win and come home safe. Current investments hedge against uncertainty, providing solutions to commanders today, and options for the future. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy through research priorities set by the Chief of Naval Research, coordinated across the Naval Research Enterprise (NRE), and outlined in the Naval R&D Framework. \n\nThis Program Element (PE) funds Applied Research, which is the systematic study to understand the means to meet a recognized and specific need. Most of the work in this PE can be classified between Technology Readiness Level (TRL) 2 (technology concept and\/or application formulation) and TRL 4 (component and\/or breadboard validation in laboratory environments).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "78.049"
                },
                "CurrentYear": {
                    "val": "57.075"
                },
                "BudgetYearOne": {
                    "val": "57.197"
                },
                "BudgetYearOneBase": {
                    "val": "57.197"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "75.998"
                },
                "CurrentYear": {
                    "val": "98.075"
                },
                "BudgetYearOne": {
                    "val": "56.397"
                },
                "BudgetYearOneBase": {
                    "val": "56.397"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.051"
                },
                "CurrentYear": {
                    "val": "41.000"
                },
                "BudgetYearOne": {
                    "val": "-0.800"
                },
                "BudgetYearOneBase": {
                    "val": "-0.800"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "41.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.051"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.800"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.800"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Schedule: Not applicable.\n\nTechnical: Not applicable.\n\nFunding:  No significant change."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Undersea Warfare Applied Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "56.691"
                        },
                        "CurrentYear": {
                            "val": "57.075"
                        },
                        "BudgetYearOne": {
                            "val": "56.397"
                        },
                        "BudgetYearOneBase": {
                            "val": "56.397"
                        },
                        "BudgetYearTwo": {
                            "val": "57.518"
                        },
                        "BudgetYearThree": {
                            "val": "58.697"
                        },
                        "BudgetYearFour": {
                            "val": "59.876"
                        },
                        "BudgetYearFive": {
                            "val": "61.072"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This PE funds applied research efforts in undersea target detection, classification, localization, tracking, and neutralization. Associated efforts focus on new ASW operational concepts that promise to improve wide-area surveillance, detection, localization, tracking, and attack capabilities against quiet adversary submarines operating in noisy and cluttered shallow water environments. Related efforts are aimed at leveraging technologies that will protect the country's current capital investment in surveillance, submarine, surface ship, and air ASW assets."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Anti-Submarine Warfare (ASW) Distributed Search"
                                    },
                                    "Description": {
                                        "val": "ASW Distributed Search focuses on the development of technologies for the tactical search for undersea targets ranging from hours to weeks, using automated sensor systems deployed around operating areas, including along key transit routes to protect naval\/maritime forces, around temporarily fixed sea base regions and naval force operating areas, or around fixed defensive regions and areas of interest, such as key US\/Allied ports. \"Search\" is conducted in concentrated areas, typically exploiting cues received from surveillance systems. The objective is to develop rapidly deployable systems employing automated detection and classification capabilities for use in both shallow and deep water operating environments. Related efforts include the development of distributed systems; Unmanned Undersea Vehicle-based and affordable off-board deployable sensing systems employing persistent detection concepts and components; and active acoustic sensing and processing techniques, navy-unique transduction and underwater networking technologies. These efforts provide an extended reach of organic platform-based systems through the use of new sensor concepts, improved materials for advanced sensors, optimized deployment, employment, and automated operation of distributed sensor fields."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.034"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.455"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Warfare Applied research is focused on technologies that enable both platform-based and off-board systems to detect and classify the ultra-quiet, low-Doppler submarine threat in complex operating environments. The capability to provide non-covert Anti-Submarine Warfare (ASW) tactical search for both shallow and deep water operational areas against all submarine threats requires improved sensor technology to extend the capabilities of platform-based systems; innovative sensor technology for off-board and rapidly deployable systems; characterization of and signal processing to control reverberation, clutter, and noise; characterization of target radiation and scattering physics for all threat submarines; physics-based detection and classification algorithms with automation where possible; and knowledge and exploitation of the complex operational environment.  Continue sensor development and signal processing-related research which focuses on multistatic active sonar concepts that operate in convergence zone environments, high duty cycle active sonar, and developing concepts for next-generation active sonar system automation.  Initiate non-acoustic, orthogonal concepts that complement and augment active sonar concepts. \n\nUndersea Warfare\nConceptualize and perform laboratory measurements, field measurements, and theoretical\/numerical analysis focused on technologies that enable both platform-based and off-board systems to detect and classify the ultra-quiet, low-Doppler submarine threats in complex operating environments such as:  advancing sensing, onboard processing\/decision making, and information sharing capabilities to enable multi-static ASW using multiple autonomous, coordinated and cooperating autonomous underwater vehicles (AUVs); the development of a new types of underwater sound sources; and efforts that capitalize on structural acoustic features of unmanned underwater vehicles (UUVs) and advance sonar design, sensing, and processing\/decision making to enable high performance detection and classification of adversarial UUVs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.443"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.443"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Active Sonar: Conduct development of advanced signal and information processing for high duty cycle active sonar. \nFurther development of concepts for next-generation active sonar system automation, leveraging the latest advances in machine learning and artificial intelligence. Initiate non-acoustic, orthogonal concepts that complement and augment active sonar concepts\n\n- Sensors: Maintain applied research in improved sensor technology to extend the capabilities of platform-based systems as well as innovative sensor technology for off-board and rapidly deployable systems\n\n- Signal Processing: Conduct research in characterization of and signal processing to control reverberation, clutter, and noise; characterization of target radiation and scattering physics for all threat submarines; physics-based detection and classification algorithms with automation where possible; and knowledge and exploitation of the complex operational environment."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2020 to FY 2021 is due to reduced investment in the development of advanced sensing, onboard processing\/decision making, and information sharing capabilities to enable multi static Anti Submarine Warfare (ASW) using multiple autonomous, coordinated and cooperating Autonomous Underwater Vehicles."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Submarine Warefare (ASW) Precision Localization"
                                    },
                                    "Description": {
                                        "val": "ASW Precision Localization focuses on the development and demonstration of technologies which use information from surveillance or search systems to determine an area of uncertainty (AOU) relative to target range, bearing, and depth adequate to handoff to an attack system. Precision Localization employs non-acoustic techniques such as magnetic and optical sensing to highly localize submerged threats. The objective is to increase magnetic sensor range and robustness, enable deployment on Unmanned Air Vehicles (UAVs), and increase optical sensing search rates. Efforts include the development of non-traditional tracking and advanced magnetic and electric field sensors and processing. These technologies will provide a decreased AOU size thus enabling the effective use of smaller, more versatile torpedoes as well as increased performance gain in detection, targeting, tracking\/trailing, and homing via target acquisition and covert prosecution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.469"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.468"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Shift focus from classical magnetic and electric field sensing toward other modalities and sampling approaches. Investigate alternative methods for Precision Localization leveraging magnetic and electric field sensing technologies and incorporating alternative technologies and approaches. Execute research into novel methods to develop smaller and power efficient, high performance magnetic, electric field and novel sensors. Pursue research on advanced concepts for processing arrays of independent sensors to create adaptive information theoretic sensor systems. Continue research into remote methods of sensing target signatures. Expand Optical Sensing research related to critical Science and Technology (S&T) for Precision Localization. Execute research to better exploit the information capacity available in photonic systems toward development of higher performance optical sensors. Pursue information theoretic optical sampling and telemetry characteristics to better support sensor performance and data integrity. Extend the effectiveness that photonic sensors operate across the air-water interface. Extend the distance optical sensors can effectively operate within the water column."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.469"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.469"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Precision Localization: Conduct research on advanced sensing modalities and sampling approaches. Investigate alternative methods for Precision Localization leveraging magnetic and electric field sensing technologies and incorporating alternative technologies and approaches. \n\n- Sensors: Further research into novel methods to develop smaller and power efficient, high performance magnetic, electric field and novel sensors. Conduct research on advanced concepts for processing arrays of independent sensors to create adaptive information theoretic sensor systems. Initiate applied research into information theoretic optical sampling and telemetry characteristics to better support sensor performance and data integrity; improve the effectiveness of photonic sensor operations across the air-water interface; and extend the distance optical sensors can effectively operate within the water column.\n\n - Remote and Optical Sensing: Maintain research into remote methods of sensing target signatures. Continue research on optical sensing for precision localization and to better exploit the information capacity available in photonic systems to increase sensor performance. \n\n- Magnetic and Electric sensing: Concluded applied research on classical magnetic and electric field sensing."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Submarine Warfare (ASW) Surveillance"
                                    },
                                    "Description": {
                                        "val": "ASW Surveillance focuses on improving detection, classification, and localization capabilities in large ocean areas relative to the capabilities of existing ASW surveillance systems. The related technologies support the conduct of covert, wide-area surveillance ranging from one day to six months. The objectives are to develop and demonstrate technologies that provide clandestine indications and warnings in far forward and contested operating areas, and in complex operational environments against all submarine threats, including new threats with unknown target signatures and tactics. Covertness implies use of non-observable platforms and\/or deployed automated sensors employing passive sonar, or other non-detectable methods. The surveillance process includes initial detection and classification. Efforts include the development of Unmanned Undersea Vehicle-based and affordable, off-board deployable sensing systems employing a wide variety of surveillance concepts and components. These efforts focus on alternative detection phenomena, vector\/tensor sensors, automated acoustic processing, more compact and longer lasting power sources, and high bandwidth, acoustic communications links."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.316"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.288"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Signal processing related research that focuses on combining information from multiple arrays in a distributed field that exploit new acoustic signatures, improve detection of weak acoustic sources obscured by clutter, and new sensor and signal processing concepts that exploit underwater acoustic propagation physics to improve the detection of weak acoustic sources in high clutter environments. Initiate signal processing related research to develop artificial intelligence technology providing optimized sonar system line-ups that adjust themselves in real time to the current undersea environment. Begin to investigate applicable non-acoustic methods of detection and classification of ultra-quiet, low-Doppler submarines in complex operating environments.\n\nLaboratory measurements, field measurements, and theoretical\/numerical analysis leading to non-platform-based and clandestine systems to provide ASW clandestine indications and warnings in far-forward and contested areas such as:  new sensor concepts to provide improved performance in smaller packages; automated passive acoustic and non-acoustic detection and classification algorithms; undersea communications; acoustically quiet UUV propulsion; and knowledge and exploitation of the complex operational environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.617"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.617"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Sonar: Conduct signal processing related research to develop artificial intelligence technology providing optimized sonar system line-ups that adjust themselves in real time to the current undersea environment. \n\n- Sensors: Conduct studies to improve performance of acoustic vector sensors, vector magnetometers, electrochemical sensors and three-axis magnetometers.\n\n- Underwater Vehicle Propulsion: Conduct development of approaches for fluid-loaded elastic structures and soft-bodied unmanned underwater vehicle propulsion. \n\n- Signal Processing: Further investigate applicable non-acoustic methods of detection and classification of ultra-quiet, low-Doppler submarines in complex operating environments. Initiate applied research to exploit recent advances in basic \/ theoretical computer science to efficiently implement signal processing and artificial-intelligence algorithms using mathematical approaches including randomized methods."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Marine Mammals"
                                    },
                                    "Description": {
                                        "val": "The goal of the Marine Mammals and Biology activity focus is to better understand and characterize the effects of underwater sounds produced by Navy acoustic sources on marine mammals. Studies address characterizing marine mammal and their ecosystems, quantifying effects of sound exposure on marine mammals, and improving the ability to monitoring and detect marine mammals in the open ocean. Research results supports Navy environmental compliance information needs and facilitates acquiring Letter of Authorizations from NOAA regulators that enable all Navy training and testing operations, and the development of appropriate state-of-the-art mitigation measures. \n\nThe marine mammals research conducted in this Program Element (PE) represents part of a total effort executed in coordination with complementary research performed in PE 0602435N Ocean Warfighting Environment Applied Research."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.464"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.464"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extramural Marine Mammals and Biology - Areas of research include monitoring and detection, integrated ecosystem, and effects of sound on marine mammals. \n\nIntegrated Ecosystem Research: Further research using animal tagging and passive acoustic monitoring to study behaviors, movement and distribution of marine mammals relative to key environmental properties (biotic and abiotic). \n\nEffects of Sound: Conduct research on behavioral effects to potentially population-level consequences of sound exposure on marine life. Initiate research to characterize the gas management and kinetics (stores and use) in marine mammals. Conduct research into the mechanisms that enable marine mammals to dive to deep depths for long durations while mitigating, if not avoiding, health threats. Conduct research to advance our understanding of sound reception mechanisms in mysticetes (large whales) will require a thorough exploration of the anatomy surrounding the ear and the whole head combined with modeling sound propagation through various tissues of whale heads and\/or bodies. Continue research to develop an understanding of the natural variation of stress markers, better understand and characterize acute and chronic effects of the stress response on individuals and populations of marine mammals. Conduct research on potential effects of Navy sources on marine mammal behavior, life functions (e.g. feeding, breeding, migrating), vital rates (e.g. adult survival, reproduction), and population level effects. Understanding the effects of naval activities on species or stocks of marine mammals, including effects on annual rates of recruitment and survival. \n\nMonitoring and Detection: Continue research and development of technology for detection, classification, and localization of marine mammals. \n\nModels & Databases: Continue research to provide tools to support environmental compliance efforts and decision-making related to how marine mammals are affected by anthropogenic sounds. Initiate research using increase in funds to characterize and quantify the cumulative effects of multiple stressors on marine mammal populations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.465"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.465"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2021 efforts include applied research in areas including monitoring and detection, integrated ecosystem, and effects of Anti-Submarine Warfare (ASW) sonar on marine mammals. \n\n- Passive Acoustic Monitoring: Further research efforts on passive acoustics and other technology supporting wide area surveillance, including the development and testing of new autonomous hardware platforms and signal processing algorithms for detection, classification, and localization of marine mammals. Maintain research using animal tagging and passive acoustic monitoring to quantify behaviors, movement and distribution of marine mammals relative to key environmental properties and sonar exposure, both incidental and experimental. \n\n- Sonar Exposure: Conduct research to quantify the behavioral effects to potentially population-level consequences of sonar exposure on marine life to develop risk criteria for Navy's sound effects modeling, and develop quantitative inputs for modeling biologically significant effects on marine mammal populations. Navy sound effects modeling is used in Environmental Impact Statements, and subsequent Letters of Authorization issued by the NOAA regulator that enable all Navy ASW exercises and testing. \n\n- Marine Mammals: Further research to design equipment and capability to quantify the gas management and kinetics in marine mammals to evaluate the mechanisms that enable marine mammals to dive to deep. \n\n- Sound Reception Mechanisms in Whales: Pursue research to advance our understanding of sound reception mechanisms in large whales including the anatomy surrounding the ear and the whole head to improve and validate finite element models of sound propagation through various tissues. \n\n- Marine Mammal Behavior: On going research into the stress response of marine mammals to ASW sonar exposure with an emphasis on quantifying the effects of prolonged exposure effects on immune system suppression, reproductive failure, accelerated aging, and slowed growth. Conduct research on potential effects of Navy Anti-Submarine Warfare (ASW) sonar sources on marine mammal behavior, life functions, vital rates, and population level effects. The goal is to understand and quantify the effects of naval activities on species or stocks of marine mammals, including effects on annual rates of recruitment and survival.\n \n- Environmental Compliance: Maintain research to provide tools to support environmental compliance efforts and decision making related to how marine mammals can be affected by anthropogenic sounds."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Undersea Weaponry"
                                    },
                                    "Description": {
                                        "val": "Undersea Weaponry focuses on the development of technologies for current and next-generation, offensive and defensive weapons capable of engaging submarines, surface ships and threat torpedoes. Specific efforts focus on increasing probability of kill and probability of counter-kill by improving sensor performance, engagement tactics, vehicle propulsion and warhead lethality. New weapon and delivery concepts are being assessed.\n\nDetailed information regarding Undersea Weaponry Applied Research program plans and objectives is at a higher classification."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.408"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied research related to critical Science and Technology (S&T) for supercavitation, advanced warheads, new torpedo fuel formulations, small-scale weapon concepts, and propulsion systems for undersea vehicles and platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.403"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.403"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Undersea Weaponry: Conduct applied research related to critical Science and Technology (S&T) for advanced warhead and fuzing concepts, characterization of torpedo fuel and new fuel formulations, small-scale weapon concepts, dynamic testing of vehicles to assess kinematics, and propulsion systems for undersea vehicles and platforms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "19.307"
                        },
                        "CurrentYear": {
                            "val": "41.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "60.307"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Efforts for Undersea Warfare Applied Research"
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "19.307"
                                        },
                                        "Text": {
                                            "val": "Efforts for Undersea Warfare Applied Research"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy and academia submarine partnerships"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Navy and academia submarine partnerships."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Machine discovery and invention"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Machine discovery and invention."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Instrumented tow cable"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research for Instrumented low cable."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy undersea warfare science and technology strategy"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Navy undersea warfare science and technology strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Undersea sensing and communications"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Undersea sensing and communications."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energetics and warhead technology development"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Energetics and warhead technology development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous undersea robotics systems"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Autonomous undersea robotics systems."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}