{
    "id": "2021-DefenseThreatReductionAgency-PB-0400-JBOOK-f078a1cee4e23a7621f52240a2e9669fd5489baa3afbbffc50d48dab709efc36-0",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DTRA-U_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601000BR"
        },
        "ProgramElementTitle": {
            "val": "DTRA Basic Research"
        },
        "R1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "325.307"
            },
            "PriorYear": {
                "val": "36.148"
            },
            "CurrentYear": {
                "val": "26.000"
            },
            "BudgetYearOne": {
                "val": "14.617"
            },
            "BudgetYearOneBase": {
                "val": "14.617"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "11.488"
            },
            "BudgetYearThree": {
                "val": "11.237"
            },
            "BudgetYearFour": {
                "val": "11.361"
            },
            "BudgetYearFive": {
                "val": "11.584"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Basic Research for Countering WMD project, as the nation’s primary basic research portfolio dedicated to countering weapons of mass destruction (CWMD), is a core strategic investor in future scientific and technological progress across the full spectrum of the Defense Threat Reduction Agency's (DTRA) mission areas. This project concentrates on high risk, high-payoff basic research, leveraging world-class expertise in academia, government, and industry, to increase the foundational body of scientific knowledge supporting DTRA’s Applied Research and Advanced Technology Development projects.\n\nThis project aligns with DTRA’s strategic objectives that support policy and planning guidance from the Executive Office of the President, the Department of Defense (DoD), and the broader WMD threat reduction and consequence management communities. The portfolio addresses this through fundamental research focused on making revolutionary scientific discoveries relevant to emerging and future Counter Weapons of Mass Destruction and Improvised Threat Network (CWMDITN) challenges. Program managers drive interdisciplinary portfolios primarily drawing from physics, chemistry, biology, mathematics, and information and network sciences to:  train the next-generation workforce; advance the fundamental knowledge and understanding in the sciences; promote university research to support the CWMDITN mission; and facilitate transition of research to support our warfighters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "37.023"
                },
                "CurrentYear": {
                    "val": "26.000"
                },
                "BudgetYearOne": {
                    "val": "25.500"
                },
                "BudgetYearOneBase": {
                    "val": "25.500"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "36.148"
                },
                "CurrentYear": {
                    "val": "26.000"
                },
                "BudgetYearOne": {
                    "val": "14.617"
                },
                "BudgetYearOneBase": {
                    "val": "14.617"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.875"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-10.883"
                },
                "BudgetYearOneBase": {
                    "val": "-10.883"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.875"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.333"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.333"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense Wide Review (DWR) Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-10.550"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-10.550"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease in FY 2021 from the President's Budget submission is the result of:\n(1) a realignment of funds to program element 0603160BR for investment in the Automated Solicitation Proposal Management System (ASPMS), a contract and grant management system, and\n(2) Defense-Wide Review (DWR) adjustment of -$10.550 million resulting from reductions to DTRA’s lowest priority RDT&E programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RU"
                    },
                    "ProjectTitle": {
                        "val": "Basic Research for Countering WMD"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "325.307"
                        },
                        "PriorYear": {
                            "val": "36.148"
                        },
                        "CurrentYear": {
                            "val": "26.000"
                        },
                        "BudgetYearOne": {
                            "val": "14.617"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.617"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "11.488"
                        },
                        "BudgetYearThree": {
                            "val": "11.237"
                        },
                        "BudgetYearFour": {
                            "val": "11.361"
                        },
                        "BudgetYearFive": {
                            "val": "11.584"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Basic Research for Countering WMD project, as the nation’s primary basic research portfolio dedicated to countering weapons of mass destruction (CWMD), is a core strategic investor in future scientific and technological progress across the full spectrum of the Defense Threat Reduction Agency's (DTRA) mission areas. This project concentrates on high risk, high-payoff basic research, leveraging world-class expertise in academia, government, and industry, to increase the foundational body of scientific knowledge supporting DTRA’s Applied Research and Advanced Technology Development projects.\n\nThis project aligns with DTRA’s strategic objectives that support policy and planning guidance from the Executive Office of the President, the DoD, and the broader WMD threat reduction community. The portfolio addresses this guidance through capability enhancements, projects, and Science and Technology (S&T) investments that support CWMD and reduce global nuclear dangers. Specifically, they include: accelerating the development of standoff radiological\/nuclear detection capabilities; researching countermeasures and defenses to non-traditional agents; securing vulnerable materials; developing an in-depth understanding of the capabilities, values, intent, and decision making of potential adversaries, whether they are states, networks, or individuals; defeating WMD agents; researching biologically-based and inspired materials for DoD applications; and leveraging science, technology, and innovation through domestic and international partnerships and agreements.\n\nThis project solicits, coordinates, and conducts research to build a robust, forward-looking fundamental research portfolio targeting strategic, mission-focused, basic research with high potential impact for CWMD. The research projects are selected for scientific merit, technical quality, and the potential for innovation.  Each research project offers opportunities to expand the knowledge base to help the warfighter, to bring to bear new science solutions with a fresh approach, or to leverage revolutionary approaches to technical surprise, building a foundation for future CWMD solutions. This research will enable new capabilities to: better understand the environment, threats and vulnerabilities; control, defeat, disable, and\/or dispose of WMD threats; and safeguard the force by managing consequences."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Project RU: Basic Research for Countering WMD"
                                    },
                                    "Description": {
                                        "val": "Project RU funds the exploration and discovery of fundamental scientific knowledge related to DTRA’s CWMD mission by research performers from academia, government, and industry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "36.148"
                                            },
                                            "Text": {
                                                "val": "- Manage and steer the CWMD Basic Research portfolio, comprised of approximately 150 active basic research awards on three- to five-year cycles. This portfolio continues to address DoD CWMD science and technology requirements, supporting specific priorities focused on current and emerging areas of interest.\n- Support collaborative relationships within the scientific community and ensure progress toward technical objectives through an annual technical review of each grant to assess scientific advancement.\n- Support the development of world-class talent in WMD research at universities and laboratories to foster the future Science, Technology, Engineering, and Mathematics (STEM) workforce.\n- Conduct an Internal Portfolio Review to assess the focus and scope of the portfolio related to CWMD challenges and assess the coordination of CWMD basic research across the DoD mission space and the broader basic research community to avoid duplication and ensure successful partnerships."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.000"
                                            },
                                            "Text": {
                                                "val": "- Down-select and award two cooperative agreements to initiate the first DTRA basic research university partnerships: Material Science in Extreme Environments; and Interaction of Ionizing Radiation with Matter\n- Establish partnership with two teams of universities and laboratories to improve multidisciplinary collaborations, increase engagement with the academic community, and develop the CWMD Science, Technology, Engineering, and Mathematics (STEM) workforce.\n- Support the long-term development of a world-class STEM workforce focused on CWMD research.\n- Conduct an Internal Portfolio Review to assess the focus and scope of basic research related to CWMD challenges. Assess DTRA’s coordination of CWMD basic research across DoD and the broader basic research community."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.617"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.617"
                                            },
                                            "Text": {
                                                "val": "- Establish Initial Program Plans with the two university partnerships to map the first 12 months of research in the areas of: Material Science in Extreme Environments; and Interaction of Ionizing Radiation with Matter\n- Address basic research gaps and warfighters’ emerging technical needs. \n- Support the long-term development of a world-class STEM workforce focused on CWMD research. \n- Promote university research to support Counter Weapons of Mass Destruction and Improvised Threat Network (CWMDITN) challenges."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2020 to FY 2021 is the result of:\n(1) a realignment of funds to program element 0603160BR for the Automated Solicitation Proposal Management System (ASPMS), a contract and grant management system, for Agency cost sharing with CBDP, and\n(2) Defense-Wide Review (DWR) adjustment of -$10.550 million resulting from reductions to DTRA’s lowest priority RDT&E programs."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Procurement methods include competitive selection awards through university partnerships, DTRA’s Broad Agency Announcement, and collaborative funding through other organizations."
                        }
                    }
                }
            ]
        }
    }
}