{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-35",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604055D8Z"
        },
        "ProgramElementTitle": {
            "val": "Operational Energy Capability Improvement"
        },
        "R1LineNumber": {
            "val": "67"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "39.788"
            },
            "PriorYear": {
                "val": "44.362"
            },
            "CurrentYear": {
                "val": "64.900"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2021 - FY 2025  funds were re-aligned for higher Department priorities under the Defense Wide Review (DWR)."
        },
        "ProgramElementMissionDescription": {
            "val": "The U.S. military’s dependence on liquid fuel creates an enormous logistics burden that exposes forces to enemy attack and diverts operational resources from other mission areas to support delivery. GAO cited the department for its lack of (1)”visibility and accountability for achieving fuel reduction, (2) incentives and a viable funding mechanism to invest in the implementation of fuel demand reduction projects, and (3) guidance and policies that addressed fuel demand.”\n\nThe mission of this program element (PE) since these findings in 2012 has been to fund innovation to improve the Department of Defense’s (DoD) operational effectiveness via targeted operational energy science and technology (S&T) investments.  OECIF fostered innovation to improve operational energy performance in two ways:  first, to develop operational energy technologies and practices that improved the agility and resiliency of our ability to supply forces the energy they need; and second, to establish momentum for components to continue those innovations through ongoing collaboration with the Services, Joint Staff and Combatant Commands.  \n\nOECIF funds served as “seed money” to start or consolidate promising innovations to serve as proof of technological feasibility, with the goal of transitioning science and technology (S&T) into the acquisition process. The focus is on challenges or opportunities that are not Services specific, but rather cross Services, platforms and domains.      \n\nOECIF investments also highlighted areas of Departmental level interest or buy down risk to enable service-level commitments. The primary focus on 6.3 Investments facilitated joint solutions and incentivized cross Service collaboration to transition the acquisition valley of death. OSD investment (37%) in conjunction with investment from DLA, Army, Navy, and USMC of 22% represents almost 60% of the DoD-wide OE 6.3 investment budget.  The Air Force contributes about 40% with 55% of their contribution focused on high-cost engine testing and architecture for high power systems.  \n\nOECIF investments are directly focused on the capability needs expressed in the NDS.  Our ability to predict, detect, and mitigate an adversary’s ability to deny tactical and operational formations the energy needed to prosecute operations at tempo and scale throughout every phase of warfare and to enable freedom of action at all echelons, unencumbered by the challenges of delivering energy across an unbounded multi-domain and contested battlespace.  \n\nTo achieve these goals, the selection process for investments relied on inputs from the Combatant Commands and Services each year through a competitive process.  The OECIF decision process supports the National Security Strategy for energy dominance, all three National Defense Strategy priorities, the DoD Energy Strategy, Department Modernization Priorities, and the needs of the Joint Force and warfighters.  The projects compete on the basis of greatest impact to the warfighter, criticality of operational need, least technical risk, least cost, and the shortest time to employment.  \n\nOECIF success has been measured by its impact.  The overall aim has been to improve the agility, resilience, lethality, readiness, and operational effectiveness of the Joint Force. The key metric is the successful transition of technology from S&T to an acquisition or direct insertion into operations.  Over 75% of OECIF investments have successfully transitioned to support the warfighter.  \n   \nOECIF’s efforts have complimented, not replaced or duplicated, Services investments and have provided a continuingly evolving program to rapidly address new and critical issues arising from emerging threats to our ability to supply the joint force. \n\nExamples of current investments include moving power without mass (power beaming); world-record setting efficiencies for solar power conversion; use of energy scavenging within the warfighting environment, and use of sensors, data analytics and predictive methodologies with the promise of enabling unparalleled operational unpredictability to counter an adversaries “energy denial” operations. Additional leading technologies enabling extended remote operations without resupply through innovations in the use of energy storage, micro-grids, and nuclear power fuel innovation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "45.478"
                },
                "CurrentYear": {
                    "val": "70.536"
                },
                "BudgetYearOne": {
                    "val": "41.261"
                },
                "BudgetYearOneBase": {
                    "val": "41.261"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "44.362"
                },
                "CurrentYear": {
                    "val": "64.900"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.116"
                },
                "CurrentYear": {
                    "val": "-5.636"
                },
                "BudgetYearOne": {
                    "val": "-41.261"
                },
                "BudgetYearOneBase": {
                    "val": "-41.261"
                }
            },
            "AdjustmentDetails": {
                "CongressionalRescissions": {
                    "CurrentYear": {
                        "val": "-10.636"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "5.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.108"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.008"
                                },
                                "BudgetYearOne": {
                                    "val": "-3.337"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.337"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Reduction for Defense Wide Review"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-37.924"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-37.924"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2020, the Congress reduced the program by -$10.636 million for excess growth and provided a program increase of $5.000 million.\n\nFY 2021 included a reduction for higher priority DoD missions and included a Defense-Wide Review (DWR) reduction of $37.924 million.\n."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "455"
                    },
                    "ProjectTitle": {
                        "val": "Operational Energy Capability Improvement"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "39.788"
                        },
                        "PriorYear": {
                            "val": "44.362"
                        },
                        "CurrentYear": {
                            "val": "64.900"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY 2021 - FY 2025 funds  are realigned to higher priority DoD missions resulting from Defense Wide Review."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Operational Energy Capability Improvement Fund (OECIF) incentivizes science and technology (S&T) to promote long-term change in DoD capabilities so they are better aligned with the National Defense Strategy.  OECIF fosters innovation to improve operational energy performance and has two key mission aspects:  first, to develop operational energy technologies and practices that will improve DoD military capabilities or reduce costs; and second, to establish within the military Services institutional momentum to continue those innovations.  OECIF serves as “seed money” to start or consolidate promising operational energy innovation to be sustained by the Services.  Accordingly, OECIF generally emphasizes supporting or establishing programs rather than one-off projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Operational Energy Capability Improvement Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "The Study on the Use of Mobile Nuclear Power Plants for Ground Operations concluded political support is essential in three key areas: nuclear fuel availability, supportive regulatory environment, and advanced reactor designs.  Awarded a Tristructural-Isotropic (TRISO) fuel production subcontract to demonstrate TRISO fuel production at engineering scale.  Invested in Air Force SBIR on strontium based source for terrestrial and space applications."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Developing initial innovation toward an industrial-scale capability to produce TRISO fuel with the capability of producing a variety of kernel sizes and types, and at all levels of enrichment.  This funding allows for initial innovative work to kick-start a larger program necessary to produce necessary quantities of total qualified TRISO by the end of FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Energy Capability Improvement Fund (OECIF)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "39.362"
                                            },
                                            "Text": {
                                                "val": "Fund new OECIF initiatives and continue established efforts.  OECIF will self-fund necessary overhead from the program baseline, approximately $5.000 million annually, to include program management, business reform tools, and strategic partnerships, etc.  \n\nEstablished efforts include:\n• The FY 2013 OECIF project, Tactical Microgrid Standardization, will submit a draft Military Standard (MIL-STD) to the Defense Standardization Program Office for approval.  A multi-national demonstration is planned for inter-operability among the North Atlantic Treaty Organization (NATO) partners showing applicability of the standard as part of the Capable Logistician 2019 exercise.\n\n• FY 2014 OECIF projects are focused on analytical methods and tools for considering operational energy in DoD planning and decision processes.  Analytic tools were developed to consider energy vulnerability during the Joint Planning Process. Spring warfighter evaluations and training are planned.  DoD-wide model, scenario, and data updates continue with new model versions scheduled to be released in October 2019.  Analytical tool investment underpins the Congressionally mandated energy key performance parameter in addition to warfighting battlefield tools.\n\n• FY 2015 OECIF tactical vehicle improvement projects completed the final year of OECIF funding.  One effort completed a critical milestone for procurement testing and successfully identified Program Manager Terminal High Altitude Area Defense (PM THAAD) as its first transition partner.  A system demonstration is planned for FY 2019.  Battlefield electrification yields increased operating longevity in addition to decreased mean-time between failure and significantly less frequent refueling requirements.\n\n• FY 2016 OECIF projects focused on improving the operational energy performance of unmanned aerial, surface, undersea and ground vehicles.  Multiple projects will conclude in FY 2019 with efforts resulting in improved engine design, energy hybridization for increased performance capabilities, and fuel efficiencies.  These projects are expected to transition in FY 2020-2021.\n\n• FY 2017 OECIF projects support two main topics:  Thermal and Power Management Technologies for High Pulse Power Systems; and Wireless Transmission of Energy in the Far-Field.  These investments focus on the energy and power sub-systems that enable directed energy weapons as well as future warfighting concepts with unlimited power and communications.  Efforts are demonstrating early success and pushing technology forward across wireless transmission in far-field, laser beaming, space solar, and photovoltaic testing.\n\nIncreased lethality of directed energy weapons is enabled by advanced power and thermal innovation in: \n• Lab-based prototypes of thermal management systems to bolster mission-success of DEW systems;\n• Hybrid energy storage module units to enable continuous firing of pulse load capability and reduced logistics; and\n• Energy management systems for high power payloads that increase fuel savings as well as improve power and thermal transient capability.\n\nResiliency is bolstered by far field wireless energy development of: \n• Alternative manufacturing methods for lightweight flexible high efficiency III-V solar cells that provide a breakthroughs in cost reduction as well as decreased production time for the next generation space solar concepts;\n• Alternative solar cell materials, such as perovskites that increase mobile power generation capability by a factor of three as well as decreasing weight and increasing efficiency; and\n• Mobile power meters for preventative maintenance and agile logistics.\n\nInnovative operational concepts can be realized with new battlefield technologies including: \n• Advances in novel space solar collection and wireless power beaming technologies which lead to increased energy resiliency and assured energy supply;\n• Studies on space solar on energy resupply capability that provide knowledge towards future investment strategies;\n• Laser light power beaming technologies including the receiver, transmitter and safety system that enable infinite persistence communications and ISR assets;\n• Millimeter wave power beaming technologies including rectenna and sterling engine prototypes to enable persistent operations; and\n• Free-space optical communication system that provides a highly directional, jam-resistant, secure communications via an energy stream.\n\nFinally, business reform is driven by the development of an artificial intelligence portfolio analysis tool that will speed operational energy S&T developments and improve investment decisions.\n\nInnovative advances in power and thermal management as well as wireless transmission of energy underpin lethal warfighting capability and are expected to contribute to increased power generation and distribution capabilities, reduced energy supply line burdens, and new autonomous power paradigms.  The breadth of applications include directed energy \/ electronic weaponry, persistent autonomous systems, power generation and distribution on the ground and in space, and advanced communication systems. \n\n• FY 2018 OECIF projects are one-year studies to identify operational energy S&T gaps in the near-, mid-, and far-term.  The studies will deliver community vetted, operational energy investment roadmaps.  Once these projects are completed, they will be the pathway to feed the next operational energy strategy and they will inform the topic selection for FY 2020 OECIF proposals.\n\n• FY 2019 OECIF projects directly support \"Enhanced Energy Storage to Improve Lethality and Warfighting Performance\" consistent with the National Defense Strategy.  Investments focus on standardization, safety, and advanced performance of energy storage solutions with consideration for business reform opportunities. \n\nBusiness reform is driven by rapid demonstration of:\n• The use of rapidly manufactured and field expendable logistics: surface\/sub-surface vehicles for bulk fuel delivery;\n• Demonstration of innovative inverter technology for vehicle-to-grid energy storage and micro-gridding enabling technology for autonomous vehicle recharging;\n• Application of artificial intelligence and machine learning to demonstrate increased development speeds for rapid-recharge antiferroelectric capacitors;\n• Unique aerodynamic designs for on-board UAS energy fuel storage;\n• Hybrid power management and storage for Group 3 UAS; and\n• Mechanical demonstrations of in-flight energy storage for both platforms and weapon systems.  \n\nOECIF supports storage safety innovation in:\n• Novel aqueous battery chemistries that do not burn and have no fixed dependence on form factor, offering the warrior and platforms greater safety and flexibility;\n• Energy storage devices to support expeditionary basing requirements; and\n• Novel Li-Ion internal short detection system which senses at extremely low sensitivity levels allowing early warning to mitigate malfunctions or dangers.\n\nEnergy storage is also a key component of energy resiliency and FY 2019 OECIF investments support:\n• Innovative hydrogen energy storage at bases;\n• Mobile power monitoring of energy storage and loads for preventative maintenance and agile logistics;  \n• Integration of monolithically integrated, ultra-thin solar powered solid state lithium energy storage for space solar applications; and\n• Mechanical developments supporting flywheel storage technology.\n\nFinally, FY 2019 OECIF emphasizes standardization with the potential to save the department millions of dollars including:\n• Standardization of Li-Ion 6T drop-in replacement batteries;\n• Standardization of Li-Ion storage containers for world-wide shipping and development of a DoD-wide Li-Ion database; and\n• Standardization of high voltage energy storage module to support Directed Energy\/Electronic Warfare.\n\nInnovative advances in energy storage underpins lethal warfighting capability and the FY 2019 efforts are expected to significantly contribute to silent watch, greater and safer on-board power for payloads, increased unrefueled range and endurance, reduced energy supply line burdens, and the ability to support autonomous operations.  The breadth of applications includes directed energy \/ electronic weaponry, the dismounted warfighters combat load, long range and endurance of autonomous systems, and storage of energy in and from space.\n\nThe Services submitted a record $175.000 million in prioritized proposal requests for energy storage types (batteries, fuel cells, ultra-capacitors, flywheels, compressed gases, thermal storage, betavoltaics, pumped hydro energy\/power density, safety, standardization, hybridization, reliability, cyclic behavior, and efficiency).  Concerted industry outreach efforts with the Defense Innovation Unit and Manufacturing Technology programs increase the likelihood of near-term transition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.029"
                                            },
                                            "Text": {
                                                "val": "Operational Energy Capability Improvement (OECIF) will ramp down to allow existing projects to close out. \n\nFY 2017 projects for far-field wireless energy transmission will be completed.  These include efforts across 3 modalities of power beaming (Laser, mmWave, and RF).  World-records set in eye-safe Laser power will increase in power and distance.  Efforts in mmWave, RF will demonstrate at least 1kW @ 1 km.  World-record setting perovskite solar cell efforts will conclude with delivery and test of multi-junction cells.  New manufacturing for space-based solar cells will transition to the Air Force partner to continue this effort for reducing costs applicable to all space launches by an order of magnitude.\n\nComplete\/finalize the following efforts:\n• Undersea thermal energy generation\n• Long duration UAX with a focus on INDOPACOM\n• Energy Sensing for efficiency\n• Ultra High Density Hybrid Energy Storage Module (HEMS) for Laser Weapon System and Electronic Warfare Operations\n• Power and Thermal Management for High Power \/ Pulse Power systems and integration\n\nDeliver critical outcomes for: Hybridization of Energy Storage Hardware that increases range and endurance of current UAS.  Results will be ready for flight test demonstrations.  \n\nValidate and qualify Operation of Energy Efficient Multi-Mission Fuel\/ISR\/Strike Pods for UAVs for use, per COCOM direction.\n\nTransition critical, novel fire suppression techniques to enable the safe military transport of Lithium Ion batteries.  \n\nEnable secondary controls for the use of source agnostic inverters and energy storage devices needed to stabilize the operation of any fielded micro-grid ensuring operational flexibility of the battle commander.  \n\nEnable specifications and safety standards for a standardized battery architecture based on commercial technologies for compatibility with multiple DOD platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "DWR: The decrease reflects internal re-alignments for higher DoD priorities under the Defense Wide Review."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Solar \/ Power Beaming"
                                    },
                                    "Description": {
                                        "val": "Previous FY 2017-FY 2019 P455 OECI investments focused on reducing weight and improving growth and performance of solar cells.  Early investment also focused on technological advances to improve metrology for energy collection in space, and both efforts continue advancing.  Success of previous OECI investments in laser safety and mmWave transmission has increased confidence for demonstrating a longer\/larger project viability. \n\nThe Space Solar \/ Power Beaming project implements a front-loaded sprint to recapture the lead in critical technologies with both near-term tactical and far-term strategic implications.  Near-peer competitors are overmatching DoD in power beaming and space solar technologies for battlefield advantage, necessitating this effort to address the shortfalls.  Per the findings and recommendations of the recent DoD study “Opportunities and Challenges for Space Solar for Remote Installations,\" measured, comprehensive investments will be made in key areas to accomplish demonstrations that jumpstart the effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "40.871"
                                            },
                                            "Text": {
                                                "val": "Complete efforts begun in FY 2017 for power beaming and space solar (see above).  These elements advance efforts for power beaming and space solar capabilities to increase warfighter lethality and reduce logistical burdens.\n\nFor ground-to-ground, elevated, high-altitude, low earth orbit, and higher orbits, the progression of power beaming capabilities to include longer links and higher powers will provide a credible path to an operational capability.  \n\n(1) Space Solar Collection – Low-cost, lightweight photovoltaics through revolutionary production methods are key to manufacturing at scale.  \n(2) Microwave Power Beaming Link Demonstration – Using existing sources, microwave power beaming will be demonstrated using rectenna receiver modules developed during FY 2020. This represents the first step towards an all-weather, global system..\n(3) Millimeter Power Beaming Link Demonstration – Leveraging proven non-lethal transmission sources, a tactically relevant power beaming demonstration will be undertaken using millimeter wave rectenna receiver modules developed during FY 2020. \n(4) Optical Power Beaming Link Demonstration – Integrating proven laser safety systems with appropriate directed energy assets will form the transmission segment for the optical demonstration. The optical receiver will be developed employing recent advances in monochromatic photovoltaic technology.  \n(5) Architecture Analytics & Integrating Technologies – Scenario modeling of different means of energy conversion and ground and space segment approaches will focus investments and drive concept of operations development.  Leap-ahead technologies in large area metrology, high-altitude receiver craft, thermal management, high voltage management, and airborne tether technologies will be examined for potential integration into near-term deployed power beaming and far-term space solar capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "DWR: The decrease reflects internal re-alignments for higher DoD priorities under the Defense Wide Review."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}