{
    "id": "2021-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-2716d21dbc896f45f0ab55d1cbc64884530e2bcd27618d8f0e40b216a43f556d-9",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603287E"
        },
        "ProgramElementTitle": {
            "val": "SPACE PROGRAMS AND TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "35"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "256.181"
            },
            "CurrentYear": {
                "val": "190.306"
            },
            "BudgetYearOne": {
                "val": "158.439"
            },
            "BudgetYearOneBase": {
                "val": "158.439"
            },
            "BudgetYearTwo": {
                "val": "108.126"
            },
            "BudgetYearThree": {
                "val": "106.726"
            },
            "BudgetYearFour": {
                "val": "128.726"
            },
            "BudgetYearFive": {
                "val": "137.163"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "254.671"
                },
                "CurrentYear": {
                    "val": "202.606"
                },
                "BudgetYearOne": {
                    "val": "168.926"
                },
                "BudgetYearOneBase": {
                    "val": "168.926"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "256.181"
                },
                "CurrentYear": {
                    "val": "190.306"
                },
                "BudgetYearOne": {
                    "val": "158.439"
                },
                "BudgetYearOneBase": {
                    "val": "158.439"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.510"
                },
                "CurrentYear": {
                    "val": "-12.300"
                },
                "BudgetYearOne": {
                    "val": "-10.487"
                },
                "BudgetYearOneBase": {
                    "val": "-10.487"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-12.300"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "5.074"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.564"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-10.487"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-10.487"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019:  Increase reflects reprogrammings offset by the SBIR\/STTR transfer.\nFY 2020:  Decrease reflects congressional adjustment to the RSGS program.\nFY 2021:  Decrease reflects the completion of the DARPA Launch Challenge in FY 2020, and rescoping of efforts in the Experimental Spaceplane (XSP) program to focus on completion of the critical design review."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "SPC-01"
                    },
                    "ProjectTitle": {
                        "val": "SPACE PROGRAMS AND TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "256.181"
                        },
                        "CurrentYear": {
                            "val": "190.306"
                        },
                        "BudgetYearOne": {
                            "val": "158.439"
                        },
                        "BudgetYearOneBase": {
                            "val": "158.439"
                        },
                        "BudgetYearTwo": {
                            "val": "108.126"
                        },
                        "BudgetYearThree": {
                            "val": "106.726"
                        },
                        "BudgetYearFour": {
                            "val": "128.726"
                        },
                        "BudgetYearFive": {
                            "val": "137.163"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Space Programs and Technology program element is budgeted in the Advanced Technology Development budget activity because it addresses high payoff opportunities to dramatically reduce costs associated with advanced space systems and provides revolutionary new system capabilities for satisfying current and projected military missions.\n\nA space force structure that is robust against attack represents a stabilizing deterrent against adversary attacks on space assets.  This program element will examine concepts and architectures that move the U.S. away from a dependence on monolithic, ultra-capable, vulnerable, and unsustainably costly assets; replacing them with disaggregated assets that are agile, affordable, and easily replaced\/maintained.  Ready access to space requires the delivery of capabilities, replenishment of supplies into orbit, and rapid manufacturing of affordable space capabilities.  Development of smaller, simpler, and more agile launch vehicles and infrastructure will be pursued.  In addition, developing space access and spacecraft servicing technologies as well as exploring novel in-space manufacturing technologies and techniques will lead to reduced ownership costs of space systems and new opportunities for introducing technologies for the exploitation of space.\n\nSystems development is also required to increase the interactivity and functionality of space systems, space-derived information, and services with terrestrial users.  Studies under this program element include technologies and systems that will enable satellites and microsatellites to operate more effectively by increasing maneuverability, survivability, and situational awareness, and precision control of multi-payload systems.  Studies will actively seek to take advantage of new commercial developments which may enable both rapid constitution\/reconstitution of assets, and agility\/functionality not previously available for military systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Experimental Spaceplane (XSP)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Experimental Spaceplane (XSP) program is to design a scalable, responsive, prototype reusable launch system capable of inserting commercially and militarily relevant payloads (greater than 3000 lbs.) into low earth orbit and suborbital trajectories.  There is a $5M cost goal to drive down the expense of space access by an order of magnitude versus traditional expendable launch vehicles.  This is accomplished by designing for high velocity staging which dramatically reduces the amount of costly expendable hardware.  The ability to fly 10 times in 10 days and designing the system to launch a payload into orbit within 24 hours traces to the responsiveness necessary in a military system.  The system will be designed to fly greater than Mach 6.5 multiple times, which directly translates to a reusable hypersonic capability.  The anticipated transition partner is the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "57.793"
                                            },
                                            "Text": {
                                                "val": "-  Matured the XSP concept including complete configuration, aerodynamics and aeroheating, six degree of freedom trajectory calculations with flight software in the loop, mass properties and associated ground systems.\n-  Matured designs for mobile ground infrastructure.\n-  Matured range, ground and flight test operations planning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "37.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete final design iteration of the system prior to development of detailed drawings.\n-  Complete the new Design Reference Mission (DRM) concept of operations.\n-  Define all quality and risk requirements.\n-  Complete Guidance Navigation and Control (GN&C) final analysis cycle to prepare for Critical Design Review (CDR).\n-  Complete all quarterly program and design reviews with updates to the Key Performance Parameters (KPP) and Technical Performance Measurements (TPM)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotic Servicing of Geosynchronous Satellites (RSGS)"
                                    },
                                    "Description": {
                                        "val": "A large number of national security and commercial space systems operate at geosynchronous earth orbit (GEO), providing persistence and enabling ground station antennas to point in a fixed direction.  Technologies for servicing of GEO spacecraft would involve a mix of highly automated and remotely operated (from Earth) robotic systems.  The Robotic Servicing of Geosynchronous Satellites (RSGS) program seeks to establish the capability to provide robotic services in GEO suitable for a variety of potential servicing tasks, in full collaboration and cooperation with existing satellite owners and national security space operators, and with sufficient propellant for several years of follow-on capability.  Key RSGS challenges include robotic tool\/end effector requirements, efficient orbital maneuvering of a servicing vehicle, robotic arm systems, automation of certain spacecraft operations, and development of the infrastructure for coordinated control between the servicer and client spacecraft operations teams.  The anticipated transition is to a commercial partner who will provide the satellite to carry the robotic payload and who will operate the robotic servicer.  To support the development of a broadly accepted satellite servicing capability, DARPA is using the consortium for execution of rendezvous and servicing operations (CONFERS) approach to bring together experts from the private sector and Government to develop and publish non-binding, consensus-based standards for safe operational approaches."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "119.508"
                                            },
                                            "Text": {
                                                "val": "-  Completed build and test of first flight robotic arm.\n-  Began integration of robotic payload.\n-  Fabricated robotic operations test bed.\n-  Continued build of flight units of robotic tools and tool holders.\n-  Continued build of rendezvous and proximity operations sensors.\n-  Published CONFERS programmatic principles and operating practices document and consensus standards.\n-  Presented CONFERS recommended design and operational practices to the United Nations Committee on the Peaceful Uses of Outer Space Scientific and Technical Subcommittee.\n-  CONFERS Standard Operational Principles and Practices accepted as work item by International Standards Organization (ISO) Technical Committee for Aircraft and Space Systems (TC20) Subcommittee for Space Systems and Operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "47.306"
                                            },
                                            "Text": {
                                                "val": "-  Test interim build of flight software.\n-  Complete build and test of second robotic arm and both tool changers.\n-  Continue build of flight units of robotic tools and tool holders.\n-  Continue integration of robotic payload.\n-  Test integrated robotic payload.\n-  Complete build of rendezvous and proximity operations sensors.\n-  Publish revised CONFERS consensus standards inclusive of lessons learned from on-going commercial and government activity.\n-  Lead International Standards Organization (ISO) Technical Committee review and publication of CONFERS Standard Operational Principles and Practices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "46.329"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "46.329"
                                            },
                                            "Text": {
                                                "val": "-  Complete flight software for integration.\n-  Complete payload structures fabrication.\n-  Complete build of flight units of robotic tools and tool holders.\n-  Test robotic tools and integrate onto spacecraft.\n-  Continue integration of robotic payload. \n-  Convene CONFERS third general assembly and open forum.\n-  Publication of CONFERS Standard Operational Principles and Practices by ISO."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects completion of system builds and extension of schedule due to acquisition of new commercial partner."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blackjack"
                                    },
                                    "Description": {
                                        "val": "The Blackjack program will develop space technologies demonstrating a proliferated smallsat constellation capability in Low Earth Orbit (LEO).  Capabilities demonstrated will provide constant custody of very large numbers of concurrent targets; target identification, tracking, and characterization; architectural resilience via massive proliferation; and rapid on-orbit technology refresh and experimentation.  Blackjack will leverage commercial industry plans to build constellations in LEO to provide global commercial broadband internet service.  Key efforts include low size, weight, power, and cost (SWaP-C) multi-modality smallsat sensor payloads, algorithms for autonomous payload and architecture command and control, algorithms for satellite on-board processing and data fusion, and advanced manufacturing for military payload mass production.  The anticipated transition partners are the Air Force and the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.180"
                                            },
                                            "Text": {
                                                "val": "-  Completed preliminary satellite bus and payload interface definition documents.\n-  Completed modeling and simulation plan.\n-  Began development of autonomous control element.\n-  Completed System Requirements Reviews for three buses and nine payloads."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "50.000"
                                            },
                                            "Text": {
                                                "val": "-  Begin modeling and simulation with bus, payload, and autonomy element emulators for risk reduction efforts.\n-  Complete Critical Design Review (CDR) for commoditized satellite bus.\n-  Complete CDR for sensor payloads.\n-  Complete Preliminary Design Review (PDR) for autonomous control element.\n-  Initiate spacecraft bus manufacturing.\n-  Initiate sensor payload manufacturing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "75.710"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "75.710"
                                            },
                                            "Text": {
                                                "val": "-  Complete CDR for autonomous control element.\n-  Initiate autonomous control element manufacturing.\n-  Complete CDR for satellite integrator.\n-  Procure missile tracking payload sensor for in-space experiments.\n-  Initiate assembly, integration, and testing for initial two satellites."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects procurement of missile tracking payload sensor and satellite assembly, integration and testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Space Technology Concepts"
                                    },
                                    "Description": {
                                        "val": "Studies conducted under this program will examine and evaluate emerging technologies and concepts with the potential to provide substantial improvement in efficiency and effectiveness of operations in space.  This includes the degree and scope of potential impact and improvements to military operations, mission utility, and warfighter capability.  Studies are also conducted to analyze emerging threats along with possible methods and technologies to counter them.  The feasibility of achieving potential improvements, in terms of resources, schedule, and technological risk, is also evaluated.  The results from these studies are used, in part, to formulate future programs or refocus ongoing work.  Topics of consideration include advanced or novel propulsion systems, novel sensors, advanced lightweight structures, advanced miniature radio frequency (RF) technology, navigation technologies, avionics, structures, advanced communications and on-orbit software environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Performed studies to evaluate employment of new systems and architectures.\n-  Explored approaches for autonomous operation of spacecraft architectures and resilient space architectures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "-  Conduct feasibility studies for new system concepts.\n-  Examine technology developments supporting space propulsion and power systems and resilient space architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.400"
                                            },
                                            "Text": {
                                                "val": "-  Initiate studies of new concepts and novel approaches for space systems.\n-  Examine the use of new technologies to provide resilient space system capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Planar Imager"
                                    },
                                    "Description": {
                                        "val": "The Planar Imager program seeks to disrupt the state-of-the-art in optical sensors by developing a lightweight, compact, affordable optical payload that can be integrated into a ride-share compatible satellite bus with equivalent imaging performance to current commercial conventional optical imaging satellites.  This technology will significantly lower the size, weight, power, and cost (SWaP-C) of high-resolution intelligence, surveillance, and reconnaissance (ISR) satellites enabling persistent coverage by an affordable satellite constellation and with a rapid reconstitution ability.  To achieve this goal, Planar Imager will exploit recent developments in materials science and nanofabrication by maturing small-scale ultra-thin optics demonstrated in the laboratory to meter-scale and demonstrate a proof-of-concept optical system in space.  The reduction in optical payload SWAP-C will disrupt the paradigm of costly custom large meter-scale aperture ISR satellites on dedicated launches to satellites with high-performance ISR systems that are ride-share compatible.  These compact optical payloads will enable a large number of meter-scale aperture ISR satellites packed into a single launch vehicle fairing, dramatically reducing launch costs as well.  A more persistent and pervasive space-based ISR architecture will increase warfighter readiness and lethality.  These planar optics will also have applications to any optical imaging system and will impact all areas of optical remote sensing and imaging as well as any system that requires optical components including laser systems.  The anticipated transition partner is the Air Force."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate small-scale lens performance in relevant imaging environment. \n-  Select planar lens design approach and define lens design goals based on results of small-scale prototype efforts.\n-  Conduct trade studies to identify optimal scale-up technique for thin lens fabrication approach to meet concept threshold and objective goals.\n-  Produce medium-scale prototype lens and verify performance in laboratory."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Field test medium-scale prototype system in relevant environment, evaluate optical performance, and evaluate space resilience.\n-  Initiate preliminary design of full-scale lens system.\n-  Create detailed design of full-scale lens system and identify fabrication method to achieve high performance full-scale planar lens."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects progression from initial design and laboratory testing to field tests and design of full-scale system."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Demonstration Rocket for Agile Cislunar Operations (DRACO)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Reactor on a Rocket (ROAR)\n\nThe Demonstration Rocket for Agile Cislunar Operations (DRACO) program will develop and demonstrate a High-Assay Low-Enriched Uranium (HALEU) nuclear thermal propulsion (NTP) system.  The capability afforded by NTP will expand the operating presence of the U.S. in space to the cislunar volume and enhance domestic operations to a new high-ground, which is in danger of being defined by the adversary.  The program will initially develop the use of additive manufacturing (AM) approaches to print NTP fuel elements.  This program will be the first demonstration of AM printing of uranium fuel elements.  The results will be used to enable optimized NTP reactor designs that are not constrained by traditional manufacturing.  The anticipated transition partner is the Air Force."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate ability to additively manufacture uranium nuclear thermal propulsion (NTP) fuel elements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete system requirements review for NTP demonstration reactor.\n-  Demonstrate a design of NTP fuel elements in representative test environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program focus shift from feasibility studies to design and initial demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DARPA Launch Challenge"
                                    },
                                    "Description": {
                                        "val": "Advances in technology, including networking and computing, have significantly increased the utility of small (<300kg) spacecraft that would previously have been of limited military value.  For the simultaneous purposes of responsiveness and resiliency, these spacecraft are envisioned to be built on dramatically faster timelines (weeks instead of years) than are executed today.  The current practice for space launch generally favors large launch vehicles with complex, one-of-a-kind infrastructure.  This architecture has been matched to the large, heavy spacecraft, which compose most of DoD's space architecture today.  Small spacecraft, which offer large potential value for resiliency and tactical employment, are typically required to rideshare for access to space, which requires programmatic, technical, and schedule entanglement with other programs.  The U.S. commercial sector has promising developments for small launch vehicles that are designed for launch on rapid timescales with minimal fixed infrastructure.  To incentivize industry to deliver capability that can meet emerging DoD needs for rapid, responsive launch of small payloads, the DARPA Launch Challenge will reward competitors who can demonstrate the ability to launch a payload to orbit with minimal notification time and unknown pre-conditions regarding the payload configuration, required orbit, and launch site.  The U.S. Government can make future use of commercial contracting mechanisms for rapid space launch with successful performers.  The anticipated transition partners are the Air Force and NASA."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.250"
                                            },
                                            "Text": {
                                                "val": "-  Selected launch ranges and initiated launch site facility accommodations, as necessary.\n-  Tested multi-launch site compatible downrange telemetry return capabilities.\n-  Created scalable commercial payload packages to support range of launch capabilities.\n-  Coordinated with the FAA's Office of Commercial Space Transportation on license applications for challenge participants.\n-  Reviewed participant challenge applications, to include operations plans demonstrating use of minimal infrastructure, and rapid launch capability.\n-  Selected challenge participants for the qualification phase and awarded qualification prizes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "38.500"
                                            },
                                            "Text": {
                                                "val": "-  Conduct first and second launches at specified ranges to demonstrate rapid timescale and flexibility.\n-  Award challenge prizes for the first and second launches."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects completion of the challenge events."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radar Net"
                                    },
                                    "Description": {
                                        "val": "The Radar Net program developed a lightweight, low power, wideband capability for radio frequency (RF) communications and remote sensing for a space-based platform.  The enabling technologies of interest are extremely lightweight and space capable deployable antenna structures.  Current deployable antenna options have not been sufficiently developed to be dependable on small payload launches, leaving current capabilities trending to large and more costly satellite systems.  These satellite systems are expected to have long operational lifetimes, which can leave them behind the pace of state-of-the-art technical developments.  The technologies developed under Radar Net enabled small, low-cost sensor payloads on short timescales with rapid technology refresh capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed final coordination with transition partner on fabrication, assembly, integration and test of the demonstration system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hallmark"
                                    },
                                    "Description": {
                                        "val": "The Hallmark program demonstrated a space Battle Management Command and Control (BMC2) development capability to provide U.S. senior leadership the tools needed to effectively manage space assets in real time.  The program enabled the rapid development of command and control decision support tools for the full-spectrum of space operations, management, and control, from peace to potential conflict.  Hallmark demonstrated the ability to increase space threat awareness via use of multi-data fusion and to protect against threats by using modeling and simulation tools to develop courses of action for both natural events and adversary actions.  The program employed artificial intelligence (AI) and machine learning (ML) technologies to increase commander and operator awareness, thereby transforming information to knowledge and effectively communicating and facilitating time-critical decision making.  The Hallmark BMC2 layer was underpinned by an innovative, flexible infrastructure that enables the agile development and integration of tools in an accelerated, operationally relevant time fame, in order to respond to shifting adversary Tactics, Techniques, and Procedures (TTPs).   Elements of the program have transitioned to an Intelligence Community partner, with additional transitions to Intelligence Community partners and the Air Force in progress."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.450"
                                            },
                                            "Text": {
                                                "val": "-  Augmented the BMC2 tool suite with new technologies that leverage AI and ML to counter complex adversary activities and produce alternative courses of action.\n-  Supported transition for sustainment of BMC2 tool development environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}