{
    "id": "2021-Navy-PB-1319-MJBOOK-2-0-744c7ee94c2cc798fbfd935e35baade9caa8a86b67e6f22ecedd75220314848f-63",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605500N"
        },
        "ProgramElementTitle": {
            "val": "Multi-Mission Maritime Aircraft (MMA) (P-8A)"
        },
        "R1LineNumber": {
            "val": "161"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "7927.602"
            },
            "PriorYear": {
                "val": "32.998"
            },
            "CurrentYear": {
                "val": "21.472"
            },
            "BudgetYearOne": {
                "val": "24.424"
            },
            "BudgetYearOneBase": {
                "val": "24.424"
            },
            "BudgetYearTwo": {
                "val": "28.416"
            },
            "BudgetYearThree": {
                "val": "30.229"
            },
            "BudgetYearFour": {
                "val": "32.624"
            },
            "BudgetYearFive": {
                "val": "44.149"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The P-8A Multi-mission Maritime Aircraft (MMA) will replace the aging P-3 aircraft.  The P-8A program was initiated in response to the Joint Requirements Oversight Council (JROC) validated Mission Needs Statement, \"Broad Area Maritime and Littoral Armed Intelligence, Surveillance and Reconnaissance\" and the requirements for the program are defined in the P-8A Capability Production Document #791-88-09, validated and approved on 22 June 2009.  A successful Critical Design Review was completed in June 2007.  In August 2007 the Design Readiness Review was conducted and resulted in approval to obligate funding for the fabrication of the Stage II flight test aircraft.  The first flight of P-8A occurred on 25 Apr 2009.  Milestone C was successfully completed on 11 August 2010. The program completed Initial Operational Test and Evaluation (IOT&E) in March 2013 and achieved Initial Operational Capability (IOC) in November 2013.  The Acquisition Decision Memorandum approved entry into Full Rate Production on January 3, 2014.\n\nThe primary objectives of Systems Development and Demonstration (SDD) are to perform the system detailed design, develop and produce Systems Integration Labs, develop and build ground and flight test articles, and conduct ground and flight tests to successfully achieve program milestones. Ground testing includes the conduct of static testing, fatigue testing and Live Fire Test and Evaluation.  Six flight test aircraft have been built during SDD (PU 2696).  These test aircraft are grouped into two stages based on which phase of the test program the aircraft will support.  SDD Stage I flight test aircraft (FY06\/Qty-3) support Integrated Test and Evaluation (IT&E).  SDD Stage II flight test aircraft (FY09\/Qty-3) supported the completion of IT&E and IOT&E after being updated to the production configuration. The SDD contract includes the development and initial building of training devices to support IOT&E.  The scope of SDD includes activities necessary to facilitate an efficient transition of the fleet to achieve the P-8A IOC of SDD (PU 2696) in CY13.  The scope of SDD also includes the engineering and verification of corrected deficiencies identified in testing and Fleet operational use.  P-8A entered Production and Deployment phase in the 4th quarter of FY10 and entered Full Rate Production in 2nd quarter of FY14.    \n\nThe P-8A MMA program's Assured Maritime Dominance Anti-Submarine Warfare (ASW), Anti-Surface Warfare (ASuW), and Intelligence, Surveillance, and Reconnaissance (ISR) activities include a sequence of Rapid Capability Insertions (RCI) and rapid development efforts to respond to evolving threats and adversary capabilities, which will retain cost effectiveness for winning major combat operations. In order to pace the threat, these efforts will incorporate incremental software and\/or hardware improvements to existing sensor capabilities, communications systems, mission systems, weapons capabilities, training systems and Tactical Operations Center (TOC) \/Tacmobile support to build on the P-8A capability baseline. These planned and emergent requirements will be prioritized through either the Navy Integration and Interoperability (I&I) aligned Capability Prioritization Process (CPP), P-8A Tier 3 Capability Roadmap and\/or through Fleet identification of an Urgent Operational Need. The CPP process is supported by detailed analysis and the maturations of developing technologies.\n\nAssured Maritime Dominance activities include principle mission lethality, survivability against kinetic and non-kinetic threats, and capability persistence in high-level threat environments. Rapid Development efforts increase lethality through optimization of kill-chain software systems, employment of Long Range Anti-Ship Missile (LRASM) and other weapon systems and Airborne Weapon Simulator capabilities. RCI4 capabilities include kill-chain\/gap analysis, ASW Enhancements, common weapons synchronization, and Airborne Weapon Simulator continuation. RCI5 capabilities increase P-8A survivability through end of the platform and its capabilities through Radio Frequency Counter Measure (RFCM) prototype, P-8A Survivability Assurance and distributed sensor network improvements.\n\n\nBudget Activity 5.\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under SYSTEM DEVELOPMENT AND DEMONSTRATION because it includes those projects that have passed Milestone B approval and are conducting engineering and manufacturing development tasks aimed at meeting validated requirement prior to full-rate production decision."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "34.196"
                },
                "CurrentYear": {
                    "val": "21.472"
                },
                "BudgetYearOne": {
                    "val": "10.310"
                },
                "BudgetYearOneBase": {
                    "val": "10.310"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "32.998"
                },
                "CurrentYear": {
                    "val": "21.472"
                },
                "BudgetYearOne": {
                    "val": "24.424"
                },
                "BudgetYearOneBase": {
                    "val": "24.424"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.198"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "14.114"
                },
                "BudgetYearOneBase": {
                    "val": "14.114"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.198"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "14.120"
                                },
                                "BudgetYearOneBase": {
                                    "val": "14.120"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.006"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.006"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: PU 3368 Schedule revised to incorporate further detail and the inclusion of RCI5.\n\nPU 3368: \n\nFY 2021 includes a $18.4M increase for LRASM ASuW Weapons integration and a reduction of $4.300M to account for the availability of prior year execution balances."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2696"
                    },
                    "ProjectTitle": {
                        "val": "Multi-Mission Maritime Aircraft"
                    },
                    "MdapCode": {
                        "val": "334"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "7919.288"
                        },
                        "PriorYear": {
                            "val": "7.195"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7926.483"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The P-8A Multi-mission Maritime Aircraft (MMA) will replace the aging P-3 aircraft.  The P-8A program was initiated in response to the Joint Requirements Oversight Council validated Mission Needs Statement, \"Broad Area Maritime and Littoral Armed Intelligence, Surveillance and Reconnaissance\" and the requirements for the program are defined in the P-8A Capability Production Document (CPD) #791-88-09, validated and approved on 22 June 2009.  A successful Critical Design Review was completed in June 2007.  In August 2007 the Design Readiness Review was conducted and resulted in approval to obligate funding for the fabrication of the Stage II flight test aircraft. The first flight of P-8A occurred on 25 Apr 2009.  Milestone C was successfully completed on 11 August 2010. The program completed Initial Operational Test and Evaluation (IOT&E) in March 2013 and achieved Initial Operational Capability (IOC) in November 2013.  The Acquisition Decision Memorandum approved entry into Full Rate Production on January 3, 2014.\n\nThe primary objectives of Systems Development and Demonstration (SDD) are to perform the system detailed design, develop and produce Systems Integration Labs, develop and build ground and flight test articles, and conduct ground and flight tests to successfully achieve program milestones. Ground testing includes the conduct of static testing, fatigue testing and Live Fire Test and Evaluation.  Six flight test aircraft have been built during SDD.  These test aircraft are grouped into two stages based on which phase of the test program the aircraft will support.  SDD Stage I flight test aircraft (FY06\/Qty-3) support Integrated Test and Evaluation (IT&E).  SDD Stage II flight test aircraft (FY09\/Qty-3) supported the completion of IT&E and IOT&E after being updated to the production configuration. The SDD contract includes the development and initial building of training devices to support IOT&E.  The scope of SDD includes activities necessary to facilitate an efficient transition of the fleet to achieve the P-8A IOC of SDD (PU 2696) in CY13.  The scope of SDD also includes the engineering and verification of corrected deficiencies identified in testing and Fleet operational use and the baseline air to air refueling.  P-8A entered Production and Deployment phase in the 4th quarter of FY10 and entered Full Rate Production in 2nd quarter of FY14."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continue System Development & Demonstration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.825"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A\n\nOCO:\nNot applicable."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Continue Engineering and Technical Development and Test for Sys Dev & Demonstration contracts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.370"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not applicable.OCO:Not applicable."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APN1\/0193"
                                    },
                                    "Title": {
                                        "val": "P-8A MMA"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1898.853"
                                        },
                                        "CurrentYear": {
                                            "val": "1668.073"
                                        },
                                        "BudgetYearOne": {
                                            "val": "80.134"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "80.134"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "24465.607"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APN6\/0605"
                                    },
                                    "Title": {
                                        "val": "P-8A Initial Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.066"
                                        },
                                        "CurrentYear": {
                                            "val": "0.010"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.295"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.295"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "104.559"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The MMA Milestone 0 was approved 22 March 2000 and the resulting Acquisition Decision Memorandum directed P-8A to begin the Concept Exploration phase consisting of an Analysis of Alternatives and industry concept studies.  These activities began 3Q\/01 and were funded under Program Element 0702207N Project Unit W2737.  Approval to enter Component Advance Development (CAD) was attained from the Overarching Integrated Product Team on 18 Jan 2002 and the Milestone Decision Authority Under Secretary of Defense for Acquisition, Technology, & Logistics approved the program Acquisition Strategy on 8 Feb 2002. The CAD was a competitive award to multiple contractors to define alternative MMA concept system architectures and evaluate associated risks and proposed mitigations.  Selection of MMA concept and approval to enter SDD phase occurred at MS B decision review on 28 May 2004.  The contract was awarded to Boeing on 14 June 2004.  The SDD phase is being used to design, develop and test the P-8A system.  The P-8A program was initiated in response to the Joint Requirements Oversight Council validated Mission Needs Statement, \"Broad Area Maritime and Littoral Armed Intelligence, Surveillance and Reconnaissance\" and the requirements for the program are defined in the Capability Production Document.  MS C was successfully completed on 11 August 2010 approving entry into the Production and Deployment Phase.  P-8A Initial Operational Capability achieved in November 2013. Entry into Full Rate Production was approved on 3 January 2014."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Primary HW Dev - Boeing"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Seattle, WA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7001.423"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.675"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7008.098"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7008.369"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sys Eng (gov)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWC AD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pax River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "85.816"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "85.966"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior year Prod Dev cost no longer funded in the FYDP"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "319.530"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "319.530"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Int. Log Gov"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWC AD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pax River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "43.918"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "43.918"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tech Dev Gov"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWC AD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pax River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "77.928"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.160"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "78.088"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior year Support cost no longer funded in the FYDP"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "31.369"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "31.369"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Dev T&E - Gov"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWC AD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pax River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "100.210"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "100.210"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GFE & GFI"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWC AD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pax River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "89.688"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "89.688"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Oper Test & Eval"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWC AD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pax River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.642"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.642"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior year T&E cost no longer funded in the FYDP"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "39.471"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "39.471"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Mgmt Suppt Serv (NON-FFRDC)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "RBC INC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "33.537"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "33.537"
                                                    },
                                                    "TargetValue": {
                                                        "val": "33.537"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Eng Tech Serv (NON-FFRDC)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ASEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lexington Park MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.453"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.453"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.453"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Mgmt Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWC AD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pax River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "53.591"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.160"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "53.751"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWC AD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pax River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.354"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.404"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior year Mgmt cost no longer funded in the FYDP"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "20.358"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "20.358"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2021PB_0605500N_2696_FILE1.PNG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Multi-Mission Maritime Aircraft"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Test & Evaluation: Technical Evaluation: Fatigue Analysis"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Production Milestones: Full Rate Production (FRP)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 1: FRP Aircraft (APN) Q2 2019"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 3: FRP Aircraft (APN) Q1 2019"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 3: FRP Aircraft (APN) Q2 2019"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 4: FRP Aircraft (APN) Q2 2019"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 4: FRP Aircraft (APN) Q3 2019"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 4: FRP Aircraft (APN) Q4 2019"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 4: FRP Aircraft (APN) Q1 2020"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 4: FRP Aircraft (APN) Q2 2020"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 5: FRP Aircraft (APN) Q2 2020"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 5: FRP Aircraft (APN) Q3 2020"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 5: FRP Aircraft (APN) Q4 2020"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 5: FRP Aircraft (APN) Q1 2021"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 6: FRP Aircraft (APN) Q1 2021"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 6: FRP Aircraft (APN) Q2 2021"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 6: FRP Aircraft (APN) Q3 2021"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 6: FRP Aircraft (APN) Q4 2021"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 7: FRP Aircraft (APN) Q3 2022"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 7: FRP Aircraft (APN) Q4 2022"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 7: FRP Aircraft (APN) Q1 2023"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 7: FRP Aircraft (APN) Q2 2023"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 7: FRP Aircraft (APN) Q4 2023"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliveries: FRP 7: FRP Aircraft (APN) Q1 2024"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3368"
                    },
                    "ProjectTitle": {
                        "val": "P-8 Improvements"
                    },
                    "MdapCode": {
                        "val": "334"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "8.314"
                        },
                        "PriorYear": {
                            "val": "25.803"
                        },
                        "CurrentYear": {
                            "val": "21.472"
                        },
                        "BudgetYearOne": {
                            "val": "24.424"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.424"
                        },
                        "BudgetYearTwo": {
                            "val": "28.416"
                        },
                        "BudgetYearThree": {
                            "val": "30.229"
                        },
                        "BudgetYearFour": {
                            "val": "32.624"
                        },
                        "BudgetYearFive": {
                            "val": "44.149"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The P-8A Multi-mission Maritime Aircraft (MMA) program's Assured Maritime Dominance ASW, ASuW, and ISR activities include a sequence of Rapid Capability Insertions (RCI) and rapid development efforts to respond to evolving threats and adversary capabilities, which will retain cost effectiveness for winning major combat operations. In order to pace the threat, these efforts will incorporate incremental software and\/or hardware improvements to existing sensor capabilities, communications systems, mission systems, weapons capabilities, training systems and Tactical Operations Center (TOC) \/Tacmobile support to build on the P-8A capability baseline. These planned and emergent requirements will be prioritized through either the Navy Integration and Interoperability (I&I) aligned Capability Prioritization Process (CPP), P-8A Tier 3 Capability Roadmap and\/or through Fleet identification of an Urgent Operational Need. The CPP process is supported by detailed analysis and the maturations of developing technologies.\n\nAssured Maritime Dominance activities include principle mission lethality, survivability against kinetic and non-kinetic threats, and capability persistence in high-level threat environments. Rapid Development efforts increase lethality through optimization of kill-chain software systems, employment of LRASM and other weapon systems and Airborne Weapon Simulator capabilities. RCI4 capabilities include kill-chain\/gap analysis, ASW Enhancements, common weapons synchronization, and Airborne Weapon Simulator continuation. RCI5 capabilities increase P-8A survivability through end of the platform and its capabilities through Radio Frequency Counter Measure (RFCM) prototype, P-8A Survivability Assurance and distributed sensor network improvements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Perform technology demonstrations and analyses of proposed new capabilities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.999"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.589"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop RCI packages and rapid development efforts to incrementally incorporate software and hardware capability improvements, building on the P-8A Baseline to ensure ongoing relevance of the P-8A capability.  Continue full scale development and integration of AWS capability and RCI4 to include MAC, Acoustics, Non-Acoustic enhancements and Theatre ASW interoperability improvements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.625"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.625"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop RCI packages and rapid development efforts to incrementally incorporate software and hardware capability improvements, building on the P-8A Baseline to ensure ongoing relevance of the P-8A capability. Begin development of ASW weapon airworthiness and aircraft integration, Continue development and integration of AWS capability and RCI4 to include MAC, Acoustics, Non-Acoustic enhancements and Theatre ASW interoperability improvements."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase is the net value of a $18.4M increase for LRASM ASuW Weapons integration offset by a decrease of $10.8M  due to major development and integration efforts related to AWS completion and a decrease for $4.3M to account for the availability of prior year execution balances."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Conduct technical, cost, risk and logistics analysis of proposed technologies"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.804"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.883"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct technical, cost, risk and logistics analysis of proposed technologies. Evaluate system requirements through cost\/performance trade-off analysis. Provide technical and management support for the development of acquisition documentation. Provide engineering and management of technical development effort. Increase in government led prototyping."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.799"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.799"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct technical, cost, risk and logistics analysis of proposed technologies. Evaluate system requirements through cost\/performance trade-off analysis. Provide technical and management support for the development of acquisition documentation. Provide engineering and management of technical development effort. Increase in government led prototyping."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to major development and integration efforts related to AWS coming to an end in FY20."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The P-8A acquisition strategy is designed to deliver the required capabilities while introducing additional competition throughout the program. Government Lead Capability Integrator (LCI) control over the designs and information promote cost-effectiveness, rapid capability fielding, and reduced acquisition and life-cycle costs.  Additionally, technologies for P-8 modernization improvements are compartmentalized and delivered independently of one another as a series of ECPs, without risk to the overall program schedule or procurement cost.  This tailoring approach is effective in accommodating an emergent Fleet requirement and serve as an example that the flexibility inherent in this ECP-based Acquisition Strategy is responsive to Fleet customer concerns.  \n\nThe P-8A Acquisition Strategy (AS), first approved by the Under Secretary of Defense for Acquisition, Technology and Logistics (USD (AT&L)) at Milestone B in 2004, establishes the strategy to deliver full P-8A capability via three increments (then Block 1, Spiral 1 and Spiral 2 and now called Increments 1, 2, and 3).  Increment 1 (Block 1) provided persistent ASW, ASuW, and ISR.  Increment 2 (Spiral 1) provided improved ASW capabilities via multiple ECPs.  On 4 April 2016, the MDA (USD AT&L) approved the incorporation of Increment 3 (Spiral 2 - under PE 0605504N) communications, Combat Systems Architecture, ASW Signals Intelligence, ASuW Net Enabled Weapon, Wideband SATCOM, Higher than Secret security enclave and Enhanced Multi-static Active Coherent (MAC-E) as ECPs (ECP 4-7) within the existing P-8A program as defined in the approved AS.  RCI, rapid development, and future emergent capabilities will continue to be developed in an evolutionary manner similar to Increments 1-3 ECPs.  Work is not initiated under this incremental acquisition process until the capabilities are first approved in P-8A Joint Capabilities Integration and Development System (JCIDS) documentation or the Navy's I&I CPP, approval obtained through an OPNAV Configuration Steering Board (CSB) and the phase of work approved by the Milestone Decision Authority (MDA).   On 10 May 2016, P-8A was redesignated an ACAT 1C program and the MDA assigned to the Assistant Secretary of the Navy for Research, Development and Acquisition (ASN (RDA))."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "LRASM was added to incorporate the increase of $18.400M for funding of ASuW weapons integration."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Primary HW\/SW Dev - P-8 Improvements\/Increased Capability"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.056"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.477"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.652"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.332"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.332"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.867"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.384"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Primary HW\/SW Dev - ASW Enhancements"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.805"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.746"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.099"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.473"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.473"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.569"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.692"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Primary SW Dev- Airborne Weapons Simulator\/ Correction of Deficiencies\/RFCM"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "19.238"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.531"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.531"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "31.069"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Primary SW Dev - ASW Sonobuoy Receiver Digitization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Seattle, WA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.800"
                                                    },
                                                    "TargetValue": {
                                                        "val": "6.731"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Primary SW Dev -RCI4"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "18.451"
                                                    },
                                                    "TotalCost": {
                                                        "val": "22.451"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Primary SW Dev -LRASM"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Seattle, WA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "18.400"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "18.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "47.800"
                                                    },
                                                    "TotalCost": {
                                                        "val": "66.200"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sys Eng - Gov"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pax River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.796"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.029"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.938"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.089"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.089"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Eng Tech Serv (NON-FFRDC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.770"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.258"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.290"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.984"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.502"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.602"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Mgmt Support Serv"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "RBC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.569"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.356"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.333"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.393"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.393"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.993"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.644"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.744"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Mgmt Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pax River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.318"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.299"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.260"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.206"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.206"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2021PB_0605500N_3368_FILE1.PNG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "P-8 Improvements"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: RFCM Prototype: Contract Award"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: RFCM Prototype: Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: LRASM: Contract Award"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: LRASM: Pre Flight Analysis"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: LRASM: FRR"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: LRASM: Software Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: LRASM: Test Release"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: LRASM: Fleet Release"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: LRASM: Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: LRASM: Fleet Certification"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: LRASM: OTRR"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: LRASM: OT"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: Airborne Weapons Simulator: Design Contract Award"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: Airborne Weapons Simulator: Acquisition Contract Award"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: Airborne Weapons Simulator: Test Release"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: Airborne Weapons Simulator: Fleet Release"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: Airborne Weapons Simulator: Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: Airborne Weapons Simulator: Fleet Deployment"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Rapid Development: ASW Digitization: Fleet Release"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RCI4: Common Weapons Synchronization: Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RCI4: Common Weapons Synchronization: Test Release"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RCI4: Common Weapons Synchronization: Fleet Release"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RCI4: ASW Phase 2: Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RCI4: ASW Phase 2: Test Release"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RCI4: ASW Enhancements: Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RCI4: ASW Enhancements: Test Release"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RCI5: Survivability Assurance: Contract Award"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RCI5: Survivability Assurance: Pre-flight analysis"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RCI5: Survivability Assurance: Test Release"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RCI5: ASW Improvements: Test Release"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}