{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-73",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605142D8Z"
        },
        "ProgramElementTitle": {
            "val": "Systems Engineering"
        },
        "R1LineNumber": {
            "val": "155"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "255.022"
            },
            "PriorYear": {
                "val": "37.446"
            },
            "CurrentYear": {
                "val": "37.140"
            },
            "BudgetYearOne": {
                "val": "49.376"
            },
            "BudgetYearOneBase": {
                "val": "49.376"
            },
            "BudgetYearTwo": {
                "val": "42.699"
            },
            "BudgetYearThree": {
                "val": "43.415"
            },
            "BudgetYearFour": {
                "val": "44.409"
            },
            "BudgetYearFive": {
                "val": "45.071"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Beginning in FY 2021, DoD Modeling and Simulation Management Office (MSMO) funding, Engineering Resilient Systems (ERS), and Systems Engineering Research Center (SERC) activities aligned with the national defense modernization priorities and transitioned from Engineering Science and Technology (PE 0603833D8Z) to Systems Engineering (PE 0605142D8Z).  Additionally, the Test & Evaluation Policy Workforce is transferred from Development Test & Evaluation (PE 0605804D8Z) to Systems Engineering (PE 0605142D8Z)."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) establishes the dedicated funding line to carry out the mission integration and systems engineering duties as described in Deputy Secretary of Defense Memorandum, \"Establishment of the Office of the Under Secretary of Defense for Research and Engineering and the Office of the Under Secretary of Defense for Acquisition and Sustainment,\" July 13, 2018.  \n\nIn alignment with the National Defense Strategy (NDS), the Systems Engineering (SE) PE supports a more lethal force by analyzing near-, mid-, and long-term approaches to realizing mission capability, assessing that capability against anticipated adversaries in relevant operational environments, and determining revised system, architectural, tech surprise opportunities to maintain tactical edge, insert technology, improve interoperability and formulate long-term strategies to retain or improve our capabilities against our adversaries. Deputy Director, Engineering (DD, Eng) oversees, initiates, and recommends opportunities to align technology investments to accelerate capability delivery, or modifying existing systems.  This program supports:\n\n(1) Reforming the Department for greater performance and affordability by maintaining visibility into major programs and conducting independent technical risk assessments (ITRAs) to advise the Under Secretary of Defense for Research and Engineering (USD(R&E)) and Milestone Decision Authorities on progress towards achieving key performance parameters, technology maturation, interoperability, and cyber security posture;\n(2) Modernizing key capabilities and mission priorities through technical support for mission engineering and establishing budget priorities; and\n(3) Cultivates workforce talent by both developing engineering methods, policies, processes, and tools that are cross cutting technologies and integrating technical disciplines to advance DoD engineering practices and providing advocacy and oversight for the Department's engineering workforce to build a capable, current, and innovative engineering workforce. \n\nIn FY 2019, this PE began activities to carry out responsibilities described in the FY 2017 National Defense Authorization Act (NDAA) Section 855 titled Mission Integration Management (MIM).\n\nIn FY 2020, funding from Project Code 143, Program Protection, was re-aligned to a new Maintaining Technology Advantage Program Element (PE) 0605797D8Z, to support efforts which have transitioned to the Deputy Director, Strategic Technology Protection and Exploitation (STP&E).\n\nBeginning in FY 2021, DoD Modeling and Simulation Management Office (MSMO) funding, Engineering Resilient Systems (ERS), and Systems Engineering Research Center (SERC) activities aligned with the national defense modernization priorities and transitioned from Engineering Science and Technology (PE 0603833D8Z) to Systems Engineering (PE 0605142D8Z).  Additionally, the Test & Evaluation Policy Workforce is transferred from Development Test & Evaluation (PE 0605804D8Z) to Systems Engineering (PE 0605142D8Z)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "38.784"
                },
                "CurrentYear": {
                    "val": "37.140"
                },
                "BudgetYearOne": {
                    "val": "41.606"
                },
                "BudgetYearOneBase": {
                    "val": "41.606"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "37.446"
                },
                "CurrentYear": {
                    "val": "37.140"
                },
                "BudgetYearOne": {
                    "val": "49.376"
                },
                "BudgetYearOneBase": {
                    "val": "49.376"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.338"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "7.770"
                },
                "BudgetYearOneBase": {
                    "val": "7.770"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.331"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Transfer of Test & Evaluation Policy Workforce"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.850"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.850"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Funding realignment for enhanced engineering expertise"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "11.531"
                                },
                                "BudgetYearOneBase": {
                                    "val": "11.531"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Reduction for Defense Wide Review"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-7.550"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.550"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.007"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.054"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.054"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sustain Research and Technology Advancements"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.993"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.993"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2021 base increase of $7.770 million is the net sum of: a transfer of Test & Evaluation Policy Workforce ($1.850 million) from Development Test & Evaluation (PE 0605804D8Z) to support proper alignment\/execution; a resource realignment of $11.531 million from Engineering Science & Technology (Program Element 0603833D8Z) to support enhanced engineering expertise and assessments for priority mission oriented modernization prototypes; a $1.993 million funding increase to enhance Integration, Technology and Tools; a $0.054 million reduction for economic assumptions; and a $7.550 million reduction where funds are realigned to higher priority DoD missions resulting from Defense Wide Review."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "142"
                    },
                    "ProjectTitle": {
                        "val": "Systems Engineering"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "225.815"
                        },
                        "PriorYear": {
                            "val": "29.460"
                        },
                        "CurrentYear": {
                            "val": "35.140"
                        },
                        "BudgetYearOne": {
                            "val": "42.976"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.976"
                        },
                        "BudgetYearTwo": {
                            "val": "36.282"
                        },
                        "BudgetYearThree": {
                            "val": "37.001"
                        },
                        "BudgetYearFour": {
                            "val": "37.889"
                        },
                        "BudgetYearFive": {
                            "val": "38.479"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project P142 activities include the following functions:\n• Support acceleration of USD(R&E)’s modernization initiatives and Assistant Directors’ Science and Technology (S&T) roadmap investments; support mission based prototype projects to guide resource investments.\n• Develop government reference architectures; establish enduring mission engineering analytic capability.\n• Review the systems engineering plans (SEPs) and activities for major defense acquisition programs (MDAPs) under OSD purview and alternate pathway programs to ensure they are adequate to support fielding and the achievement of cost, schedule and performance goals to include readiness, i.e. producibility, reliability, maintainability, sustainment, and other considerations.\n• Conceive plans and lead independent technical risk assessments and command directed technical assessments of MDAP under OSD purview and alternate pathway programs to shape technical planning and management to ensure program success.\n• Provide risk assessments to support the development of cost, schedule, and performance targets required by U.S.C. 10 Sec 2448a.\n• Conduct other technical reviews as requested, such as Nunn-McCurdy certification reviews, Non-Advocate Reviews, focused technical assessments, and software readiness reviews to identify and mitigate program risk.\n• Participate in mission engineering activities by providing functional and program specific engineering expertise to support joint mission level analysis.\n• Develop and establish DoD-level policy, guidance, and workforce development efforts ensuring systems engineering rigor in acquisition to drive the development of fully capable and supportable weapons systems.\n• Oversee Service and other Component organizations implementation of engineering initiatives and approve or conduct independent assessments.  Advance the principles of interoperability, integration, modularity, and open systems to improve requirements, architecture, design, development and overall acquisition and sustainment of weapon systems.\n• Develop education and training materials for instructing, maintaining, and enhancing the defense acquisition workforce.  Activities include: (1) developing guidance to enhance Engineering (ENG), Production Quality and Manufacturing (PQM) and Test and Evaluation (T&E) acquisition career planning and progression; and (2) monitoring, and facilitating Defense Acquisition University (DAU) updates to the systems engineering, quality and specialty engineering courses, to ensure the curriculum represents the education and training requirements necessary to be a viable team member in the acquisition process.\n• Improve the DoD’s capabilities in specialty engineering and software engineering through policy, program oversight, fostering practice and technology improvements, initiating long-term strategic improvements, and collaborating with industry.\n• Advance DoD engineering practices through the development and use of methods, processes, and tools, such as digital engineering, modeling and simulation, and model-based systems engineering, for engineering on weapon systems.\n• Serve as the Defense Standardization Executive and oversee the Defense Standardization Program.\n• Guide Service and other component organizations in the development planning process to ensure proposed MDAP programs are executable within acceptable levels of risk.\n• Resolve long-term major systems engineering challenges such as systems of systems (SoS) systems engineering, systems engineering of complex systems, and pre-program formulation systems engineering tradeoff analysis.\n• Integrates high fidelity, physics-based modeling with advanced analytic tools to enable rapid design and analysis of current and future weapon systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Engineering"
                                    },
                                    "Description": {
                                        "val": "The DD, Engineering provides objective assessments of program risk to support knowledge-based decision making by DoD leaders regarding DoD weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.460"
                                            },
                                            "Text": {
                                                "val": "Strategic Thrust:  Program Support \n• Monitor programs, providing SE oversight and support to all MDAPs and special interest programs.\n• Expand root cause analysis conducted during and after Independent Technical Risk Assessments (ITRAs).\n• Expand use of detailed performance measurement and analysis.\n• Provide decision-quality information and recommendations to DABs, In Progress Reviews, Peer Reviews, and PDR\/CDR assessments.\n\nStrategic Thrust:  Work Force Development\n• Carry out duties as Functional Lead for Engineering (ENG), Production, Quality, and Manufacturing (PQM), all Department non-construction engineering and assist software engineering.\n• Build an enduring high performance engineering culture across the Department in Systems Engineering.\n• Update and deploy courses with increased technical rigor and complex, case-based exercises.\n• Investigate workforce development initiatives including leadership development, specialized training, and improved instructional methods.\n• Assess engineering workforce capability and capacity, and, working with Components, develop strategies to address identified gaps.\n• Perform outreach to services and OSD to focus the Department’s attention and behavior on promoting an engineering culture.\n\nStrategic Thrust:  Engineering Policy and Guidance\n• Develop and update core SE policy, guidance and standards; review all acquisition policy for SE implications.\n• Develop engineering guidance and policies for SE responsibility in the acquisition process including, but not limited to, software modeling and simulation; configuration management; data management; and risk management.\n• Assess challenges and impact; develop new guidance, best practices, methods, processes and tools to more effectively implement SE for Systems of Systems.\n• Provide guidance to Defense acquisition programs for developing and documenting each program’s technical strategy and management approach in the SEP throughout the program’s lifecycle. \n\nStrategic Thrust: Specialty Engineering\n• Develop engineering guidance and policies for the integration of specialty engineering functions as part of the SE responsibility in the acquisition process including, but not limited to manufacturing engineering; reliability and maintainability engineering; human systems integration and value engineering. \n• Conduct studies and analyses of MPT to identify challenges and opportunities and develop and promulgate best practices and guidance for applying specialty engineering principles, concepts, and practices in defense acquisition programs.  \n• Conduct activities to develop and implement plans to enhance the specialty engineering workforce.\n\nStrategic Thrust: Systems Engineering Capabilities Assessment \n• Work jointly with DT&E to develop and track measurable performance criteria.\n• Develop and strengthen component SE organization and capabilities.\n• Periodically review the organizations and capabilities of the Military Departments and Defense Agencies with respect to systems engineering, development planning, and lifecycle management and sustainability, and identify needed changes or improvements to such organizations and capabilities. • Issue guidance to and consult with the Heads of the DoD Components with respect to systems engineering and development planning in the DoD. \n• Store and analyze performance criteria from MDAP SEPs and test documentation; develop program metrics to aid SE assessments and program execution.\n\nStrategic Thrust:  Early Systems Engineering and Development Planning\n• Perform early acquisition risk assessment including pre-MS A engagement with Joint Requirements Oversight Council processes.\n• Support: (1) Services and COCOMs in pre-MS A formulation; (2) requirements analyses and analysis of alternatives; and (3) initial capabilities document definition and development.\n\nStrategic Thrust:  Engineering Tools and Environments\n• Support implementation of digital engineering principles, concepts and practices into the activities of the DoD related to all aspects of weapon system lifecycle and use.\n• Establish guidance and education to support digital engineering use in Systems Engineering.\n• Normalize the separate concepts of digital engineering, modeling and simulation, and model-based\/model-centric items into a cohesive enabler for national defense system lifecycle activities.\n• Continue collaboration in digital engineering methods, processes, tools development and gap identification to initiate research and development of gap filling technologies and methods.\n• Oversee the collaborative development of comprehensive guidance for proper identification of modular and open enablers; and effective use of such in the lifecycle activities of national defense systems.\n• Oversee development of, and incorporation of modularity and open system technical enablers by Services in their acquisition efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "35.140"
                                            },
                                            "Text": {
                                                "val": "Strategic Thrust:  Program Support \n• Monitor programs, providing SE oversight and support to acquisition and special interest programs\n• Enhance implementation of Independent Technical Risk Assessments (ITRAs) through increased technical analysis, improved access to technical subject matter experts and collaboration with the Services\n• Expand engineering support to include alternate acquisition pathways, e.g. Middle-Tier of Acquisition and Software Intensive Acquisition programs\n• Expand use of detailed performance measurement and analysis\n• Provide decision-quality information and recommendations to Defense Acquisition Boards (DAB), In Progress Reviews, Peer Reviews, and PDR (Preliminary Design Review)\/Critical Design Review (CDR) assessments\n\nStrategic Thrust:  Workforce Development\n• Carry out duties as Functional Lead for Engineering (ENG), Production, Quality, and Manufacturing (PQM), Test and Evaluation (T&E), and all Department non-construction engineering and quality assurance\n• Build an enduring high performance engineering culture across the Department\n• Update and deploy courses with increased technical rigor and complex, case-based exercises\n• Pursue workforce development initiatives including leadership development, specialized training, and improved instructional methods\n• Assess engineering workforce capability and capacity, and, working with Services and other Component organizations, develop strategies to address identified gaps\n\nStrategic Thrust:  Engineering Policy and Guidance\n• Develop and update core SE and T&E policy, guidance, and standards; review all acquisition policy for SE and T&E implications\n• Develop engineering and T&E guidance and policies for the acquisition process including, but not limited to, software modeling and simulation; configuration management; data management; and risk management\n• Assess challenges and impact; develop new guidance, best practices, methods, processes and tools to more effectively implement SE for Systems of Systems (SoS)\n• Provide guidance to Defense acquisition programs for developing and documenting each program’s technical strategy and management approach in the Systems Engineering Plan (SEP) and Test and Evaluation Master Plan (TEMP) throughout the program’s lifecycle\n\nStrategic Thrust: Specialty Engineering\n• Develop engineering guidance and policies for the integration of specialty engineering functions as part of the SE responsibility in the acquisition process\n• Conduct studies and analyses to identify challenges and opportunities to develop and promulgate best practices and guidance for applying specialty engineering principles, concepts, and practices in defense acquisition programs\n• Conduct activities to develop and implement plans to enhance the specialty engineering workforce\n\nStrategic Thrust:  Early Systems Engineering and Development Planning\n• Expand USD(R&E) participation in the Joint Capabilities Integration and Development System to enhance capability and systems requirements development though systems \/ missions engineering insights\n• Perform early acquisition risk assessment including pre-Milestone A (pre-MS A) engagement with Joint Requirements Oversight Council processes\n• Support: (1) Services and Combatant Commands (CCMD's) in pre-MS A formulation; (2) requirements analyses and analysis of alternatives; and (3) initial capabilities document definition and development\n\nStrategic Thrust:  Engineering Tools and Environments\n• Support implementation of digital engineering principles, concepts, and practices into the activities of the DoD related to all aspects of weapon system lifecycle and use\n• Establish guidance and education to support digital engineering use in systems engineering\n• Continue identifying gaps in digital engineering methods, processes, tools to inform research and development.\n• Develop comprehensive guidance for development and use of modular and open architectures to support integration of emerging technologies"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.976"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.976"
                                            },
                                            "Text": {
                                                "val": "Strategic Thrust: Program Support\/Technical Risk Assessments\n• Enhance independent technical risk assessments\n• Provide risk assessments to support cost, schedule, and performance targets required by U.S.C. 10 Sec 2448a\n• Expand engineering support to Missile Defense Agency programs\n• Increase support to Software Acquisition programs\n• Support acceleration of USD(R&E)’s modernization initiatives in accordance with the National Defense Strategy\n• Provide engineers and technical leaders to develop and integrate technologies and modernization priorities\n• Continued support to acquisition program managers in developing and documenting viable technical management approach\n• Conduct technical reviews of acquisition to confirm program execution in accordance with systems engineering plans\n\nStrategic Thrust:  Workforce Development\n• Carry out duties as Functional Lead for Engineering (ENG), Production, Quality, and Manufacturing (PQM), Test and Evaluation (T&E), and all Department non-construction engineering and quality assurance\n• Build an enduring high performance engineering culture across the Department\n• Update and deploy courses with increased technical rigor and complex, case-based exercises\n• Pursue workforce development initiatives including leadership development, specialized training, and improved instructional methods\n• Assess engineering workforce capability and capacity, and, working with Services and other components organizations, develop strategies to address identified gaps\n\nStrategic Thrust:  Engineering Policy and Guidance\n• Develop and update core SE and T&E policy, guidance and standards; review all acquisition policy for SE and T&E implications\n• Develop engineering and T&E guidance and policies for the acquisition process including, requirements for use in alternate acquisition pathways\n• Assess challenges and impact; develop new guidance, best practices, methods, processes and tools to more effectively implement SE for product lines and system of systems (SoS)\n• Provide guidance to Defense acquisition programs for developing and documenting each program’s technical strategy and management approach in the SEP and TEMP throughout the program’s lifecycle\n\nStrategic Thrust: Specialty Engineering\n• Develop engineering guidance and policies for the integration of specialty engineering functions as part of the SE responsibility in the acquisition process not limited to manufacturing engineering; reliability and maintainability engineering; human systems integration; and value engineering\n• Conduct studies and analyses to identify challenges and opportunities to develop and promulgate best practices and guidance for applying software engineering principles, concepts, and practices in defense acquisition programs  \n• Conduct activities to develop and implement plans to enhance the specialty engineering workforce\n\nStrategic Thrust:  Early Systems Engineering and Development Planning\n• Expand USD(R&E) participation in the Joint Capabilities Integration and Development System to enhance capability and systems requirements development though systems \/ missions engineering insights\n• Perform early acquisition risk assessment including pre-MS A engagement with Joint Requirements Oversight Council processes\n• Support: (1) Services and COCOMs in pre-MS A formulation; (2) requirements analyses and analysis of alternatives; and (3) initial capabilities document definition and development\n\nStrategic Thrust:  Engineering Tools and Environments\n• Develop and sustain digital engineering and modular open systems approaches (MOSA) across the Department through policy, guidance, standards, and major program support\n• Develop and apply a digital engineering concept of operations, to include using model-based processes, products, training, data\/model management to support analysis of prototype development efforts, ease integration of emerging technologies and gauge impacts on overall mission performance\n• Develop and use a common semantic framework to enable modular open architectures and cross-domain tool interoperability, compatibility and reuse\n• Promote use of decision support environments and high-fidelity simulations for trade space analysis and development of resilient designs\n\nStrategic Thrust: Systems Architectures\n• System Technical Architecture Foundations.  Develop product line reference architectures, including methods for governing changes and managing technical data.  Develop and conduct training in use of reference architectures.\n• Perform architecture assessments to verify compliance of major systems interfaces through use of standards.  Provide recommendations to improve compliance. \n• Analysis.  Perform architecture tradeoff analyses to enable effective mission engineering and manage integration of emerging technologies with systems in development, and in operation.  \n• Inter-System of Systems Architecture Analysis: develop policy and guidance on system architecture verification, interoperability analysis, architecture development plans, and system of system (SoS)-level capability gaps\n• Implement a taxonomy and ontology establishing the basis for process and application data standardization and usability\n\nStrategic Thrust: Modeling and Simulation (M&S)\n• Enhance the Defense M&S Reference Architecture with additional patterns identified through user feedback.\n• Develop M&S framework and conduct M&S analyses to support Mission Engineering\n• Work with USSOCOM and Simulator Interoperability Senior Steering Group to execute implementation of the OUSD(R&E)-signed Decision Memorandum.\n• Represent U.S. interests in International M&S activities as required."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort increases by $7.843 million from FY 2020 and FY 2021.  These changes reflect a net of a transfer of Test & Evaluation Policy Workforce from Development Test & Evaluation (PE 0605804D8Z), a resource realignment from Engineering Science & Technology (PE 0603833D8Z) and a reduction for DoD priorities and economic assumption adjustments.  Overall, the level of effort is a significant increase in investment in program support, to include an increase in the quality of technical risk assessments, as well as establishing reference architectures to enable transition of emerging technologies into acquisition programs and systems currently in operation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "143"
                    },
                    "ProjectTitle": {
                        "val": "Program Protection"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "29.207"
                        },
                        "PriorYear": {
                            "val": "5.986"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program element (PE) supports the program protection activities of the Deputy Director, Strategic Technology Protection and Exploitation (DD, STP&E).  The Department of Defense (DoD) must address cybersecurity and supply chain risks to DoD networks, weapons systems, and information stored and processed on both DoD and Defense Industrial Base (DIB) unclassified contractor information networks that support DoD programs.  Increased reliance on the internet as a vehicle for sharing information, globalization of the supply chain, and advanced persistent threats (APTs) that can evade commercially available security tools and defeat generic security best practices, drives the need for diligent program protection planning and execution.  Program Protection Planning (PPP) includes protection of classified and unclassified controlled technical information, critical program information, critical components, and critical mission functions, and integrates high-level security policies and practical expertise to specific acquisition and S&T practices, systems engineering activities, and risk reduction activities.  Through this initiative the Department is maturing system security engineering methodologies to protect controlled unclassified information, to include controlled technical information on contractor information networks; improve mitigation and management of supply chain risk management risks, improve integration of cybersecurity into the engineering processes, improve software assurance practices, mature processes to identify and protect Critical Program Information and improve program protection planning.  Activities carried out, support implementation of DoD Instruction 5200.44 Trusted Systems and Networks with the use of proven mitigation techniques and tools, the ongoing refinement of risk management processes, and creation of needed technology; implementation of DoD Instruction 5200.39  Critical Program Information (CPI) Identification and Protection Within Research, Development, Test, and Evaluation (RDT&E) to identify and protect Critical Program Information; and implementation of DoD Instruction 8582.01 Security of Unclassified DoD Information on Non-DoD Information Systems for Safeguarding Controlled Unclassified Information on contractor owned networks.\n\nDD, STP&E provides independent assessments of research, technology and defense acquisition program’s system security engineering and program protection implementation.\n\nThe DD, STP&E reviews and approves the PPP for each Major Defense Acquisition Program, and monitors and reviews the system security engineering planning activities of MDAPs and other defense acquisition programs, as directed by the Secretary of Defense.  \n\nThis PE includes efforts by the office of the DD, STP&E in implementing the Department’s Trusted Defense System Strategy.  Specifically, the PE will develop and mature the critical sub discipline of systems engineering - system security engineering (SSE), Hardware and Software Assurance, and the Comprehensive Program Protection Planning process that implements a risk-based approach to protection of critical program information, critical components and mission functions, and information in acquisition programs.  These efforts include study and maturation of policy, guidance, system security discipline fundamentals, such as engineering methods, tools, and best practices, and establishing a coalition of assurance activities across the DoD to provide analytical and technical support to acquisition programs.  These activities will be promulgated in defense acquisition as a fundamental element of the DD, STP&E systems engineering and technical reviews. \n\nIn FY 2020, funding from this project will transfer to the Maintaining Technology Advantage PE 0605797D8Z, in alignment with the DD, STP&E mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Protection"
                                    },
                                    "Description": {
                                        "val": "The project provides system security engineering policy, guidance, and objective assessments to reduce risks in sharing and storing Controlled Technical Information, improve mitigation of supply chain risk management risks, improve integration of cybersecurity into the engineering processes, integrate defense exportability and anti-tamper practices, mature processes to identify Critical Program Information and improve program protection planning.  Activities carried out support implementation of DoD Instruction 5200.44 Trusted Systems and Networks with the use of proven mitigation techniques and tools, the ongoing refinement of risk management processes; implementation of DoD Instruction 5200.39 Critical Program Information (CPI) Identification and Protection Within Research, Development, Test, and Evaluation (RDT&E) to identify and protect Critical Program Information; and implementation of DoD Instruction 8582.01 Security of Unclassified DoD Information on Non-DoD Information Systems for Safeguarding Controlled Unclassified Information on contractor owned networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.986"
                                            },
                                            "Text": {
                                                "val": "• Provide support to Independent Cyber Vulnerability Review Assessment teams in conduct of broad program protection planning activities to assess:\n   - Conduct of criticality analyses to determine capability, systems and technology vulnerabilities.\n   - Conduct Program Protection planning activities, and track progress to verify protection of critical program capabilities and technologies.\n• Advance the state of the practice of systems security engineering:\n   - Continue development of methodology to identify and mitigate system security risk, to include cybersecurity risk.\n   - Continue to develop courseware, refine guidance, provide training, and outreach with government and industry.\n   - Refine guidance, tools and mitigation approaches to mitigate capability, system and technology risks.\n• Safeguard Controlled Technical Information and technology:\n   -  Refine implementation and guidance of marking and dissemination of distribution of technical information\n   -  Develop and refine safeguarding information protection methods for contractor unclassified information networks."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "842"
                    },
                    "ProjectTitle": {
                        "val": "Mission Engineering"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.000"
                        },
                        "CurrentYear": {
                            "val": "2.000"
                        },
                        "BudgetYearOne": {
                            "val": "4.400"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.400"
                        },
                        "BudgetYearTwo": {
                            "val": "4.409"
                        },
                        "BudgetYearThree": {
                            "val": "4.406"
                        },
                        "BudgetYearFour": {
                            "val": "4.415"
                        },
                        "BudgetYearFive": {
                            "val": "4.456"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) establishes a dedicated funding line to support activities to carry out responsibilities described in FY 2017 National Defense Authorization Act (NDAA) Section 855 titled Mission Integration Management (MIM).\n\nThe Mission Engineering (ME) PE supports the National Defense Strategy goals of developing a more lethal force by instituting an enterprise level mission engineering approach to analyzing near-, mid-, and long-term gaps and solutions.  The enterprise necessarily includes the Services, the Combatant Commands, and the Joint Staff.  The activities conducted through this PE will provide engineering analysis at the mission, campaign, and engagement levels to support the prioritization of the Department’s modernization initiatives.  This systematic enterprise approach will support the realization of mission capability by assessing the joint mission gaps and capability solutions against anticipated adversaries in relevant operational environments.  Mission engineering will support development of an analytically sound set of decisions resulting in a more rigorous technical assessment against technical priorities.  The PE will support establishment of multiple mission architectures and further support and align investment opportunities in order to take advantage of tech surprise opportunities, maintain a tactical edge, insert technology, improve interoperability and formulate long-term strategies to retain or improve our capabilities against our adversaries.  Deputy Director, Engineering (DD, Eng) oversees, initiates, or recommends opportunities to align technology investments to accelerate capability delivery, or modifying existing systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mission Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "• Coordinate with Joint Service and commanders of the combatant commands to identify major threats, mission scope, Concept of Operations (CONOPS) development, and Operation Plans (OPLAN). \n• Initiate translation of multi-Service and Coalition mission-based needs for the requirements process, resulting in Capability Requirements.  \n• Develop strategy to use relevant Cross-Service mission threads in coordination with Joint Staff to identify capability gaps. \n• Determine where multi-Service and Coalition mission areas would benefit from mission engineering and a coordinated implementation approach to set an operational context."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "• Coordinate with Joint Service and Commanders of the Combatant Commands to identify major threats, mission scope, Concept of Operations (CONOPS) development, and Operation Plans (OPLAN). \n• Initiate translation of multi-Service and Coalition mission-based needs for the requirements process, resulting in Capability Requirements.  \n• Develop strategy to use relevant cross-Service mission threads in coordination with Joint Staff to identify capability gaps. \n• Determine where multi-Service and Coalition mission areas would benefit from mission engineering and a coordinated implementation approach to set an operational context.\n• Prioritize and\/or provide resources for initial Joint mission engineering analysis.\n• Conduct mission characterization activities for selected Joint missions. \n   - Develop mission based inputs and options for concepts, requirements, prototypes, resources, mission design, and operationally relevant test environment.  Includes identification of data needs to assess capability performance, i.e., gain an understanding of objectives, key users, user roles and expectations, and constituent system capabilities.\n   - Review available performance and test data for the selected Joint mission area(s).\n• Define mission architecture framework and develop initial artifacts.\n• Provide decision support to prioritize investments.\n• Establish and apply mission engineering analysis tools and infrastructure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.400"
                                            },
                                            "Text": {
                                                "val": "• Continue to establish enduring mission engineering analytic capability and increased capacity\n• Perform high-level executable system of system architecture trades and analyses for product line and technology to address mission capability gaps\n• Develop architecture framework that synthesizes artifacts across the Department including metrics, resource estimates and program impacts\n• Continue development of government reference mission architectures\n• Expand mission engineering support to additional high priority mission sets and joint mission based prototyping projects."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort increases by $2.400 milion from FY 2020 to FY 2021.  These changes reflect an increase in investment in mission engineering to include addition of tools and an increase in capability to conduct mission level assessments."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "078"
                    },
                    "ProjectTitle": {
                        "val": "Integration Technology and Tools"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.008"
                        },
                        "BudgetYearThree": {
                            "val": "2.008"
                        },
                        "BudgetYearFour": {
                            "val": "2.105"
                        },
                        "BudgetYearFive": {
                            "val": "2.136"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project P142 supports the National Defense Strategy goals of developing a more lethal force by instituting an enterprise-wide research, methods, practices and tools to: integrate technology innovations to improve the systems engineering practices; develop systems engineering architecting techniques and formats, supporting modular, rapid fielding of mature warfighting capabilities; and use common, reusable hardware and software components that can be more readily adapted and refreshed, allowing DoD to deploy and support the latest technologies.  The project also sustains the ability to identify and\/or create innovative methods and tools in systems engineering practice to improve the Department’s ability to develop and deploy complex weapon systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integration Technology and Tools"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Strategic Thrust:  Integration, Technology and Tools \n• Develop comprehensive engineering methods for development and use of modular and open architectures to support integration of emerging technologies\n• Establish MOSA Technical Evaluation that assesses an acquisition technical approach for modular design practices included in (1) technical plan, (2) architecture, and (3) design to develop a technical solution with a modular open system approach.\n• Develop and apply a digital engineering concept of operations, to include using model-based processes, products, training, data\/model management to support analysis of prototype development efforts, ease integration of emerging technologies and gauge impacts on overall mission performance\n• Provide Methods, Processes, and Tools to Manage MOSA Business Practices for Intellectual Property and Tech Data Management; provide the ability for competition of replacement elements, when properly supported by appropriate data rights\/intellectual property access\n• Develop and use engineering tools\/models: Architectures, Digital Engineering, Software, and Specialty Engineering (e.g. R&M, Manufacturing, HSI, System Safety)\n• Provide flexible, user-configurable tools and experienced analytical capability to enable cross system, system of system and family of system analysis of component systems, capabilities, and organizations\n• Develop Knowledge Management systems to provide methods and systematic approaches for information and knowledge flow to and between the stakeholders at the right time for the right use\n• Sponsor and oversee research on and development of (including tests and demonstrations) automated tools for composing systems of systems on demand (FY17 NDAA Sec 855)\n\nStrategic Thrust:  Systems Engineering Research Center (SERC) \n• Complete SERC funded projects started in prior fiscal years; work with the Services to identify which ongoing projects they may wish to maintain, conclude or initiate with Service funding; and establish a business model to sustain SERC’s network of universities.  The SERC efforts directly aligns USD(R&E) efforts to the Department’s modernization priorities.\n• Sustain capabilities that support innovation and the use of critical technology for emergent and evolving mission objectives"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in the funding profile reflects the realignment of the SERC effort from Engineering Science and Technology (0603833D8Z) in FY 2021."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}