{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-59",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605027D8Z"
        },
        "ProgramElementTitle": {
            "val": "OUSD(C) IT Development Initiative"
        },
        "R1LineNumber": {
            "val": "132"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "77.446"
            },
            "PriorYear": {
                "val": "9.219"
            },
            "CurrentYear": {
                "val": "9.590"
            },
            "BudgetYearOne": {
                "val": "10.259"
            },
            "BudgetYearOneBase": {
                "val": "10.259"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "10.592"
            },
            "BudgetYearThree": {
                "val": "10.912"
            },
            "BudgetYearFour": {
                "val": "11.341"
            },
            "BudgetYearFive": {
                "val": "11.653"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "BUDGET REQUEST JUSTIFICATION:  +$10.259 million is required to support the following efforts:\n\n+$4.221 million is required to support Next Generation Resource Management Systems.\n\n+$6.038 million is required to support Defense Repository for Common Enterprise Data (Advana)"
        },
        "ProgramElementMissionDescription": {
            "val": "As the Department of Defense strategic, operational, and tactical plans and objectives transform the war fighter with new capabilities and doctrine, the budgeting and accountability of funds used to pursue the Department objectives will become more complicated and detailed for senior leaders to make decisions with supporting rationale for the taxpayer.  Incorporating information technology toward current and emerging business processes manifesting into a state-of-the art system of systems will result in increasing efficiencies, timely diagnostics, and reducing lifecycle costs to maintain, sustain and repair.\n\nThis initiative exploits emerging technology, processes, trends, capabilities, and techniques to incorporate state-of-the-art information technology enabling the ability, agility, and level of fidelity to collect, process, administrate and report resource management data and to automate business processes within a more robust analytical environment within the Office of the Under Secretary of Defense (Comptroller) OUSD(C).\n  \nNEXT GENERATION RESOURCE MANAGEMENT SYSTEM:\n\nThe Office of the Under Secretary of Defense (Comptroller) (OUSD(C)) is responsible for advising the Secretary of Defense on all Defense budgetary and fiscal matters, for Defense budget development and execution, and for overseeing financial management across the Department. The OUSD(C) has a broad set of responsibilities in supporting the Planning, Programing, Budget and Execution (PPBE) process. The Office of the Director, Cost Assessment and Program Evaluation (CAPE), provides independent analytic advice to the Secretary of Defense on all aspects of the Defense program, including alternative weapon systems and force structures, the development and evaluation of program and defense program alternatives, and the cost-effectiveness of defense systems.  There is a critical need for the development of a state-of-the-art information technology system to modernize and replace multiple, antiquated legacy systems and processes used to formulate, justify, present and defend the entire Department of Defense Budget in the Office of the Under Secretary of Defense (Comptroller (OUSD(C)) to meet Title 10 and Title 31 mission and reporting requirements. The Comptroller’s plan for mitigating the deficiencies and capability gaps associated with current systems is development of the Next Generation Resource Management System.\n\nOUSD(C) and CAPE use multiple systems to formulate, justify, distribute, and execute DoD budgets. The information managed by the budget formulation and programming systems is redundant, and reconciliation of information is difficult and inefficient. These systems require extensive manpower investments to give executives the information they need to make key financial decisions in a timely manner.\n\nThe OUSD(C) and CAPE require a more efficient, effective Defense budget environment that optimizes the budget cycle to ensure users are processing and reporting efficiently and DoD Senior Leadership has the information to make informed, critical decisions.\n\nThe OUSD(C) requires capabilities that shall provide for the effective formulation, and justification of the Defense budget. The requirement is for:\n• Automated exchange and reconciliation of budget data\n• Improved efficiency through the utilization of a unified budgetary model\n• Instantaneous ability to generate data for management reviews and decisions\n• Capability to accommodate emerging business practices\n\nMoving forward, the new “to be” system shall be designed as a single system with a unified data source for OUSD(C) and CAPE. The new system shall provide a single, integrated system that employs the latest technologies to fulfill the Department’s financial management responsibilities in an effective and efficient manner. The new system shall provide twenty-first century information technology that shall allow users to view information from multiple fully integrated modules simultaneously, e.g., current year budget submission, decision documents from previous years, and budget execution information.\n\nDEFENSE REPOSITORY FOR COMMON ENTERPRISE DATA:\n\nDefense Repository for Common Enterprise data (Advana) support financial audit, cost management, performance management, and readiness.\n\nThe DoD Advana requires:\n• All supporting Department data that rolls up to the DoD financial statement (detailed accounting data reconciled to the financial statement)\n• Proof of the completeness of all transactional data reported within the UoT (detailed accounting data reconciled to business events)\n• Ability to extract subset populations\n• Ability to secure and protect the data within the UoT\n\nThe failure to meet these requirements will result in the Department unable to successfully conduct and pass an audit.\n\nTo achieve these requirements, the Office of the Under Secretary of Defense (Comptroller) is creating a tool called the Defense Repository for Common Enterprise Data (Advana). This tool has the potential to significantly improve DoD’s capability and capacity to handle large volumes of standard and non-standard business and readiness data. Both an application and analytical platform, the Advana leverages an open-source software framework for storing data and running applications to deliver a complete Advana.\n\nThe first phase of Advana implementation is a proof of concept with the U.S. Special Operations Command (USSOCOM) systems to develop a baseline application and configuration. When the first phase has been successfully completed, the second phase will integrate into the full solution any remaining accounting and business feeder systems that execute TI-97 funds and be the solution for DATA Act. The proof of concept was successful and the program moved to an operations phase in FY18.\n\nDRCED is a joint effort between Office of the Deputy Chief Financial Officer (ODCFO), Office of the Chief Management Officer (ODCMO), Office of the Chief Information\nOfficer (OCIO), USSOCOM, and the Defense Finance and Accounting Service (DFAS)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.568"
                },
                "CurrentYear": {
                    "val": "15.653"
                },
                "BudgetYearOne": {
                    "val": "14.274"
                },
                "BudgetYearOneBase": {
                    "val": "14.274"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.219"
                },
                "CurrentYear": {
                    "val": "9.590"
                },
                "BudgetYearOne": {
                    "val": "10.259"
                },
                "BudgetYearOneBase": {
                    "val": "10.259"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.349"
                },
                "CurrentYear": {
                    "val": "-6.063"
                },
                "BudgetYearOne": {
                    "val": "-4.015"
                },
                "BudgetYearOneBase": {
                    "val": "-4.015"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-6.063"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.349"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.500"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.103"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.103"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.012"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.012"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense Wide Review Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.400"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.400"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2021 BUDGET REQUEST JUSTIFICATION: +$4.221 million is required to support Next Generation Resource Management System (NGRMS).and $6.038 million is required to support Defense Repository for Common Enterprise Data.  \n\nThe FY2021 funding request was reduced by $2.400 million during the Defense Wide Review to account for implementing efficiencies in the acquisition strategy for NGRMS."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "927"
                    },
                    "ProjectTitle": {
                        "val": "Next Generation Resource Management System"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "39.984"
                        },
                        "PriorYear": {
                            "val": "1.219"
                        },
                        "CurrentYear": {
                            "val": "4.983"
                        },
                        "BudgetYearOne": {
                            "val": "4.221"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.221"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.346"
                        },
                        "BudgetYearThree": {
                            "val": "4.487"
                        },
                        "BudgetYearFour": {
                            "val": "4.695"
                        },
                        "BudgetYearFive": {
                            "val": "4.871"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Realignment of $1.5M to PE:  0903388D8Z"
                        },
                        "ProjectMissionDescription": {
                            "val": "The Office of the Under Secretary of Defense (Comptroller) (OUSD(C)) is responsible for advising the Secretary of Defense on all Defense budgetary and fiscal matters, for Defense budget development and execution, and for overseeing financial management across the Department. The OUSD(C) has a broad set of responsibilities in supporting the Planning, Programing, Budget and Execution (PPBE) process. The Office of the Director, Cost Assessment and Program Evaluation (CAPE), provides independent analytic advice to the Secretary of Defense on all aspects of the Defense program, including alternative weapon systems and force structures, the development and evaluation of programs and defense program alternatives, and the cost-effectiveness of defense systems. \n\nOUSD(C) and CAPE use multiple systems to formulate, justify, distribute, and execute DoD budgets. The information managed by the budget formulation and programming systems is redundant, and reconciliation of information is difficult and inefficient. These systems require extensive manpower investments to give executives the information they need to make key financial decisions in a timely manner.\n\nThe OUSD(C) and CAPE require a more efficient, effective Defense budget environment that optimizes the budget cycle to ensure users are processing and reporting efficiently and DoD Senior Leadership has the information to make informed, critical decisions. \n\nThe OUSD(C) requires capabilities that shall provide for the effective formulation, and justification of the Defense budget. The requirement is for:\n• Automated exchange and reconciliation of budget data\n• Improved efficiency through the utilization of a unified budgetary model\n• Instantaneous ability to generate data for management reviews and decisions\n• Capability to accommodate emerging business practices\n\nMoving forward, the new “to be” system shall be designed as a single system with a unified data source for OUSD(C) and CAPE. The new system shall provide a single, integrated system that employs the latest technologies to fulfill the Department’s financial management responsibilities in an effective and efficient manner. The new system shall provide twenty-first century information technology that shall allow users to view information from multiple fully integrated modules simultaneously, e.g., current year budget submission, decision documents from previous years, and budget execution information."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Next Generation Resource Management System"
                                    },
                                    "Description": {
                                        "val": "Plan, develop, test and evaluate the system components (i.e. unified database, expert system, cross domain security, enterprise service bus, applications, services) and supportability requirements in modernizing the budget formulation, programming execution and reporting capabilities for the Department of Defense. Activities will include, but not be limited to, the preparation of all documentation required for Clinger-Cohen Compliance and acquisition regulations, developing requests for proposals, and oversight and management of contracts and deliverables."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.219"
                                            },
                                            "Text": {
                                                "val": "FY 2019 planned development will include the build out of MilCloud Development environment, development of business processes for single submission of budget data, and the design and development of a single submission interface that provides a standardized Data Collection Form to populate a standardized Database Structure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.983"
                                            },
                                            "Text": {
                                                "val": "FY 2020 planned development will include the development of a Single Submission prototype with the results used to structure the design, development, testing and deployment of future NGRMS increments.  FY 2020 plans also include the milCloud build of the Development, Production, and COOP environments for NGRMS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.221"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.221"
                                            },
                                            "Text": {
                                                "val": "FY 2021 planned development will include the development, developmental and operational test, and deployment of the production interfaces. Development and developmental test of the reporting\/analytic tool will start in FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease is due to $1.500 million realignment to O&M to fund the sustainment of the NGRMS milCloud environments and single submission capability."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Agile development on a smaller scale to replace legacy mission subsystems capabilities."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD(C)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon & Contractor Off-site Facility"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "39.984"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.219"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.983"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.221"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.221"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "NGRMS Notional Schedule 20191231.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "NGRMS"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Single Submission"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Database Consolidation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Data Analytics"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "MilCloud Infrastructure"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Complete Single Submission Product Interfaces"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Tie in Enactment\/Accounting System"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "B2A\/EFD NGRMS"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "B2A\/EFD MILCloud Infrastructure"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "930"
                    },
                    "ProjectTitle": {
                        "val": "Defense Repository for Common Enterprise Data"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "37.462"
                        },
                        "PriorYear": {
                            "val": "8.000"
                        },
                        "CurrentYear": {
                            "val": "4.607"
                        },
                        "BudgetYearOne": {
                            "val": "6.038"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.038"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.246"
                        },
                        "BudgetYearThree": {
                            "val": "6.425"
                        },
                        "BudgetYearFour": {
                            "val": "6.646"
                        },
                        "BudgetYearFive": {
                            "val": "6.782"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "+$6.038 million is required to support Defense Repository for Common Enterprise Data (Advana)."
                        },
                        "ProjectMissionDescription": {
                            "val": "Without a single Defense Repository for Common Enterprise Data (Advana) to support the TI97 General Fund for the 4th Estate the Department will be incapable of asserting readiness for an independent audit of the\nconsolidated financial statements. All DoD organizations are pursuing the current statutory goal of achieving the state of audit that supports entry into a full financial\nstatement of audit in FY 2018 with an initial opinion rendered in mid-FY 2019. Without an automated capability to provide a transactional universe for sampling and\nevidentiary proof the department will not be in compliance with public law.\n\nThe requested funds will be used to buy “Big Data” software and hardware infrastructure and required contractor services to implement the technology to meet the UoT\nrequirement.  These funds also include subject matter expertise costs for DCFO and funds to be placed on a contract for hardware, software, and labor. This will not result in hiring additional government personnel.\n\nThe Defense Repository for Common Enterprise Data (Advana) will have the capability to:\n• Ingest data from multiple accounting and financial feeder systems\n• Normalize data from multiple sources providing a common data architecture\n• Reconcile transactional details to summary financial data\n• Provide auditor’s the ability to sample TI-97 detailed transactions\n• Business Analytics\/Reporting\n• DATA Act which is a statutory requirement to be completed by May 2017\n• Provide NIPR and SIPR capability for non-sensitive and sensitive data\n\nThis effort will expand in scope to support other enterprise analytics efforts like cost management, performance management, and readiness. The scope is to bring in\ndata from an estimated 50 systems and demonstrate existence and completeness of business and accounting transaction data, which are capabilities required for audit\nreadiness and other analytical use cases."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Repository for Common Enterprise Data (Advana)"
                                    },
                                    "Description": {
                                        "val": "Plan, develop, test and evaluate the system components (i.e. unified database, cross domain security, applications, services) and supportability requirements in creating a universe of transactions for the Defense Wide General Fund Appropriation financial audit, cost management, performance management, and readiness.\n\nThe funds will be used to support increments eleven, twelve, and thirteen per the schedule."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "FY19 develops and implements a SIPR environment for Cost Accounting Framework to meet Operations Security (OPSEC) and Information Security (INFOSEC) requirements"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.607"
                                            },
                                            "Text": {
                                                "val": "FY20 continues the development of a Defense Repository for Common Enterprise Data (Advana) to aggregate and fuse multiple data sources to make business and analytical decisions, find data inconsistencies and improve financial audits across the DoD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.038"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.038"
                                            },
                                            "Text": {
                                                "val": "FY21 continues the development of a Defense Repository for Common Enterprise Data(Advana) to accelerate analytics, improve user success and Advana adoption, provide a stable and robust infrastructure across the DoD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Continues the development of a Defense Repository for Common Enterprise Data(Advana) to accelerate analytics, improve user success and Advana adoption, provide a stable and robust infrastructure across the DoD."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Leveraging existing contracts to continue development."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD(C)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "37.462"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.607"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-08"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.038"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.038"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-08"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "ADVANA Schedule_2019.8_Page_1.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "ADVANA Schedule_2019.8_Page_2.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "ADVANA Schedule_2019.8_Page_3.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Acquisiiton Milestone"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Development and ingest further data"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}