{
    "id": "2021-AirForce-PB-3600-JBOOK-127ae6e85843ddc6871072af4dec97bbf1550cf5a3bf0eaf2a4d125ea55ea6dc-61",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V2-U_RDTE_JustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0605030F"
        },
        "ProgramElementTitle": {
            "val": "Joint Tactical Network Center (JTNC)"
        },
        "R1LineNumber": {
            "val": "99"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "2.414"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "8.340"
            },
            "BudgetYearThree": {
                "val": "8.488"
            },
            "BudgetYearFour": {
                "val": "8.340"
            },
            "BudgetYearFive": {
                "val": "8.494"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "2.414"
                },
                "BudgetYearOne": {
                    "val": "8.182"
                },
                "BudgetYearOneBase": {
                    "val": "8.182"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "2.414"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-8.182"
                },
                "BudgetYearOneBase": {
                    "val": "-8.182"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-8.182"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.182"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "655068"
                    },
                    "ProjectTitle": {
                        "val": "Joint Tactical Radio System (JTRS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.414"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "8.340"
                        },
                        "BudgetYearThree": {
                            "val": "8.488"
                        },
                        "BudgetYearFour": {
                            "val": "8.340"
                        },
                        "BudgetYearFive": {
                            "val": "8.494"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The JTNC is responsible for ensuring secure, interoperable, and resilient tactical communications capabilities aligned to modular open architectures in support of Service, Multi-Service, and Coalition forces. The JTNC: (1) maintains a cyber-hardened DoD Information Repository (IR), (2) provides Technical Analyses\/Capability Characterizations on tactical communications products, (3) provides Open Systems Architecture Standards, (4) exportability analysis and licensing reviews, and (5) serves as Technical Advisor to the Communications, Command, and Control Leadership Board (C3LB).\n\nThis mission is executed in conjunction with other government agencies to include the National Security Agency (NSA), the Joint Interoperability Test Command (JITC), the National Telecommunication and Information Administration (NTIA), the Services, as well as Matrix and Industry partners. Particular attention is paid to ensuring that interagency work is collaborative and eliminates duplicative capability. The JTNC enables a common software baseline that is hardware agnostic leading to increased competition for Software Defined Radios (SDR).\n\nThrough collaboration with DoD Matrix and Industry partners the JTNC supports continued development\/maturation of the DoD Waveform IR, analysis of directed software and artifacts, support of the National Security Agency (NSA) Commercial Communications Security (COMSEC) Evaluation Program (CCEP), JTNC Standards Interface Control Working Group (ICWG), the Capabilities Characterization and Tactical Communications Marketplace (CC & TCM), and Modular Radio Architecture (MRA).\n\nJTNC is funded using a Joint budget strategy. Each Military Department (MILDEP) budgets for approximately one-third of the total program RDT&E requirements for joint efforts. Fiscal Year (FY) 2019 to FY 2020 funding balances represent the post-RMD consolidated funding from the other Services, while FY 2021 and beyond reflects the Air Force one-third portion of total program RDT&E funds.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver ensuring secure, interoperable, and resilient tactical communications capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F\n\nThis program is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full rate production."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Tactical Networking Center (JTNC)"
                                    },
                                    "Description": {
                                        "val": "The Joint Tactical Networking Center (JTNC) is responsible for ensuring secure, interoperable, and resilient tactical communications capabilities aligned to modular open architectures in support of Service, Multi-Service, and Coalition forces. The JTNC: (1) maintains a cyber-hardened DoD Information Repository (IR), (2) provides Technical Analyses\/Capability Characterizations on tactical communications products, (3) provides Open Systems Architecture Standards, (4) exportability analysis and licensing reviews, and (5) serves as Technical Advisor to the Communications, Command, and Control Leadership Board (C3LB)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.414"
                                            },
                                            "Text": {
                                                "val": "- Continue analysis of C3LB approved waveforms in accordance Service priorities and the FY20 JTNC Management Plan. \n- Continue collecting relevant software, technical documentation, cataloging and inducting other DoD and Commercial Communication Waveforms listed in the DoD Communication Waveform Inventory. \n- Continue to enhance DoD Information Repository capability and approved Standards promulgation.\n- Continue the development of the tactical communications vendor product capability characterization process for commercial off-the-shelf (COTS) and non-developmental item (NDI) tactical communication products. \n- Continue to evolve DoD Waveform Standards to facilitate common development, interoperability and re-use, reducing product development time and facilitating faster delivery of capabilities to warfighters.\n- Continue to conduct technical waveform and software artifact analyses against published standards.\n- Continue to support export requests and analyses of products for exportability.\n- Continue to certify secure, reusable software waveforms based on government controlled open architecture to encourage a competitive, cost effective, interoperable networking environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- Will continue analysis of C3LB approved waveforms in accordance Service priorities and the proposed FY21 JTNC Management Plan.\n- Will continue collecting relevant software, technical documentation, cataloging and inducting other DoD and Commercial Communication Waveforms listed in the DoD Communication Waveform Inventory.\n- Will continue to enhance DoD Information Repository capability and approved Standards promulgation.\n- Will continue the development of the tactical communications vendor product capability characterization process for commercial off-the-shelf (COTS) and non-developmental item (NDI) tactical communication products.\n- Will continue to evolve DoD Waveform Standards to facilitate common development, interoperability and re-use, reducing product development time and facilitating faster delivery of capabilities to warfighters.\n- Will continue to conduct technical waveform and software artifact analyses against published standards.\n- Will continue to support export requests and analyses of products for exportability.\n- Will continue to certify secure, reusable software waveforms based on government controlled open architecture to encourage a competitive, cost effective, interoperable networking environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $5.765 between FY20 and FY21 is due to funding allocation in the out years to cover the 1\/3 share of JTNC funding which is reprogrammed to Army PE 0605030A via RMD in the year of execution, as per the JTNC Tri Military Department Resource Plan signed by the Services."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The Joint Tactical Networking Center is funded by all the Services. The Joint Funding Strategy requires each of the three Service Military Departments (MILDEPs) to budget for one-third of the total program approved requirement.  Army funding in FY21 and beyond reflects only approximately one-third of total funding.  Other funding is as follows (PB20 locked positions):\n\nNavy RDTE: 0605030N, 3077. FY21 = 4,644 \/\/ FY22 = 4,741 \/\/ FY23 = 4,835 \/\/ FY24 = 4,932 \/\/ FY25 = 5,031\nArmy RDTE:  0605030A, 655030. FY21 = 5,833 \/\/ FY22 = 5,835 \/\/ FY23 = 5,490 \/\/ FY24 = 5,847 \/\/ FY25 = 5,952\n\nDue to Joint Funding Strategy, there is no prior year funding for JTNC in the other Service lines. Prior to the year of execution, the JTNC funding is consolidated in Army PE 0605030A for execution. In accordance with the Joint Tactical Networking Center Charter updated and re-validated on 29 March 2016, the JTNC will remain under a Joint Budget Strategy funded by the three MILDEPs."
                        },
                        "AcquisitionStrategy": {
                            "val": "Joint Tactical Networking Center is classified as a Joint Support Program to Acquisition, Technology & Logistics (AT&L), DoD Chief Information Officer (CIO), and the Services. JTNC core functions as defined in the JTNC Acquisition Decision Memorandum and Charter signed on 20 January 2014, revalidated on 29 March 2016 and 13 September 2019 include: Department of Defense (DoD) Information Repository (IR) management and configuration control, DoD Waveform Standards and Software Communications Architecture (SCA), technical analyses of Government Program of Record (POR) and Industry COTS and NDI Waveform products. The services derived from these core functions reinforce an acquisition environment which ensures that interoperable, secure, and affordable joint tactical waveforms and wireless communications applications can operate in a variety of hardware transport solutions.\n\n\nThe FY21 Budget supports continued development\/maturation of the DoD Waveform IR, analysis of directed software and artifacts, support of the National Security Agency (NSA) Commercial Communications Security (COMSEC) Evaluation Program (CCEP), JTNC Standards Interface Control Working Group (ICWG), the Capabilities Characterization and Tactical Communications Marketplace (CC & TCM). The FY21 budget supports the Lead Services initiative where JTNC will serve as a technical advisor and source of engineering and analytic resources in the conduct of Joint enterprise-level systems engineering and analysis and support DoD CIO. The FY21 budget supports Modular Radio Architecture (MRA) where JTNC will lead development and promulgation of a framework containing a collection of DoD standards and a description or architecture of how to use these to compose or control a communications system. The MRA defines how to implement a communications system or radio on select platforms."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JTNC Engineering\/Technical Support, Test and Evaluation, Product Development Support and Program Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "G2SS, SSC PAC, JITC, APG"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "CA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.414"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "JTNC - Compliance and Certification"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Waveform and Wireless Product Compliance and Certification"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JTNC - Information Repository"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "DoD Waveform Information Repository"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JTNC - Standards"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Evolve Waveform Standards and SCA"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JTNC - Analysis"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Analyze Waveforms and Associated Artifacts"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}