{
    "id": "2021-Navy-PB-1319-JBOOK-29075b3c2af92ab5fcca1096cf65ecac9cc771240d227e79d45bc59626cdea42-7",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602236N"
        },
        "ProgramElementTitle": {
            "val": "Warfighter Sustainment Applied Res"
        },
        "R1LineNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "64.010"
            },
            "CurrentYear": {
                "val": "95.825"
            },
            "BudgetYearOne": {
                "val": "67.765"
            },
            "BudgetYearOneBase": {
                "val": "67.765"
            },
            "BudgetYearTwo": {
                "val": "66.134"
            },
            "BudgetYearThree": {
                "val": "67.657"
            },
            "BudgetYearFour": {
                "val": "68.226"
            },
            "BudgetYearFive": {
                "val": "69.591"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "U.S. Sailors and Marines underpin all missions. Advances in Artificial Intelligence (AI) enabled decision aides, autonomy, human-machine training, augmented performance, command and control and protective equipment will ensure their advantage in a complex, maritime environment. This Program Element (PE) conducts applied research to address Warfighter protection and performance concerns, including efforts that focus on advanced Naval materials, biocentric technologies, decision support, intelligent and autonomous systems, human performance optimization, training and education technologies, social and cultural, and biomedical technologies. This PE also supports the Office of Naval Research (ONR) Global mission to serve as the preeminent external facilitator for the Naval Research Enterprise. This is accomplished by establishing quality, relevant connections between the international research and development community, Naval fleet\/forces, DOD, other US Government agencies and international partners.\n\nToday's Sailors and Marines are enabled by naval Science and Technology (S&T). Since 1946, the Office of Naval Research (ONR) has fostered scientific research related to the maintenance of maritime superiority and national defense.  ONR manages the Department of the Navy's (DON) portfolio of naval Basic and Applied research, and Advanced Technology Development investments to ensure naval forces can effectively deter conflict, but when called upon, fight, win and come home safe. Current investments hedge against uncertainty, providing solutions to commanders today, and options for the future. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy through research priorities set by the Chief of Naval Research, coordinated across the Naval Research Enterprise (NRE), and outlined in the Naval R&D Framework. \n\nThis Program Element (PE) funds Applied Research, which is the systematic study to understand the means to meet a recognized and specific need. Most of the work in this PE can be classified between Technology Readiness Level (TRL) 2 (technology concept and\/or application formulation) and TRL 4 (component and\/or breadboard validation in laboratory environments).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "65.782"
                },
                "CurrentYear": {
                    "val": "63.825"
                },
                "BudgetYearOne": {
                    "val": "64.558"
                },
                "BudgetYearOneBase": {
                    "val": "64.558"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "64.010"
                },
                "CurrentYear": {
                    "val": "95.825"
                },
                "BudgetYearOne": {
                    "val": "67.765"
                },
                "BudgetYearOneBase": {
                    "val": "67.765"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.772"
                },
                "CurrentYear": {
                    "val": "32.000"
                },
                "BudgetYearOne": {
                    "val": "3.207"
                },
                "BudgetYearOneBase": {
                    "val": "3.207"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "32.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.772"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "3.207"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.207"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The funding increase from FY 2020 to FY 2021 is due to $3.3M of funds for the 1000 Molecules program that supports the sustainable transition of critical synthetic biology capabilities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Sustainment Applied Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "57.349"
                        },
                        "CurrentYear": {
                            "val": "63.825"
                        },
                        "BudgetYearOne": {
                            "val": "67.765"
                        },
                        "BudgetYearOneBase": {
                            "val": "67.765"
                        },
                        "BudgetYearTwo": {
                            "val": "66.134"
                        },
                        "BudgetYearThree": {
                            "val": "67.657"
                        },
                        "BudgetYearFour": {
                            "val": "68.226"
                        },
                        "BudgetYearFive": {
                            "val": "69.591"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "U.S. Sailors and Marines underpin all missions. Advances in AI-enabled decision aides, autonomy, human-machine training, augmented performance, command and control and protective equipment will ensure their advantage in a complex, maritime environment. This Program conducts applied research to address Warfighter protection and performance concerns, including efforts that focus on advanced Naval materials, biocentric technologies, decision support, intelligent and autonomous systems, human performance optimization, training and education technologies, social and cultural, and biomedical technologies. This PE also supports the Office of Naval Research (ONR) Global mission to serve as the preeminent external facilitator for the Naval Research Enterprise. This is accomplished by establishing quality, relevant connections between the international research and development community, Naval fleet\/forces, DOD, other US Government agencies and international partners."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Naval Materials"
                                    },
                                    "Description": {
                                        "val": "Advanced Naval Materials efforts support several Science and Technology (S&T) Focus Areas, in particular Platform Design & Survivability, and perform research across a broad spectrum of technical areas including: structural materials to increase platform performance and survivability at reduced weight and cost; advanced, high-performance materials for energy systems; corrosion mitigation strategies; high-temperature propulsion systems; and enhanced sonar transducers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.205"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.715"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct research on Agile Manufacturing Integrated Computational Materials Engineering (ICME).  This effort will establish a robust collection of predictive capabilities based on quantitative experimentation and characterization at all appropriate length scales to accelerate the development and optimization of new materials, and the design of advanced components while reducing the time required for qualification.  Application of these tools will enable greater confidence and utilization of additive manufacturing and other advanced manufacturing technologies.\n\n- Conduct ongoing research on materials development and advanced processing technologies for acoustic transduction.\n\n- Conduct research on structural materials to include the following: nanostructured materials and coatings processing, composite development, cellular materials, high temperature materials, metals and alloys for structural applications, and alternative hull materials.\n\n- Conduct applied research related to critical S&T to investigate corrosion control modeling, high strength corrosion resistant coatings and compositionally complex alloys, and corrosion resistant additive manufactured alloys. \n\n- Conduct ongoing research that develops enabling manufacturing technology to scale up and improve affordability of science and technology products.  Key tasks for this period include development of affordable fabrication technology for submarine coatings.\n\nMaterials and Chemistry: Develop novel and scalable processing methods to produce mechanically robust high temperature superconductor tapes with minimal AC loss for various naval applications such as transformers, inductors, stators and for pulsed power delivery systems for all electric ships.  Design new microfluidic system for direct write additive manufacturing to significantly improve the existing techniques.  Design of multifunctional material systems for use in new helmet design to mitigate multiple threats.  Compositional modifications and processing parameters to optimize material performance have been demonstrated leading to current plans for their utilization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.874"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.874"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Materials:\nConduct research to build Agile Manufacturing - Integrated Computational Materials Engineering (ICME) toolkit infrastructure. Conduct ongoing research efforts to improve affordability and reliability of piezoelectric transduction materials. Conduct research to develop advanced structural alloys and composites, joining and repair technologies. Conduct research to pursue commercially viable processing for nano-engineered materials, including ceramics, metals, and materials systems. Continue development of new, advanced, environmentally benign Anti-Fouling (AF)\/Anti-Corrosive (AC) coating systems for Navy platforms.\n\nSustainment & Logistics:\nConduct applied research to investigate corrosion control modeling, high performance longer-life corrosion resistant coatings, compositionally complex alloys, corrosion resistant additive manufactured components and atmospheric corrosion of aluminum 5000 components. \n\nManufacturing:\nDevelop manufacturing technology to help accelerate capability to the fleet in areas such as high-energy laser (HEL) weapons, advanced electronic warfare, and electronic controls for unmanned vehicles.\n\nInitiate efforts focused on demonstrating the deposition of quality carbon phosphonitride materials for liquid-based additive manufacturing techniques tailored for use in true 3-D direct write processes. Efforts will enable this technology to produce inexpensive, high quality parts; and demonstrating that next generation TBCs can be optimized to meet 20-year survivability requirements for use in a marine diesel environment to support an increase in operating temperatures from 500 to 800 degrees Celsius.\n\nMaterials and Chemistry:\nOngoing efforts include designing new microfluidic system for direct write additive manufacturing to significantly improve the existing techniques, and efforts to determine thermal barrier coating (TBC) degradation mechanisms and susceptibility and apply that understanding to optimize TBCs for marine use and enable long service-life applications in severe environments. \n\nEfforts completing with reduced investment in FY21 include work on computational models of thermal, ballistic impact, blunt impact and blast overpressure effects on helmet design and account for biomechanical response and fluid dynamics associated with helmet design and materials testing. Effort employs optimization software that utilizes model results to design helmet pad material and helmet suspension geometry against multiple performance requirements."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2020 to FY 2021 is due to the environmental quality effort being realigned to this R-2 Activity from the Environmental Quality activity beginning in FY 2021. The Environmental Quality (EQ) efforts depend heavily on materials, polymer science and chemistry. To take greater advantages of these synergies, the EQ program is being realigned to the Advanced Naval Materials R2 Activity."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biocentric Technologies"
                                    },
                                    "Description": {
                                        "val": "Applied research to develop knowledge and technologies for future Naval capabilities. Research area include: bioinspired and biomimetic materials; synthetic biology for maritime surveillance; bioengergy harvesting and electronics; warfighter augmentation; and marine mammal health. This research provides secure and agile options to enhance performance and reduce cost; increases novel power and energy solutions to safely extend operational duration; and improve stealth, maneuverability, and mission capability of platforms and autonomous systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.223"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.596"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Bio-Inspired Systems: Applied research in areas of: Control of bio-inspired autonomous vehicles in complex maneuvers; and Integration of biomimetic sonar with bio-inspired underwater vehicles for obstacle detection and avoidance.\n\nHuman Interaction with Autonomous Systems: Applied research in areas of: Development of brain-based intelligent systems to support collaboration between humans and autonomous systems; and Research on human and robotic teammates. \n\nBiocentric Technology: Applied research of Naval biosensors, biomaterials, and bioprocess technologies: Accelerate engineering development and optimization of microbial undersea energy harvesting systems for sustainable and autonomous powering of Naval underwater sensor and communication nodes; Examine feasibility of microbial electrochemical systems for shipboard waste-to-energy conversion (including disabled submarine scenarios); Accelerate research in human microbiome for divers, combat swimmers, and submariners; Applied research of devices incorporating engineered sentinel organisms for environmental monitoring (including the human gut); and Integration of programmable cellular controllers with robotic devices. \n\nBioengineering and Life Sciences: Applied research in the areas of: Sequencing technologies as diagnostic tools for viral pathogens in chemical and environmental samples; Various formulations of polymer mimics of mussel adhesion proteins for underwater applications; Highly-efficient proton exchange membrane fuel cells based on designer catalysts and novel catalyst supports for Naval applications; and Improving the health and welfare of the Navy's marine mammals including development of immunobioassays for stress and infection detection and acoustic analysis of dolphin sounds as an indicator of their well-being; \n\nWarfighting Augmentation: Applied research in multi-functional textiles that interact with autonomous life support, neuromuscular control and waste management, biosensors and bio-electronics, and adaptive and integrative protection.\n\nMaterials and Chemistry:  Develop novel approaches to rapidly identify antibiotic resistant genes in bacterial pathogens of importance for the entire US military force.  Success of this effort will enable our transitional partners, the Naval Medical Research Center and the Naval Medical Research Laboratories, for rapid identification of highly resistant bacterial pathogens.  A major success has been demonstrated by utilizing Naval Research Laboratory (NRL) developed microbial resistant determinant assay for its advances to system design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.433"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.433"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Bio-Inspired Autonomous Systems:\nConduct applied research on bio-inspired underwater vehicle propulsion and control. Conduct applied research to develop precision navigation and advanced search behaviors. Integrate biosonar into a bio-inspired unmanned vehicle to evaluate obstacle detection and avoidance in congested spaces.  Conduct applied research to develop and evaluate lateral line based intelligent sensing and control.\n\nHuman Interaction with Autonomous Systems:\nConduct applied research to develop agile humanoid robot teammates. This includes incorporating computer vision reasoning and human communication. Conduct applied research to train mission capable robots to perform complex manipulation skills. Conduct applied research to develop technology to enhance diver performance with small AUV assistants.\n\nBiocentric Technology:\nConduct applied research on Naval biosensors, biomaterials, and bioprocess technologies.  This includes conducting multi-month\/year tests of microbial underwater energy harvesting systems (in various ports, rivers, test sites), expand to deep water marine environments and test ability to power new devices; decreasing efforts in study microbial electrochemical systems for ship\/sub waste-to-energy conversion (including disabled submarine scenarios); conducting studies of prebiotic food additives\/probiotics for effects on microbiome and performance in human subjects; developing strategies to incorporate programmable cellular controllers (sense-and-respond microbes) for environmental monitoring into relevant Naval platforms; and conducting research on the influence of sample source and rapid dilution of DNA sequencing for monitoring undersea environments. \n\nBioengineering and Life Sciences:\nConduct applied research to assess new instrumentation for hastening the time of sequence analysis of viruses in clinical and environmental samples in the field; further develop bio-inspired and biomimetic adhesive materials for underwater applications; demonstrate more efficient proton exchange membrane fuel cells; determine whether an individual dolphin's vocalizations can be correlated with veterinary and trainer observations to develop a sound model for the animal that describes their welfare; and investigate serum and urine markers of kidney injury in bottlenose dolphins.  \n\nWarfighter Augmentation:\nApplied research on the development of technologies to enhance undersea capabilities, including bio-inspired underwater geolocalization.\n\nMaterials and Chemistry: \nDevelop a semi-automated assay system that will enable our transition partners, the Naval Medical Research Center and Naval Medical Research Unit laboratories, to rapidly identify antibiotic resistance genes in bacterial pathogens of importance to the U.S. military. The science, technology and and resulting system will contribute directly to warfighter health, performance and survivability.  \n\nEfforts completing with reduced investment in FY 2021 include demonstrations that the assay system provides better and greater identification of resistance determinants from clinical matrices than whole shotgun metagenomic sequencing."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2020 to FY 2021 is due to $3.3M of funds for the 1000 Molecules program that supports the sustainable transition of critical synthetic biology capabilities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Quality"
                                    },
                                    "Description": {
                                        "val": "Environmental Quality technologies enable sustained world-wide Navy operations in compliance with all local, state, regional, national and international laws, regulations and agreements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.698"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.672"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Ongoing development of new, advanced, environmentally benign Anti-Fouling (AF)\/Anti-Corrosive (AC) coating systems for Navy platforms. \n\nOngoing development of advanced environmentally sound technologies for shipboard waste treatment and pollution abatement systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2020 to FY 2021 is due to the Environmental Quality (EQ) effort being realigned to the Advanced Naval Materials R-2 Activity. The Environmental Quality efforts depend heavily on materials, polymer science and chemistry.  To take greater advantages of these synergies, the EQ program is being realigned into the Advanced Naval Materials R2 Activity."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Factors and Organizational Design"
                                    },
                                    "Description": {
                                        "val": "New hybrid warfare operations threaten every Navy\/Marine Corps mission abroad and Warfighters need new techniques, tactics, and procedures to anticipate, forecast, and adapt to unconventional influence tactics and strategies.  These applied research efforts will improve system interface designs and human-level decision support in Naval contexts. Research areas include human-machine teaming, social networks and computational social science, and command decision making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.752"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.745"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Human-Machine Teaming: Applied research on system interface designs and human-machine interaction methodologies that enable or enhance Warfighter performance and human-machine teaming. Focus areas include: (i) Physiological monitoring and cognitive state estimation; (ii) Psychoacoustics and audio-visual scene interpretation; and (iii) Rapid interface design evaluation. \n\nSocial Networks and Computational Social Science: Applied research in information environment assessment, civil-military communications (public affairs) information operation, and psychological operations. This research addresses problems of countering influence operations, dealing with polarized audiences, and mitigation of social hysteria propagation in online and real-world information campaigns. These efforts include gamification to provide principles and foundational frameworks for development of training and exercises, including operating in contested information environments.   \n\nCommand Decision Making: Applied research in decision aid algorithms and human interfaces for command and control processes, to include alerting command staff when mission re-planning is required. Research technologies to capture and share practical knowledge that is learned on the job and effectively share with peers as a supplement to formal training. Conduct applied research for the development of supervised learning algorithms that capture mission planning workflow for a range of missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.736"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.736"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Cognitive Science for Human-Machine Teaming\nConduct applied research on system interface designs and human-machine interaction methodologies that enable or enhance Naval Warfighter performance and human-machine teaming. Efforts investigating physiological monitoring and cognitive state estimation are complete and the focus will shift to: Psychoacoustics and audio-visual scene interpretation implemented in computational models that serve as the front end for cognitive architectures and new human interfaces; construction of computational models that integrate top-down expectation; and gaze control to enable multisensory perception within a cognitive architecture for autonomous systems.  \n\nSocial Networks and Computational Social Science\nConduct applied research in information environment assessment, civil-military communications (public affairs), information operations and strategic communication.  Develop improved course of action guidance and capabilities to detect and defuse: disinformation, social hysteria and group polarization campaigns. Develop information conflict war-game capabilities relevant to international exercises. \n\nCommand Decision Making\nDevelop information display concepts to include alerting and decision aid algorithms for complex, multi-dimensional data. These concepts are critical for avoiding collisions, accomplishing rendezvous, determining the value of information, and planning courses of action."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Research Protection Program (HRPP)"
                                    },
                                    "Description": {
                                        "val": "The Federal Policy for the Protection of Human Subjects is codified in the Department of Defense (DoD) as part 219 of title 32, Code of Federal Regulations (also known and hereinafter referred to as the \"Common Rule\").  DoD Instruction 3216.02 establishes policy and assigns responsibilities for the protection of human subjects in DoD-supported programs to implement the Common Rule and requires Heads of DoD Components to establish and oversee DoD Component policies and procedures that ensure compliance with federal and DoD requirements.  The Secretary of the Navy Instruction (SECNAVINST) 3900.39E CH-1 identifies the Chief of Naval Research as providing support and expertise for human research protection in research conducted or supported by the Navy and Marine Corps Systems Commands and institutions, operational forces, training Commands, and Department of the Navy (DON)-supported research involving human subjects performed by non-DoD institutions.  The Human Research Protection Program (HRPP) program protects the rights, safety, and welfare of human subjects in research conducted or sponsored by the Navy and Marine Corps by: 1) ensuring that research involving human subjects complies with federal regulations, DoD Directives, DON Instructions, and Marine Corps Orders governing research protection requirements; and 2) providing education and training programs in human research ethics to all levels of staff involved in the review, approval, conduct, management, or support of DON human subjects research (HSR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.685"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.705"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Execute DON HRPP Management Plan; provide day-to-day oversight of DON HRPP activities; conduct periodic site inspections and assist visits; conduct training for Exempt Determination Officials, conduct Component and Headquarters-level review of DON-supported human subjects research; provide subject matter expertise and guidance on all DON-supported research involving human subjects; implement revisions to Standard Operating Procedures in light of revisions to the Common Rule and SECNAVINST 3900.39E; and provide DON input to USD(R&E) and other DoD policy guidance impacting DON human research-related efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.739"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.739"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Build a Research Protection Community of Excellence; establish two new HRPPs; coordinate and finalize SECNAVINST 3900.39F; Program Management of the DON Research Protections Information Technology Management System for management and compliance oversight of ongoing human research protections activities; establish policy for single Institutional Review Board review; provide education and training programs in human research ethics to all levels of staff involved in the review, approval, conduct, support, or management of DON HSR; provide subject matter expertise and guidance on all DON-supported research involving human subjects."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medical and Human Performance Technologies"
                                    },
                                    "Description": {
                                        "val": "Medical and human performance applied research technologies have historically been funded out of the 0602236N Medical Technologies R2 Activity. Starting in FY21, this R2 Activity will be described in two categories to better explain the program areas related to medical and human performance research in this exhibit. Efforts categorized as Medical Technologies focus on research after injury. Efforts categorized as Human Performance Technologies focus on research before injury.\n\nThe medical portion of this applied research activity focuses on reducing operational health threats, development of point-of-injury medical equipment, and medical diagnostic capabilities and treatments. This research will improve the Fleet's ability to save lives, especially during prolonged field care. \n\nThe human performance portion of this applied research activity focuses on improving undersea performance of divers and submarine crews; sensory perception and performance to improve warfighter capabilities during exposure to high levels of acoustic or electromagnetic energy; and physiological monitoring of Naval forces during training and operational environments.\n\nTo avoid duplication of effort, research is coordinated with other Services through the Office of the Secretary of Defense Communities of Interest."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.839"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.771"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Medicine and Performance: Applied research efforts include: Integrated diving helmet audio-visual displays; and Pharmacological agents and technologies to mitigate decompression sickness and oxygen toxicity.\n\nSensory Neuroscience and Whole-body Physiology: Applied research to improve personal protective equipment and monitoring systems in order to mitigate biomedical effects of exposure to high-levels of acoustic pressure or electromagnetic energy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.764"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.764"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Medical and human performance applied research technologies have historically been funded out of the 0602236N Medical Technologies R2 Activity. Starting in FY 2021, this R2 Activity will be described in two specific categories to better explain the program areas related to medical and human performance research in this exhibit. Efforts categorized as Medical Technologies focus on research after injury. Efforts categorized as Human Performance Technologies focus on research before injury. \n\nMedical Technologies\nConduct applied research to treat impaired tactical auditory sense and sense-making. Identify near infrared medical treatment and mitigation of auditory temporary threshold shifts. Conduct applied research to enhance casualty identification, classification, and prioritization for manned and unmanned casualty care evacuation. Conduct research to provide therapeutic care using nanotechnology, pharmacological agents, and autonomy for casualties in disaggregated environments.\n\nHuman Performance Technologies\nConduct applied research efforts to develop technologies to monitor and protect divers from environmental stressors, such as temperature, pressure, and limited visibility. Develop manned-unmanned teaming platforms to aid a diver in enhanced situational awareness and expand diving windows of opportunity. Conduct applied research to understand impacts of loud noises within dive helmets and human exposure to electromagnetic energy; develop exposure monitoring and mitigation strategies; and improve personal protective equipment and communication technologies. Develop human physiologic and biologic sensors for real-time monitoring of performance status in training and operational environments. Continue applied research efforts to reduce high performance tactical aircraft jet noise including High Fidelity Modeling, Advanced Diagnostics, and Noise Reduction Concepts, for human protection."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "The Office of Naval Research Global"
                                    },
                                    "Description": {
                                        "val": "Supports the Office of Naval Research (ONR) Global mission to serve as the preeminent external facilitator for the Naval Research Enterprise.  This is accomplished by establishing quality, relevant connections between the international research and development community, Naval fleet\/forces, DOD, other US Government agencies and international partners.\n\nScience Advisors (SA)\nThis effort ensures that the operational Naval fleet\/force help shape the DON investment in science and technology (S&T), develops teaming relationships to rapidly prototype, experiment, demonstrate and transition technology, supports development of technology-based capability options for Naval forces, and enables warfighting innovations based on technical and conceptual possibilities. The SA Program also informs capability-based war games using current and future technology to identify future capability strengths and shortfalls that assist in shaping the DON investment strategy. The ONR Global SA Program enables continuous communication and collaboration between the warfighters, the Naval Research & Development Enterprise, and strategic development commands. \n\nInternational science\nThe ONR Global mission is also accomplished through PhD-level scientists located in Asia, Europe and South America, providing coverage in these regions as well as Africa, Australia\/New Zealand and the Middle East. ONR Global scientists actively search the globe for emerging scientific research and promising technologies, collaborating with international organizations and researchers through liaison visits and grants in innovative applied research. The direct impact of this investment is to leverage international research during increasingly dynamic global interdependence and improve the ability to solve DON S&T challenges through shared knowledge and technologies with partners. In addition, this investment builds global S&T awareness to reduce the risk of potential technological surprise, and supports theater security cooperation goals to sustain cooperative relationships with an expanding set of international partners.\n\nInternational engagement\nONR Global also supports international engagement with partner nations through the development and maintenance of bilateral and multilateral relationships, international agreements, and other activities that promote RDT&E collaboration and interoperability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.060"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.733"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support all Science Advisor program efforts across Fleet and Forces Commands; objectively assess placement of current Science Advisors and requests for additional support in terms of impact to the Fleet and S&T return on investment. \n\nSupport PhD-level scientists, in seven overseas offices, continuing to engage with international scientists and engineers through liaison visits to research institutions and continue actively fostering international collaboration by awarding research grants.\n\nSupport international engagement with ten partner nations, three multi-lateral groups, and support to the Northern Atlantic Treaty Organization (NATO), in order to increase collective Naval capability, capacity, and interoperability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.335"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.335"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support all Science Advisor program efforts across Fleet and Forces Commands; objectively assess placement of current Science Advisors and requests for additional support in terms of impact to the Fleet and S&T return on investment.\n\nSupport PhD-level scientists, in seven overseas offices, continuing to engage with international scientists and engineers through liaison visits to research institutions and continue actively fostering international collaboration by awarding research grants. \n\nSupport international engagement with ten partner nations, three multi-lateral groups, and support to the Northern Atlantic Treaty Organization (NATO), in order to increase collective Naval capability, capacity, and interoperability."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training Technologies"
                                    },
                                    "Description": {
                                        "val": "Applied research to enhance the ability to train and educate Naval forces from time of recruitment through separation from the military.  This includes use of simulated environments in classroom and deployed environments. Improved efficiency and cost-effectiveness is achieved by applying operations research, modeling and simulation, and instructional, cognitive, and computer sciences to the development, delivery, evaluation, and execution of training and education. To avoid duplication of effort, research is coordinated with other Services via the Office of the Secretary of Defense Communities of Interest."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.887"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.888"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Technologies for Naval Training: Applied research to augment training, skill maintenance, and evaluation through gaming, and learning theory. Research includes developing effective instructional strategies in intelligent tutors and conducting evaluation of intelligent job aids. Develop computational models of skill decay for psychomotor, perceptual, and cognitive skills, and refresher training strategies. \n\nAdvanced Integrated Maritime Mission Modeling: Applied research in the development of live, virtual, and constructive training and experimentation technologies. Efforts will include developing tools for training in denied and degraded electromagnetic environments and in extreme weather environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.884"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.884"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Technologies for Naval Training\nConduct applied research for measuring cognitive ability, interests, and aptitude on Naval forces throughout their military career. Develop tools to track training and education efficacy and develop instructional strategies as needed to improve performance. \n\nAdvanced Integrated Maritime Mission Modeling\nApply advanced modeling and simulation tools to develop live-virtual-constructive training at both pier side and at-sea of navigation teams on Naval surface platforms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "6.661"
                        },
                        "CurrentYear": {
                            "val": "32.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "38.661"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2.317"
                                        },
                                        "Text": {
                                            "val": "Research into social networks and the impact of novel technologies on human behavior in crisis and collaborative contexts."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warfighter Safety and Performance"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.344"
                                        },
                                        "Text": {
                                            "val": "Conduct research to include: continued studies on decompression sickness, oxygen toxicity, optimization of diver performance, and assessment of the impact of thermal stress on operational performance."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Laser peening technology"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied technology development for Laser Peening Technology."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lightweight anti-corrosion nanotechnology coating enhancement"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied technology development for Lightweight anti-corrosion nanotechnology coating enhancement."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Polymer coatings for reduced ice and fouling adhesion"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "6.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied technology development for Polymer coatings for reduced ice and fouling adhesion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Undersea domain human performance requirements"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied technology development for Undersea domain human performance requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineered systems to prevent hearing loss"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied technology development for Engineered systems to prevent hearing loss."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extreme environment warfighter safety research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied technology development for Extreme environment warfighter safety research."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Female musculoskeletal research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied technology development for Female Musculoskeletal research."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}