{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-6",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602251D8Z"
        },
        "ProgramElementTitle": {
            "val": "Applied Research for the Advancement of S&T Priorities"
        },
        "R1LineNumber": {
            "val": "13"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "47.550"
            },
            "PriorYear": {
                "val": "59.567"
            },
            "CurrentYear": {
                "val": "60.400"
            },
            "BudgetYearOne": {
                "val": "60.722"
            },
            "BudgetYearOneBase": {
                "val": "60.722"
            },
            "BudgetYearTwo": {
                "val": "60.740"
            },
            "BudgetYearThree": {
                "val": "60.746"
            },
            "BudgetYearFour": {
                "val": "60.749"
            },
            "BudgetYearFive": {
                "val": "60.758"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Applied Research for the Advancement of Science and Technology (S&T) Priorities (ARAP) program element (PE) enables the early launch of S&T applied research projects to shape Components' investments.  The PE focuses on the design, development, and improvement immature technologies and new processes to achieve general mission requirements and to translate promising research into solutions for military needs.  In addition, the PE enables concept exploration efforts and studies of alternative concepts.  The research projects are aligned with the Department of Defense (DoD) S&T priorities and designated focus areas that include non-system specific technology efforts and feasibility assessments and are formulated and managed by teams of subject matter experts drawn from the Office of the Secretary of Defense, the Military Services, and the Defense Agencies.  The PE also provides support to the S&T Communities of Interest (CoIs)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "60.550"
                },
                "CurrentYear": {
                    "val": "62.200"
                },
                "BudgetYearOne": {
                    "val": "60.240"
                },
                "BudgetYearOneBase": {
                    "val": "60.240"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "59.567"
                },
                "CurrentYear": {
                    "val": "60.400"
                },
                "BudgetYearOne": {
                    "val": "60.722"
                },
                "BudgetYearOneBase": {
                    "val": "60.722"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.983"
                },
                "CurrentYear": {
                    "val": "-1.800"
                },
                "BudgetYearOne": {
                    "val": "0.482"
                },
                "BudgetYearOneBase": {
                    "val": "0.482"
                }
            },
            "AdjustmentDetails": {
                "CongressionalRescissions": {
                    "CurrentYear": {
                        "val": "-8.800"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "7.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.973"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.010"
                                },
                                "BudgetYearOne": {
                                    "val": "0.542"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.542"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.060"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.060"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Program adjustments are consistent with higher priority DoD requirements.\n\nIn FY 2020:\nProgram reduced by -$8.800 million for excess growth.\nProgram increased by $7.000 million for per- and polyfluoroalkyl substances (PFAS) modeling."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "227"
                    },
                    "ProjectTitle": {
                        "val": "Applied Research for the Advancement of S&T Priorities"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "47.550"
                        },
                        "PriorYear": {
                            "val": "59.567"
                        },
                        "CurrentYear": {
                            "val": "60.400"
                        },
                        "BudgetYearOne": {
                            "val": "60.722"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.722"
                        },
                        "BudgetYearTwo": {
                            "val": "60.740"
                        },
                        "BudgetYearThree": {
                            "val": "60.746"
                        },
                        "BudgetYearFour": {
                            "val": "60.749"
                        },
                        "BudgetYearFive": {
                            "val": "60.758"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Applied Research for the Advancement of Science and Technology (S&T) Priorities program was established to implement Department-wide technology development portfolios and foster Tri-Service research areas of common interest within cross-cutting S&T efforts.  The program has three investment areas:  (1) large, three-year applied research programs selected by the S&T Executives; (2) smaller, two-year technology ‘seedling’ programs nominated by the Communities of Interest (CoIs) to address technology gaps or opportunities; and (3) technical support to the CoIs.  The execution of the program by the Office of the Secretary of Defense and the support it provides to the CoIs assures strategic oversight and multi-agency coordination."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Per- and Polyfluoroalkyl Substances (PFAS) Modeling"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7.000"
                                        },
                                        "Text": {
                                            "val": "Implement an Applied Research for the Advanced of S&T Priorities (ARAP) project to assess concerns about the human health and environmental impacts of per- and polyfluoroalkyl substances (PFAS)."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Research for the Advancement of S&T Priorities"
                                    },
                                    "Description": {
                                        "val": "The program focuses on fostering tri-service research areas of common interest within cross-cutting S&T efforts that give the joint warfighter a technological advantage.  It is intended to focus on emerging areas of science, to build expertise within Department of Defense laboratories, to include investment in laboratory infrastructure and people, and will be a foundation for further investments by the Services following the completion of the projects.\n\nCross-cutting efforts align with the S&T Priorities, such as Electronic Warfare, Human Systems, Autonomy, and Cyber, as well other focus areas, such as Advanced Materials, Biomedical, Weapons, Quantum, and Command, Control, Communications, Computers and Intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "46.000"
                                            },
                                            "Text": {
                                                "val": "Continue concept exploration efforts that focus on the S&T priority areas.  The challenge areas within the priorities include:\n\nSynthetic Biology for Military Environments (SBME) ($15.003 million):  Will complete three-year research project.\n− Optimize chassis organisms with respect to production of synthesis products and fitness for targeted environments.\n− Refine tools within the open system architecture.\n− Increase characterization throughput of engineered circuits in both chassis organisms and cell free platforms.\n− Develop specialized characterization approaches.\n− Test additional circuits using the cell-free platform.\n− Refine transcriptomic, proteomic and metabolomic tools.\n− Select a strategy for ruggedization of the cell-free platform to improve stability for storage and field use.\n− Document completed circuits.\n− Document the findings.\n\nDefense Optical Channel Program (DOC-P) ($15.000 million):\n− Develop and assess adaptive laser communications protocols for tolerance to dynamic and intermittent contacts.\n− Begin Space-Ground laser communication scintillation characterization.\n− Laboratory demonstration of microwave photonics modulation of lasercom payload.\n− Integrate atmospheric propagation physics and optical beam control principles with quantum information theory to define capabilities, limitations, and technology requirements for Quantum Entanglement Distribution.\n− Integrate classical\/quantum channels and prototype atomic-line spectral filter.\n− Begin engineering and outfitting of Startfire Optical Range optical comm facility for Quantum Key Distribution demonstration.\n\nEnhanced Energetics Effects (EEE) ($14.000 million):\n− Purchase and prepare database and start defining discriminators for machine-learning of energetic material synthesis routes and propellant burn rate prediction.\n− Setup instrumentation and start preliminary experiments on plasma synthesis of aluminum nanoclusters encapsulated in fullerenes and aluminum-carbon core\/shell structures.\n− Scale up nano-CL20 and amorphous-CL20 production to multiple lbs scale, then begin aluminized CL20 explosive and propellant formulations with these.\n− Assess concepts for additively manufacturing the XM1113 missile's energetics and case to define architectures, and start feedstock development and print head development.\n− Three laboratories with continuous flow processing equipment to run a Bourne Reaction (a typical test reaction) to obtain baseline materials and performance metrics.\n− Synthesis of ingredients and preparation of formulations of both minimum-smoke and reduced smoke rocket propellants, and burn rate characterization tests.\n\nSelect and initiate FY 2019 Applied Research for the Advancement of S&T Priorities project ($1.000 million)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "47.200"
                                            },
                                            "Text": {
                                                "val": "Defense Optical Channel Program (DOC-P) ($15 million) (Year 3 of 3):\n− Finalize DoD relevant applications for both digital and microwave Free Space Optical.\n− Build Free Space Optical brass board terminals for both digital and microwave forms.\n− Perform outdoor range testing on new free space optical terminals.\n− Validate Modulated laser format for Optical Time Transfer at 2.3 km outdoor range.\n− Demonstrate pulsed based Optical Time Transfer.\n− Demonstrate Multi-use and Multi-access Optical Time Transfer and communication links with frequency combs.\n− Validate propagation losses through free-space Quantum-communication experiments and characterize channel through quantum information metrics.\n\nEnhanced Energetics Effects (EEE) ($15 million) (Year 2 of 3):\n− Machine-learning model development, for energetic material synthesis and for propellant burn rate predictions.\n− In-depth characterization and reaction mechanisms studies of aluminum nanoclusters encapsulated in fullerenes and aluminum-carbon core\/shell structures and lab-scale detonation velocity measurements of these materials.\n− Characterization and testing of aluminized nano-CL20 and amorphous-CL20 explosive and propellant formulations to measure burn rates and detonation velocities.\n− Begin additive manufacturing production of chosen concept and post-production characterization to include initiator\/ignitor, propelling charge, rocket assist grain\/motor, and warhead.\n− Three labs with continuous flow processing equipment will perform a comparative DNAN (2,4-Dinitroanisole) synthesis study, and then start scale-up studies.\n− A few minimum-smoke and reduced smoke rocket propellant formulation will be chosen for scale up and small-motor testing.\n\nTopologically Enabled Devices (TEDs) ($14 million) (Year 1 of 3)\n−  Supports parallel efforts (led by the Navy and Air force) to develop next generation memory and optoelectronic devices, also utilizing topological materials.\n− This program will produce (1) a novel, low-power transistor consuming 100x less energy per operation than state-of-the-art (SOA); (2) non-volatile magnetic memory devices require 100x less power and operating 1000x faster than SOA); (3) a circularly polarized light detector implemented at chip-scale; and (4) an on-chip laser isolater to enable high performance integrated photonic circuits.\n\n- Selection of next high-impact program for FY 2020 ($1.000 million).\n\n- Fund seedling projects - for Two Years:  FY19 Seedlings (Year 2 of 2): (1) Establishing the Critical Tests for Machine Understanding for Humane-Machine Teaming; (2) 150-Volt Ultra-wide Bandgap High Efficiency RF Amplifier Technology; and (3) FY 2020 award new seedling(s)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "54.522"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "54.522"
                                            },
                                            "Text": {
                                                "val": "- Continue FY 2020 Applied Research for the Advancement of S&T Priorities projects:  (1) Enhanced Energetics Effects (EEE) (Year 3 of 3); and (2) Topologically Enabled Devices (TEDs) (Year 2 of 3).  Select and initiate FY 2021 Applied Research for the Advancement of S&T Priorities project.\n- Continue to fund selected FY 2020 (to be identified in 3rd Quarter FY 2020) and new FY 2021 (to be identified in 3rd Quarter FY 2021) seedling projects."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease reflects changes in budget fluctuations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "S&T Communities of Interest (CoIs)"
                                    },
                                    "Description": {
                                        "val": "The S&T CoIs effort facilitates cooperation and collaboration among Components; it optimizes the development of critical S&T efforts across the DoD enterprise.  The efforts include the development of technology roadmaps and the integration of technology planning.  The CoIs select and examine critical technology areas to address gaps or opportunities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.567"
                                            },
                                            "Text": {
                                                "val": "Continue to provide technical support to the CoIs ($5.131 million).\n\nComplete FY 2018 Seedling project: Optical Multichannel Beamforming for Electronic Warfare ($0.750 million).\n\nSelect a new set of Seedling projects to address gaps identified by the CoIs ($1.500 million)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.200"
                                            },
                                            "Text": {
                                                "val": "- Provide technical support to the CoIs ($6.200 million), i.e., Advanced Electronics; Air Platforms; Autonomy; Biotechnology; Command, Control, Communications, Computers, and Intelligence (C4I); Cyber; Directed Energy - Non-Lethal Weapons; Electronic Warfare; Energy and Power; Ground and Sea Platforms; Human Systems; Kinetic Weapons Technologies; Materials and Manufacturing Processes; Sensors and Processing; and Space."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.200"
                                            },
                                            "Text": {
                                                "val": "- Continue to provide technical support to the CoIs ($6.200 million), i.e., Advanced Electronics; Air Platforms; Autonomy; Biotechnology; Command, Control, Communications, Computers, and Intelligence (C4I); Cyber; Directed Energy - Non-Lethal Weapons; Electronic Warfare; Energy and Power; Ground and Sea Platforms; Human Systems; Kinetic Weapons Technologies; Materials and Manufacturing Processes; Sensors and Processing; and Space."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The level of effort is consistent between FY 2020 and FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additive Manufacturing (AM) of Energetics"
                                    },
                                    "Description": {
                                        "val": "Additive manufacturing (AM) of energetics provides the ability for tailored and integrated munitions with enhanced capabilities.  Integration of unique printed structures and printed energetics with smart fusing can allow for more agile manufacturing processes with reduced development times.  As a cross-service area of interest, the Department of Defense Communities of Interest in Materials and Manufacturing Processes and Weapons Technologies have engaged in discussions to identify areas of collaboration.  In order to rapidly advance additive manufacturing of energetics, a joint effort across the services and the Department of Energy would support the programs interested in AM of energetics, such as Program Executive Office for Ammunition, Next Generation Hand-Grenade, Harpoon, and Lightweight torpedo."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "Explore preliminary concepts of low volume direct write energetics within smart fusing in tailored AM structures.  In addition, systemically explore the relationship between low volume direct write energetics and tailored AM metallic structures."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}