{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-26",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602705A"
        },
        "ProgramElementTitle": {
            "val": "Electronics and Electronic Devices"
        },
        "R1LineNumber": {
            "val": "32"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "98.855"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "98.855"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is realigned, with continuity of effort realigned to the following PEs:\n* PE 0602143A Soldier Lethality Technology\n* PE 0602144A Ground Technology\n* PE 0602145A Next Generation Combat Vehicle Technology\n* PE 0602146A Network C3I Technology\n* PE 0602148A Future Vertical Lift Technology\n* PE 0602150A Air and Missile Defense Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE designs and evaluates power components and power management technologies, frequency control and timing devices, high power microwave devices, display technologies, and electronic components. The applied research on these technologies enable the ability to perform precision deep fires against critical mobile and fixed targets; investigate all-weather, day or night, theater air defense against advanced enemy missiles and aircraft; as well as investigate enhanced communications and target acquisition through support of capabilities such as autonomous missile systems, advanced land combat vehicles, smart anti-tank munitions, electric weapons, secure jam-resistant communications, automatic target recognition, foliage-penetrating radar, and combat identification. Project EM8 designs and evaluates high-power electronic components and technologies. Project H11 designs, investigates and validates advanced power and energy technologies (batteries, alternative energy and hybrids) and power management and distribution techniques (wireless power, intelligent power management). Project H17 designs and evaluates flexible displays in conjunction with the Flexible Display Center. Project H94 researches and evaluates electronic component technologies such as photonics, micro electromechanical systems, imaging laser radar, magnetic materials, ferroelectrics, microwave and millimeter-wave components, and electromechanical systems. \n\nWork in this PE complements and is fully coordinated with efforts in PE 0602120A (Sensors and Electronic Survivability), PE 0602307A (Advanced Weapons Technology), PE 0602709A (Night Vision Technology), PE 0602782A (Command, Control, Communications Technology), PE 0602783A (Computer and Software Technology), PE 0603001A (Warfighter Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "96.76"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "98.855"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.095"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.937"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.842"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EM4"
                    },
                    "ProjectTitle": {
                        "val": "Electric Component Technologies (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "38.5"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "38.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Electronics and Electronic Component applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Flexible Hybrid Electronics Tech"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Flexible Hybrid Electronics Tech"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Silicon Carbide Electronics Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "19.982"
                                        },
                                        "Text": {
                                            "val": "Silicon Carbide Electronics Research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Position Navigation Timing Systems"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8.5"
                                        },
                                        "Text": {
                                            "val": "Position Navigation Timing Systems"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Power Generation and Storage Systems"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Tactical Power Generation and Storage Systems"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.018"
                                        },
                                        "Text": {
                                            "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EM8"
                    },
                    "ProjectTitle": {
                        "val": "High Power And Energy Component Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.284"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "12.284"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602145A Next Generation Combat Vehicle\n* Project BF8 Artificial Intelligence & Machine Learning Tech\n* Project BH7 Enhanced VETRONICS Technology\nPE 0602146A Network C3I Technology\n* Project AO2 Stand-In Advanced RF Effects (STARE)\n* Project AP4 CEMA Camouflage Technology\n* Project AP5 Electronics Warfare Technology\nPE 0602150A Air and Missile Defense Technology\n* Project AD2 High Energy Laser (HEL) Enabling and Support Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project provides for the research, development, and evaluation of high-power electronic components, materials, and related technologies. These technologies have application in compact and efficient power conversion, conditioning, and management sub-systems; energy storage and conversion devices; radio frequency (RF)\/microwave and solid-state laser directed energy weapons (DEW); traditional and non-traditional RF and laser electronic attack; and RF photonics. All project elements are coordinated with, and as appropriate leveraged by, DEW and power\/energy programs in the Air Force, Navy, High Energy Laser Joint Technology Office, Defense Threat Reduction Agency, national labs, university consortia, and relevant industry and foreign partners. The products of this research are required by developers of Army and Department of Defense (DoD) systems to evolve traditional (mechanical-based) sub-systems such as geared transmissions, plate armor, and kinetic projectiles to electrically-based ones. These products will provide the Soldier enhanced survivability and lethality through increased power management and energy savings as well as new fighting capabilities offered only by electrical power.\n\nThis Project sustains Army science and technology efforts supporting the Ground Maneuver, Lethality, Soldier and Command, Control, Communications and Intelligence Portfolios.\n\nThe work in this Project is coordinated with the Army Combat Capabilities Development Command, Ground Vehicle Systems Center, Armaments Center, Aviation and Missile Center, and Command, Control, Computers, Cyber, Intelligence, Surveillance, and Reconnaissance Center and the United States Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT).  \n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Solid-State Laser Technology and Integrated Photonic Technologies"
                                    },
                                    "Description": {
                                        "val": "Research novel solid-state laser concepts, architectures, and components with the goal of providing advanced laser technology to Army directed energy weapon and tactical laser developers. Exploit breakthroughs in laser technology, develop and employ innovative laser gain material, and utilize photonics to meet the stringent weight\/volume requirements for Army platforms, especially to enhance and improve the generation, transmission, reception, and processing of RF signals. Applied laser research will be conducted in close collaboration with domestic and foreign material vendors, university researchers, and major laser diode manufacturers"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Investigated innovative fully crystalline fiber designs, in particular, the ?crystalline core\/crystalline cladding? design (a.k.a. CCCC or C4) developed to enable high energy laser power scaling out of single fiber laser aperture to >10X compared to the current state-of-the-art; explore alternative Raman fiber designs for power scaling of direct diode cladding pumped Raman fiber lasers; and developed structures, devices, and architectures to enable optical phased arrays capable of free space optical communications and ranging, and timing and position synchronization needed for mobile platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronic Attack Technologies\/Spectrum Sensing and Exploitation"
                                    },
                                    "Description": {
                                        "val": "This effort investigates emerging technologies related to electronic warfare (EW) applications, non-kinetic survivability\/lethality, and emerging concepts of operation, such as cognitive radar, in the increasingly contested and congested electromagnetic environment, with the goal of enhancing the survivability\/lethality of Army platforms through electronic attack (EA), electronic warfare support (ES), and electronic protection (EP)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.788"
                                            },
                                            "Text": {
                                                "val": "Developed neutralization techniques for autonomous vehicles; investigated remote determination of target susceptibility; and explored next-generation cognitive radar performance in realistic congested and contested spectral environment. Designed and developed EA, ES, and EP tools, techniques and methodologies for the highest priority Army systems and technologies for which electronic warfare is a critical threat."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronic Components and Materials Research"
                                    },
                                    "Description": {
                                        "val": "Investigate compact, high-efficiency, high-temperature, and high-power component technologies (e.g., semiconductor, magnetic, and dielectric devices) for hybrid-electric propulsion, electric power generation and conversion, and smart micro-grid power distribution. Research addresses current and future Army-unique performance and operational requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.09"
                                            },
                                            "Text": {
                                                "val": "Performed measurements on aluminum gallium nitride (AlGaN) high electron mobility transistor (HEMT) devices to demonstrate improved efficiencies and breakdown characteristics based on enhanced ohmic contacts, locally doped p-type regions using ion implantation, and AlGaN films grown on either high quality GaN or aluminum nitride (AlN) substrates; refined high speed motor drive model and utilize model to study wide bandgap (WBG) device performance; characterized WBG device performance using the motor test stand; and investigated WBG devices for high speed high voltage motor drives and tactical power conversion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Distributed Power for Autonomous Plaforms"
                                    },
                                    "Description": {
                                        "val": "The effort investigates power distribution and conversion technologies to provide compact, efficient, and high power capabilities for electrical and electro-mechanical loads supporting both mobile and stationary platforms. High voltage and intelligent control methods will be coupled with the ongoing research in autonomy technologies to provide advanced performance enhancements in mobility and capabilities for these platforms.  Research on innovative electric machines covering both electrical generation and motor technologies will focus on providing efficient, power dense, fault tolerant generation and mobility capabilities. Research addresses current and future Army-unique power delivery challenges in compact autonomous air and ground platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.4"
                                            },
                                            "Text": {
                                                "val": "Investigated power control topologies that provide low speed high torque motor operation; explored power distribution and conversion methods for power generation that enhance fault tolerance and provided graceful degradation; investigated high voltage switching and power packaging for application in conversion and distribution for autonomous platform mobility and power generation; and performed research in compact power switching, conversion and distribution technologies to produce fast, high energy electrical discharge to provide unique mobility enhancements through application of high voltage phenomenology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RF Electronic Attack\/Surveillance (Grey C3)"
                                    },
                                    "Description": {
                                        "val": "Investigate emerging technologies to enable EW applications in a grey environment. The goal is to develop software and reconfigurable RF hardware in a handheld form factor for distributed electronic attack, distributed EW support, and communications. EW support includes advanced passive and active RF sensing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Investigated techniques for distributed EA and ES from handheld platforms; and validated commercial off-the-shelf (COTS) and government off-the-shelf (GOTS) software-defined radios for use as surrogate development hardware."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vulnerability Analysis Methodology for CEMA threats"
                                    },
                                    "Description": {
                                        "val": "Research and investigate the optimum configuration of experimental and analysis methodology for separate and combined cyber and electromagnetic threat attack so as to better support and inform Army system designers, analysts, evaluators, and decision makers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Designed and developed a vulnerability analysis and susceptibility profile methodology based on current simulation and experimental methods for cyber and electromagnetic threats. Investigated and validated methodology to improve Protect, Detect, React, and Restore assessments through automation and advanced analytics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.006"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H11"
                    },
                    "ProjectTitle": {
                        "val": "Tactical  And Component Power Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.49"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.490"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602143A Soldier Lethality Technology\n* Project BD8 Soldier & SM Unit Tactical Energy Tech\nPE 0602148A Future Vertical Lift Technology\n* Project AM4 Opt Energy Stg & Therm Mgmt for FVL Survivability"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project identifies, advances, and enhances emerging power generation, energy storage, and power management components and software. This Project researches advancements in enabling power management, rapid decision making, expeditionary maneuver, and distributed operations across the battlefield. This Project also researches materials and components to develop lightweight, higher capacity, safer and more efficient power technologies that will enable continuous and energy aware operations while on the move and across battlefield environments. \n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Power Generation Technology"
                                    },
                                    "Description": {
                                        "val": "This effort designs, investigates and validates Soldier-borne power generation and energy storage technologies in order to decrease Soldier load and power burden, and increase power capabilities by providing more energy to prolong mission run-time. This effort will investigate energy harvesting devices while on the move which will enable a continuous operations and reduced logistics for the Soldier. This effort will also investigate advanced hybrid battery chemistries for wearable, flexible battery designs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.843"
                                            },
                                            "Text": {
                                                "val": "Completed optimization of electromechanical component technology designs in kinetic energy harvesting devices for maximum power generation and conversion efficiency to enable  continuous, distributed operations; continued investigation of power generating techniques with significant power densities including ultra-capacitor technology; completed the optimization and integration of high voltage cathode materials into representative battery cells to validate designs and assess energy density advancements; completed the development of Silicon Anode and Lithium Sulfur cell materials for advanced lithium primary and rechargeable battery cell packs that enables a 2x improvement in performance; and researched novel chemistries and balance of plant materials for smaller, lighter, wearable \/ portable fueled power sources to enable continuous power generation and platoon battery charging. Developed 370 Watt-hour\/kilogram (Wh\/kg) Si anode baseline cells for use and integration into the Conformal Wearable Battery (CWB) pairings to assess its ability to increase the runtime for Soldiers and Small Units that require more energy, longer runtimes in distributed operations with limited resupply. Finalized cell drawings, to include dimensions, weight, and performance. Completed electrode development and developed safety mechanisms to mitigate cell propagation and cell venting. Completed multiple increments of safety cell testing based on anode\/cathode adjustments. Designed and began development of ridged, but conformed CWB housing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optimized Energy for C4ISR Platforms"
                                    },
                                    "Description": {
                                        "val": "This effort investigates power and thermal management associated with high power Command, Control, Communications, computers, Intelligence, Surveillance and Reconnaissance (C4ISR) capabilities on ground and air platforms enabling enhanced mobility and mission flexibility. This effort funds research to improve platform efficiency through the use of on-demand hybrid power architectures, while also researching ways to eliminate platform thermal constraints. This effort will also investigate very high density power sources and energy storage for high rate pulsed power, power management and thermal management for dynamic high rate pulsed power."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.642"
                                            },
                                            "Text": {
                                                "val": "Investigated power requirements for emerging C4ISR capabilities to include directed energy, lasers, high power sensors, and electromagnetic weapons; conducted analysis of size, weight and power requirements necessary to support these capabilities with unique very high density power sources and energy storage for high rate pulsed power; identified interface requirements and constraints for power system; investigated architectures and intelligent controls necessary to manage these loads; investigated and performed high resolution characterization of cyclical, step and high power load profiles likely to result from use of lasers or other high power, short duration burst technology; examined thermal implications and waste heat generated from inefficiencies in power conversation; explored hybrid energy storage technologies to support cyclical loads such as hybrid batteries or ultra-capacitor technology; determined duel use potential of microwave or laser power transmission technologies with other developmental operational uses; conducted experiments on wireless power transmission capabilities for laser power transmission; explored the use of intelligent control strategies for platform integrated power systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.005"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H94"
                    },
                    "ProjectTitle": {
                        "val": "Elec & Electronic Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "37.581"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "37.581"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to:\nProgram Element (PE) 0602143A Soldier Lethality Technology\n* Project BD8 Soldier & Sm Unit Tactical Energy Tech\nPE 0602144A Ground Technology\n* Project BL1 Materials and Manufacturing Research Technology\nPE 0602145A Next Generation Combat Vehicle\n* Project BI2 Sensor Protection Technology\n* Project BJ3 Hydrogen Based Combat System Technology\nPE 0602146A Network C3I Technology\n* Project AO4 Energy Efficient Devices Technology\n* Project AV5 Protective Technologies\n* Project AV9 Advanced PNT for GPS Independent Environments Tech\nPE 0602148A Future Vertical Lift Technology\n* Project AK2 Aviation Survivability Technology\n* Project AL8 Holistic Situational Awareness and Dec Making Tech\nPE 0602150A Air and Missile Defense Technology\n* Project AD5 Next Generation Fires Radar Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs and characterizes electronics, electronic components, and electronic devices for Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) applications and battlefield power and energy applications. Significant areas of component research relevant to C4ISR include: antennas, millimeter wave components and imaging, micro- and nano-technology, eye-safe laser radar (LADAR), vision and sensor protection, infrared (IR) imaging, photonics, and prognostics and diagnostics. Areas of research relevant to power and energy include power and thermal management, micro-power generators and advanced batteries, fuel reformers, fuel cells for hybrid power sources, and photosynthetic routes to fuel and electricity. \n\nThis Project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Soldier, Ground and Air portfolios. Work in this Project is fully coordinated with PE 0602709A (Night Vision Technology), PE 0603001A (Warfighter Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), and PE 0603313A (Missile and Rocket Advanced Technology).\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Antennas, Microwave Components, and Millimeter Wave Imaging"
                                    },
                                    "Description": {
                                        "val": "This effort designs, characterizes, and validates high performance antennas, microwave components, and software for multifunction radar, radio frequency (RF) sensing, and communication systems. Research areas include scanning techniques, broadbanding, beamforming, polarization, platform integration, and affordability. For microwave components, research areas include software defined radios, analog-to-digital conversion rates, bandwidth resolution, bit accuracy, circuit design and affordability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.664"
                                            },
                                            "Text": {
                                                "val": "Performed in-situ simulations of low-profile antennas and propagation; integrated and characterized new antenna and RF electronics to improve the performance of the helicopter situational awareness radar and study the fusion of these radars with other hostile fire sensor modalities; enhanced efforts for material driven antenna designs to include evolving antenna additive manufacturing through the investigation of higher dielectric feed stock and conductive printed metals; produced novel, complex and conformal multiband array designs that are not cost effective to produce with current commercial materials; designed enabling components for transmitter architectures that supports complex digital modulations in the presence of very strong nonlinearities; studied enabling devices and integrated circuits at millimeter-wave frequencies at the advent of 5G and newly competed spectrum; developed machine learning techniques\/algorithms for RF modulation recognition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability for Wireless Tactical Networks"
                                    },
                                    "Description": {
                                        "val": "This effort researches, designs and implements protocols and algorithms for networks of physical devices and autonomous systems operating under severe energy and bandwidth constraints, and which are vulnerable to adversarial infiltration. The objective is to enhance the performance and survivability of these tactical wireless networks through improved monitoring and detection of network problems, resulting from both adversarial activity and the operating environment, and through proactive adaption of the computer and network routers to these dynamics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.75"
                                            },
                                            "Text": {
                                                "val": "Investigated and developed cognitive networking algorithms that optimize media access control scheduling and network routing in resource constrained (e.g. energy, processing), congested and contested environments; implemented energy and computationally efficient techniques to determine if resource constrained devices have been infiltrated and corrupted by an adversary; investigated approaches for adapting and optimizing communication modalities in response to adversarial activity; and implemented techniques for simulating and emulating large scale networks to enable analyzing the behavior of complex systems of networks in complex tactical operating environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Protection"
                                    },
                                    "Description": {
                                        "val": "This effort develops and characterizes materials for protection of electro-optic (EO) systems from lasers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.625"
                                            },
                                            "Text": {
                                                "val": "Matured EO materials and supporting electronic components; validated speed and degree of protection of large-area EO shutters; and conducted experiments to determine performance of tunable longwave IR filter designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Applied Photonic and Optoelectronic Devices"
                                    },
                                    "Description": {
                                        "val": "This effort models and develops materials and devices for the next generation Army sensor systems. Semiconductor materials and devices from Ultraviolet (UV) to Infrared (IR) with active and passive imaging capabilities will be modeled and developed. This will allow the Soldier to maintain situational awareness day and night under cluttered battlefield conditions. Sources and detectors for next generation secure battlefield communication devices will also be developed. For asymmetric threats, chemical sensing devices will also be studied and developed."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.141"
                                            },
                                            "Text": {
                                                "val": "Conducted three dimensional (3D) modeling of the device properties of mercury cadmium telluride semiconductor structures that utilize novel resonant architectures or carrier depletion techniques to reduce dark current and increase operating temperature of IR detectors and thereby reduce the need for cryogenic cooling; designed and developed near ultraviolet laser sources based upon semi-polar and non-polar III-Nitride semiconductor heterostructures to enable compact and low cost ion-based quantum devices for networking; and continued development and characterization of molecularly imprinted polymers as a chemical detection filter \/ concentrator for studying asymmetric threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power and Thermal Management for Small Systems"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs, and fabricates micro-electromechanical system (MEMS)-based components to improve power generation and micro-cooling technology for both dismounted Soldier and future force applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.903"
                                            },
                                            "Text": {
                                                "val": "Demonstrated integrated thermophotovoltaic generator with overall system efficiency improved through an integrated heat recuperator and demonstrate multiple \"simple\" fuels, including single component hydrocarbons and surrogate fuels for more complex fuels like JP-8; and used experimental results to validate models developed as part of this objective for the different fuel and catalyst material combinations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power and Energy"
                                    },
                                    "Description": {
                                        "val": "This research focuses on the design and characterization of chemistries, materials, and components for advanced batteries, fuel reformers, and fuel cells. Potential Army applications include hybrid power sources, smart munitions, hybrid electric vehicles, and Soldier power applications.  Additionally, investigate the applicability of photosynthesis to provide fuel and electricity for Soldier power applications, and investigate silicon carbide (SiC) power module components that could enable compact, high efficiency, high temperature, and high power density converters for motor drive and pulse power applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.671"
                                            },
                                            "Text": {
                                                "val": "Improved the efficiency of dual intercalation electrodes for inexpensive grid energy storage; investigated additives to limit dendrite formation of lithium metal batteries for high energy density rechargeable batteries; investigated all-solid-state chemistries for safe lithium batteries; analyzed and interpreted the results of the investigation of new methods for reduced aging improved duration of thermal batteries performed in FY18; determined through modeling or conducting experiments the performance of these methods; investigated nanocomposite non-noble catalysts and acid-alkaline bipolar membrane electrolyte interface and single cell performance; integrated semipermeable membrane materials and electrolytes via hybrid bi-cell and bipolar membrane technologies to address costs and balance-of-plant issues."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy Harvesting"
                                    },
                                    "Description": {
                                        "val": "This research develops technologies to substantially reduce the number of batteries required to accomplish dismounted Soldier\/Squad mission objectives, thereby significantly reducing Soldier-borne load and logistics requirements. Research will explore technologies to harvest electrical power by converting and storing energy via engineered structures and electronic bandgaps, MEMS-based micro-scale power conversion, and heterogeneous three dimension (3D) assembly of MEMS with other devices to enable efficient, distributed power conversion. Research explores novel paths to local fuel and energy production, including artificial photosynthesis, to extract hydrogen and electricity directly from water and sunlight."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.022"
                                            },
                                            "Text": {
                                                "val": "Incorporated broad-angle anti-reflection \/ rear surface light trapping structure matched to response spectrum of optimized hybrid quantum-mechanical based solar cell; investigated novel thermal energy harvesting including elastocalorics and pyroelectrics; developed plasmonically enhanced water and urea splitting device; developed the capability of enhancing catalytic reactions using infrared radiation; developed antimonide-doped gallium nitride water splitting device; and demonstrated methanol production from Carbon Dioxide (CO2) through reduction processes in the present of sunlight."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy Efficient Electronics & Photonics"
                                    },
                                    "Description": {
                                        "val": "This effort addresses sustainment operations by unburdening the Soldier and reducing logistics requirements (e.g., fewer batteries) for communications, computing, and sensing. The objective is to improve the underlying energy efficiency of supply and demand for Soldier-portable and unattended sensor electronics to enable the dismounted Soldier to maintain communications, freedom of movement, and increase mission duration. The majority of the electronics power used by the dismounted Soldier and by unattended sensors is attributable to RF communications. In addition, freedom of movement and action during sustained and high tempo operations requires seamless battery recharging. To address these challenges, energy efficient electronics research includes RF circuits, devices, materials and wireless power distribution. Energy efficiency improvements will be developed and investigated in support of five key sensor and electronic areas: RF component devices, passively powered components, low-power, long-lived sources, wireless power transfer, and advanced battery chemistries.  Additionally, materials and devices used for photonic applications, such as laser diodes and fiber lasers, will be studied and improved with an emphasis on overall size, weight, and power consumption efficiency gains."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.513"
                                            },
                                            "Text": {
                                                "val": "Designed and fabricated advanced node silicon and gallium nitride integrated circuits implementing Soldier Radio Waveform with 3X reduction in power draw; characterized carrier transport in semiconductor laser diode structures for the development of large area UV emitters; investigated processes to make 3-D electrode structures and investigate their effect on energy storage chemistry rates and ionic and electronic transports; investigated solid-state chemistries for safe lithium batteries; developed MEMS-based and resonant RF sensors that can passively sense an RF signal while consuming < 10 nW of power for zero-power-consuming sleep mode electronics; determined the efficiency and power transfer limits of laser-to-pyroelectric wireless power transfer; explored acoustic power transfer with the ability to steer the acoustic beam source using arrays of acoustic transducers; designed and developed near-ultraviolet laser sources based upon semi-polar and non-polar III-nitride semiconductor heterostructures to enable compact and low cost ion-based quantum devices for networking."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precision Measurement Technology for Contested Environments"
                                    },
                                    "Description": {
                                        "val": "This research focuses on technologies that will enable precise and assured position, navigation and timing in global positioning system (GPS)-denied environments. The first objective of this research is to improve the size, weight, power, cost, and accuracy of current micro-Inertial Measurement Systems (IMS) through the design, and fabrication of MEMS gyroscopes. The second objective is to develop an opto-electronic device that can be used as an ultra-precise local oscillator with improved stability for precision timing applications. The third objective is to address the ability to transmit jam-resistant precision timing signals by investigating the transmission of precision, synchronized timing signals over optical fibers and free-space using lasers. The fourth objective is to explore new RF antenna concepts to extend the reach of IMS systems through pseudolites (ground-based substitutes for GPS satellites) and Soldier-borne systems, and to integrate multiple sensor modalities with the IMSs using sensor fusion techniques to reduce drift and increase positional accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.983"
                                            },
                                            "Text": {
                                                "val": "Developed robust object recognition, efficient simultaneous localization and mapping and interactive topological mapping methods and integrate them into low size, weight and power - Cost (SWAP-C) platforms; investigated novel information sources to passively locate humans in a complex and cluttered environment; designed, fabricated and characterized an integrated MEMS and heterogeneous sensor solution for increased state estimation accuracy; improved positioning, navigation, and timing (PNT) sensor fusion algorithms to include input from a heterogeneous array of aiding sensors in diverse environments; assembled wearable anti-jam GPS test- bed and study performance of body-distributed anti-jam GPS antennas in laboratory environment; designed and characterized an asymmetric free-space optical link that uses a retro-reflector to measure the time delay between the transmitter and receiver and uses a modulated laser to develop low SWAP-C free-space optical time transfer techniques; investigated deep learning based approaches for perception, including scene, landmark and skyline recognition on computationally constrained platforms to enable geo-localization without GPS; and continued to develop and optimize material fabrication process for construction of environmentally stable Epsilon-Near-Zero oscillator materials and devices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Tamper (AT) Technology Development"
                                    },
                                    "Description": {
                                        "val": "This effort develops tools, devices, and techniques to protect acquisition program systems and Critical Program Information (CPI) from adversarial threats. This work is executed by the Army Anti-Tamper Office located at the Aviation and Missile Research, Development and Engineering Center (AMRDEC) at Redstone Arsenal, AL."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.9"
                                            },
                                            "Text": {
                                                "val": "Developed threat-based sensors and secure processor Intellectual Property (IP) to support Rigor technology refresh; manufactured full Rigor 1b engineering models; completed laboratory characterization of Rigor 1b module; continue design and development of Rigor 1a module; and developed Rigor 1a test-modules."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technologies for Alternative Energy"
                                    },
                                    "Description": {
                                        "val": "Design and develop novel concepts of energy generation, energy capture materials, and component technologies for efficient conversion of ambient energy to electrical energy for use and storage. Design components to include microscale power devices for multimodal harvesting and efficient distributed power conversion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.191"
                                            },
                                            "Text": {
                                                "val": "Developed improved thermoelectric materials, with a goal of >2X improvement (>10%) conversion efficiency for low temperature differences near 1000 C; assembled and validated battery or pseudo-capacitor packs for both electrochemical and safety."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quantum for Assured PNT in Zero-GPS Environments Acceleration"
                                    },
                                    "Description": {
                                        "val": "To develop quantum-based GPS-independent ultra-high precision PNT in a contested\/gps denied battlespace for mission durations up to 7 days w\/o external timing or position re-synchronization.  This effort also enables Camouflage, Concealment, and Decoys (CC&D) in an Electronic Warfare (EW) space and synchronization of disaggregated platforms \/ fires across the battlefield for distributed sensing, processing, and lethal effect."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.201"
                                            },
                                            "Text": {
                                                "val": "Designed integrated triaxial MEMS Internal measurement units (IMUs) with 3 orders of magnitude improvement in accuracy (goal TRL4 in FY21), developed approach\/design for integrated photonics and quantum timing circuit that meets PNT timing requirements while meeting on Soldier SWAP-C goals, and built optical time synchronization demonstration for FY20\/TRL3 demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.017"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}