{
    "id": "2021-Army-PB-2040-JBOOK-ad016dd9ebfbe1f27853ca49333275c9694f893e3957d91046dc979378596c58-6",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604808A"
        },
        "ProgramElementTitle": {
            "val": "Landmine Warfare\/Barrier - Eng Dev"
        },
        "R1LineNumber": {
            "val": "142"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "39.261"
            },
            "CurrentYear": {
                "val": "37.108"
            },
            "BudgetYearOne": {
                "val": "9.589"
            },
            "BudgetYearOneBase": {
                "val": "9.589"
            },
            "BudgetYearTwo": {
                "val": "9.226"
            },
            "BudgetYearThree": {
                "val": "9.088"
            },
            "BudgetYearFour": {
                "val": "2.398"
            },
            "BudgetYearFive": {
                "val": "1.919"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "108.589"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) provides for the Engineering and Manufacturing Development (EMD) and demonstration of networked munitions, countermine systems, Explosive Ordnance Disposal (EOD) render safe, and counter improvised explosive device capabilities. This PE also implements the National Landmine Policy to develop alternatives to the non-self-destructing counter mobility anti-personnel landmine systems. The PE contributes to area access and area denial (A2\/AD) to support unified land operations and improve soldier survivability.\n\nProject 016:  Funding in this program supports the Army's Cross Functional Teams (CFT) initiatives.  Project 016, Close Combat Capabilities, covers two programs: Next Generation Advanced Bomb Suit (NGABS) and Explosive Ordnance Disposal Render Safe (EOD RS). It provides for the Engineering and Manufacturing Development (EMD) and demonstration of capabilities needed for Explosive Ordnance Disposal (EOD) teams to Render Safe (RS) US and foreign ordnance and improvised explosive devices, enabling ground force commanders to retain freedom of maneuver and secure lines of communications.  NGABS directly contributes to Soldier lethality and ground force commander freedom of maneuver by providing next generation sensor and optics in the cutting-edge Heads-Up-Display (HUD) while integrating the Government's latest investments in protective material for the modular, scalable NGABS bomb suit fabrication.  EOD RS equips EOD teams with low light visual augmentation system, electronic countermeasures, buried IED detection, dismounted X-ray imager, X-ray generator, trace explosive, Chemical, Biological, Radiological, and Nuclear (CBRN), and drug detection, unmanned aerial system, power management, gamma and neutron search and detection, and render safe initiation.  This project will continue to support cross-service initiatives to improve commonality.\n\nNGABS will increase the Warfighter lethality and mobility by optimizing Soldier protection for EOD personnel, while effectively managing all life cycle aspects of Personal Protective Equipment (PPE). Warfighter lethality is increased through bomb suit weight reduction utilizing extensive investments in protective material research and development.  The result is material solutions that are lighter and are pieced together in a manner which increases Soldier mobility and longevity.  EOD Soldier situational awareness and exposure to ballistic threats is enhanced through the NGABS HUD which allows the Soldier increased visibility under various obscurants and low\/no-light situations.\n\nProject 415:  This Project provides for Engineering Manufacturing and Development (EMD) for the next generation of capabilities to detect, identify and neutralize hybrid threats and explosive hazards such as Improvised Explosive Devices (IEDs) and landmines.  These capabilities are a Family of Systems (FOS) encompassing handheld, vehicle mounted, small robotic mounted, aerial platform mounted and area access, and neutralization systems operating in manned, remotely controlled, semi-autonomous or fully autonomous modes.  Continued development of this FOS is necessary to support Route Clearance Platoons located within both Engineer Companies and Brigade Engineering Battalion Brigade Combat Teams.\n\nThe Husky Mounted Detection System (HMDS) is a counter-explosive device capability that provides standoff detection and marking of metallic encased caches and metallic and low-metallic antitank landmines, unexploded ordnance, trigger mechanisms, and improvised explosive devices (IEDs) in support of route and area-clearance operations. HMDS is a mission equipment package mounted on the Husky route clearance vehicle. The program was restructured in September 2016 to align with emerging shallow buried Wire Detection (WD) capabilities integrated onto the HMDS Increment A1 configuration (includes Ground Penetrating Radar (GPR)). These changes are necessary to adapt to changing IED threats. WD Technology will be fully integrated through Engineering Change Proposals (ECPs) at the end of FY20. Prototypes developed under the concluded HMDS Increment A2 effort may be leveraged in development of future capabilities. Future capabilities may include detection of deep buried IEDs and caches, and semi-autonomous control of the Husky vehicle and HMDS from inside a follow-on vehicle. \n\nRoute Clearance & Interrogation System (RCIS) Type I consists of a semi-autonomous vehicle and includes designated control vehicles and Operator Control Units (OCUs) which provide a standoff capability to detect and neutralize the full spectrum of explosive hazards. Type I integrates a semi-autonomous kit onto a High Mobility Engineering Excavator (HMEE) for remote control from a Buffalo Mine Protected Clearance Vehicle (MPCV). RCIS Type I semi-autonomous kit will be integrated onto the HMEE and be capable of interrogating and classifying explosive hazards. An OCU will be integrated into a Buffalo MPCV for Type I. RCIS capabilities will be fielded to Route Clearance Squads and Engineer Platoons which includes Tele-operation, RADAR-based Follow-Me, LIDAR obstacle detection, onscreen predictive turning map, and customizable camera views in order to achieve the RCIS mission.  \n\nStandoff Robotic Explosive Hazard Detection System (SREHD), formerly known as the Autonomous Mine Detection System (AMDS), provides increased survivability through mine and explosive hazards stand-off detection, marking and neutralization capability for the dismounted soldier.  It provides area access and freedom of movement for the Commander.  SREHD consists of payload modules to be mounted on man-portable unmanned ground vehicles.  The payloads are for surface laid and buried threats to include mines and explosive hazards.  This capability allows a soldier to remain in a protective posture while detecting and neutralizing a wide variety of hybrid and conventional explosive threats.  SREHD conducted a successful Milestone (MS) C in April 2018 and initiated Low Rate Initial Production (LRIP) in June 2018.  Due to the realignment of funds FY 2020-2024 to higher Army priorities, the proponent withdrew support to the Standoff Robotic Explosive Hazard Detection System (SREHD) after Low Rate Initial Production (LRIP) award.  Research, Development, Test and Evaluation (RDTE) tasks will conclude in FY 2019 under FY 2018 PE 0654808A, Project 415, Landmine Warfare\/Barrier - Eng Dev, once corrective action plans and trainer re-development are completed.  The program will conclude in June 2020 under FY 2018 OPA R68260 \/ AREA MINE DETECTION SYSTEM (AMDS) and PAA E50510 \/ DEMO KIT, BLASTING: Munition Array Charge, XM335 for system qualification and production and receipt of LRIP quantities for an orderly program closeout.\n\nRobotic Explosive Hazard Detection System (REHDS) provides the warfighter with a robotic mounted capability to detect and mark buried landmines and IEDs from a safe standoff distance.  REHDS is an enabler for Soldier Lethality as it enables soldier maneuverability by enhancing the probability and speed of detection of buried landmines and IEDs allowing for increased speed of dismounted operations making the unit more efficient and lethal.  REHDS is a new start in FY 2021 and begins in the Engineering and Manufacturing Development (EMD) phase.  REHDS will leverage developed SREHD capability and incorporate increased Rate of Advanced Downtrack (RoAD) and Integration to the Man Transportable Robotic System (MTRS) II platform. FY 2021 Total Base funding in the amount of $1.998 million supports EMD activities with REHDS."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "43.064"
                },
                "CurrentYear": {
                    "val": "39.208"
                },
                "BudgetYearOne": {
                    "val": "166.902"
                },
                "BudgetYearOneBase": {
                    "val": "166.902"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "39.261"
                },
                "CurrentYear": {
                    "val": "37.108"
                },
                "BudgetYearOne": {
                    "val": "9.589"
                },
                "BudgetYearOneBase": {
                    "val": "9.589"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.803"
                },
                "CurrentYear": {
                    "val": "-2.1"
                },
                "BudgetYearOne": {
                    "val": "-157.313"
                },
                "BudgetYearOneBase": {
                    "val": "-157.313"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-2.1"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-3.803"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-157.313"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-157.313"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2021 funding decrease in the amount of $157.313 million due to a change in acquisition strategy for the Close Terrain Shaping Obstacle development effort.  Funding has been realigned as appropriate to Program Element 0603619A, Project EK7, Area Denial Capability Development and Budget Line Item 0612E76740, Standard Stock Number (SSN) F78310 - Close Terrain Shaping Obstacles."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "016"
                    },
                    "ProjectTitle": {
                        "val": "Close Combat Capabilities ENG DEV"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.454"
                        },
                        "CurrentYear": {
                            "val": "19.198"
                        },
                        "BudgetYearOne": {
                            "val": "7.591"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.591"
                        },
                        "BudgetYearTwo": {
                            "val": "3.231"
                        },
                        "BudgetYearThree": {
                            "val": "2.094"
                        },
                        "BudgetYearFour": {
                            "val": "2.398"
                        },
                        "BudgetYearFive": {
                            "val": "1.919"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "43.885"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project 016:  Funding in this program supports the Army's Cross Functional Teams (CFT) initiatives.  Project 016, Close Combat Capabilities, covers two programs: Next Generation Advanced Bomb Suit (NGABS) and Explosive Ordnance Disposal Render Safe (EOD RS). It provides for the Engineering and Manufacturing Development (EMD) and demonstration of capabilities needed for Explosive Ordnance Disposal (EOD) teams to Render Safe (RS) US and foreign ordnance and improvised explosive devices, enabling ground force commanders to retain freedom of maneuver and secure lines of communications.  NGABS directly contributes to Soldier lethality and ground force commander freedom of maneuver by providing next generation sensor and optics in the cutting-edge Heads-Up-Display (HUD) while integrating the Government's latest investments in protective material for the modular, scalable NGABS bomb suit development.  EOD RS equips EOD teams with low light visual augmentation system, electronic countermeasures, buried IED detection, dismounted X-ray imager, X-ray generator, trace explosive, Chemical, Biological, Radiological, and Nuclear (CBRN), and drug detection, unmanned aerial system, power management, gamma and neutron search and detection, and render safe initiation.  This project will continue to support cross-service initiatives to increase commonality.\n\nNGABS will increase the Warfighter survivability and mobility by optimizing Soldier protection for EOD personnel, while effectively managing all life cycle aspects of Personal Protective Equipment (PPE).  Warfighter lethality is increased through bomb suit weight reduction utilizing extensive investments in protective material research and development.  The result is material solutions that are lighter and are pieced together in a manner which increases Soldier mobility and longevity.  EOD Soldier situational awareness and exposure to ballistic threats is enhanced through the NGABS HUD which allows the Soldier increased visibility under various obscurants and low\/no-light situations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Next Generation Advanced Bomb Suit (NGABS)"
                                    },
                                    "Description": {
                                        "val": "The objective of this effort is to increase the Warfighter lethality, modularity, and mobility, by optimizing Soldier protection and situational awareness for EOD personnel. The mission of this program is to enhance the tactical utility and applicability of this bomb suit concept by incorporating modularity\/scalability and sensor technologies that are non-existent in legacy designs. This new, tailorable, full body protective system will provide a significantly increased capability at a reduced weight."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.454"
                                            },
                                            "Text": {
                                                "val": "Accomplishments for FY19; utilized the three (3) developmental contract efforts to finalize initial design of EOD HUD, sensor suite and bomb suit resulting in successful Preliminary Design Reviews and technical data enabling EMD competition and award.  NGABS successfully entered into the Fort Belvoir Sensors, Communications and Electronics Consortium (SCEC) due to the HUD and sensor suite development complexities.  This accomplishment further led to collaboration between the Integrated Visual Augmentation System (IVAS) and NGABS Government and Industry stakeholders.  The Government held an innovative NGABS Industry Day, introducing the SCEC acquisition methodology and incorporating major industrial players across sensor, optics, aviation, and bomb suit areas of expertise.  NGABS solicited for Other Transaction Authority (OTA) white papers, through the SCEC, leading to numerous industry submissions and an initial Government down-select assisting with industry teaming efforts.  NGABS then distributed the detailed Request for Project Proposals (RFPP) progressing towards an ultimate FY19 OTA award."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.23"
                                            },
                                            "Text": {
                                                "val": "In FY 2020, the NGABS team will continue to evaluate and develop system and subsystem technologies for the NGABS system to assist in the protection from emerging ballistic\/blast threats, and sensor technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.592"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.592"
                                            },
                                            "Text": {
                                                "val": "NGABS FY 2021 plans center around finalizing the production design for the bomb suit, executing ballistic and blast test plans with subsequent fixes applied to the suit design.  FY 2021 also leads NGABS into the complex phases of component integration; sensor suite, Heads Up Display (HUD), power, cooling, helmet, and suit with Soldier Protection System components. All of these components combined are the NGABS system.  FY 2021 includes the planning and scheduling for system level tests (ballistic, blast, environmental, Human Factor Evaluation (HFE), etc.)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "NGABS funding decrease from FY 2020 to FY 2021 is due to the initial prototyping of sensor and optics subsystems which primarily occur in FY 2020, resulting in a decrease for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosive Ordnance Disposal (EOD) Render Safe (RS)"
                                    },
                                    "Description": {
                                        "val": "Render Safe (RS) procedures require technicians to employ a wide variety of capabilities and explosives."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.096"
                                            },
                                            "Text": {
                                                "val": "Conduct evaluation, integration, and logistics demonstration of the following capabilities:  low light visual augmentation, localized incident site protection, dismounted X-Ray processor\/imager, trace explosive, CBRN and drug detection, unmanned aerial system, electric tools, gamma and neutron search and detection, final disposition, and render safe initiation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.999"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.999"
                                            },
                                            "Text": {
                                                "val": "Review 1\/3 of the Render Safe (RS) capabilities in anticipation of technical obsolescence, the changing threat, or an increase in capability that is demeaned worthy of the additional investment.  Render Safe capabilities to be reviewed in 2021 are Gamma\/Neutron radiation detection, dismounted buried IED detection, X-Ray generator, dismounted X-Ray processor\/imager.  Activities include the conduct of a market survey, testing of equipment against objective requirements, reporting of findings and recommendations.  Electronic countermeasures will continue to be tested and evaluated against emerging threats and loadset verification, validation, and release will continue."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease from FY 2020 to FY 2021 is due to the high initial cost of the full suite of capabilities in the kit which primarily occurs in FY 2020 resulting in a decrease for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.872"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "R63610"
                                    },
                                    "Title": {
                                        "val": "Render Safe Sets kits Outfits"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "102.684"
                                        },
                                        "BudgetYearOne": {
                                            "val": "148.583"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "64.583"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "84"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.994"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Next Generation Advanced Bomb Suit (NGABS) Program utilizes a competitive, developmental, innovative and efficient Other Transaction Authority (OTA) in EMD through the Fort Belvoir Sensor Communication and Electronic Consortium (SCEC) which will result in a production ready prototype leading to a competitive Production and Deployment (PD) phase for full capability while ensuring best value to the Army. Milestone (MS) B \/ Material Development Decision (MDD) occurred in FY 2018 and MS C is scheduled for FY 2022.\n\nThe Explosive Ordnance Disposal (EOD) Render Safe (RS) program utilizes existing government contract vehicles to acquire prototype systems for testing and evaluation of the systems for down selection and inclusion in the capabilities package during Engineering and Manufacturing Development.  The program will continue to use the existing government contract vehicles for the production and deployment phase as well as to continue the development of capabilities during the 5 phase technical refresh."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "NGABS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM SPE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Belvoir"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.901"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.9"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.703"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.504"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Explosive Ordnance Disposal (EOD) Render Safe (RS)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM CCS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.403"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.403"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.872"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.872"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "NGABS - Production Prototype Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Manufacturing Techniques Inc. (MTEQ), Lorton, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.675"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.116"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.153"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.98"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.98"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.924"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "EOD RS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.603"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.603"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 FFRDC \/ SBIR \/ STTR"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.438"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.438"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "NGABS Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.711"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.703"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.146"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.146"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.560"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "EOD RS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CCDC Armaments Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.825"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.325"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "EOD RS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CCDC S5ISR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Ground (APG), MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.503"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.499"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.499"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.002"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "NGABS Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.73"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.466"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.466"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.196"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "EOD RS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.703"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.703"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_016_0.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "5_016_1.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Explosive Ordnance Disposal (EOD) Render Safe (RS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EOD RS Phase 0 Market Survey"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EOD RS Phase 0 Prototype Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EOD RS Phase 0 Solution Down Selection"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EOD RS Phase 0 Loadset Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EOD RS Technical Refresh (5 Phases)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EOD RS Radiation and XRAY Technical Refresh"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EOD RS Visual Augmentation Technical Refresh"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EOD RS Electronic Countermeasure Technical Refresh"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EOD RS Render Safe Initiation Technical Refresh"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EOD RS Umanned Systems Payload Technical Refresh"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Generation Advanced Bomb Suit (NGABS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGABS Materiel Development Decision (MDD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGABS Milestone (MS) B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGABS OTA phase 1 (suit, sensors, HUD PDR\/CDR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGABS OTA phase 2 (sensor, HUD CDR, suit HFE)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGABS OTA phase 3 (integration, developmental test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGABS OTA phase 4 (test fixes, finalize design, system HFE)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGABS OTA phase 5 (final fixes, tech data and system delivery)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGABS MS C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGABS production award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGABS First Article Test (FAT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGABS production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2026"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGABS Type Classification (TC)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGABS Initial Operation Capability (IOC)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGABS Full Operational Capability (FOC)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "415"
                    },
                    "ProjectTitle": {
                        "val": "Mine Neutral\/Detection"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "31.807"
                        },
                        "CurrentYear": {
                            "val": "17.91"
                        },
                        "BudgetYearOne": {
                            "val": "1.998"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.998"
                        },
                        "BudgetYearTwo": {
                            "val": "5.995"
                        },
                        "BudgetYearThree": {
                            "val": "6.994"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "64.704"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project 415:  This Project provides for Engineering Manufacturing and Development (EMD) for the next generation of capabilities to detect, identify and neutralize hybrid threats and explosive hazards such as Improvised Explosive Devices (IEDs) and landmines.  These capabilities are a Family of Systems (FOS) encompassing handheld, vehicle mounted, small robotic mounted, aerial platform mounted and area access, and neutralization systems operating in manned, remotely controlled, semi-autonomous or fully autonomous modes.  Continued development of this FOS is necessary to support Route Clearance Platoons located within both Engineer Companies and Brigade Engineering Battalion Brigade Combat Teams.\n\nThe Husky Mounted Detection System (HMDS) is a counter-explosive device capability that provides standoff detection and marking of metallic encased caches and metallic and low-metallic antitank landmines, unexploded ordnance, trigger mechanisms, and improvised explosive devices (IEDs) in support of route and area-clearance operations. HMDS is a mission equipment package mounted on the Husky route clearance vehicle. The program was restructured in September 2016 to align with emerging shallow buried Wire Detection (WD) capabilities integrated onto the HMDS Increment A1 configuration (includes Ground Penetrating Radar (GPR)). These changes are necessary to adapt to changing IED threats. WD Technology will be fully integrated through Engineering Change Proposals (ECPs) at the end of FY20. Prototypes developed under the concluded HMDS Increment A2 effort may be leveraged in development of future capabilities. Future capabilities may include detection of deep buried IEDs and caches, and semi-autonomous control of the Husky vehicle and HMDS from inside a follow-on vehicle. \n\nRoute Clearance & Interrogation System (RCIS) Type I consists of a semi-autonomous vehicle and includes designated control vehicles and Operator Control Units (OCUs) which provide a standoff capability to detect and neutralize the full spectrum of explosive hazards. Type I integrates a semi-autonomous kit onto a High Mobility Engineering Excavator (HMEE) for remote control from a Buffalo Mine Protected Clearance Vehicle (MPCV). RCIS Type I semi-autonomous kit will be integrated onto the HMEE and be capable of interrogating and classifying explosive hazards. An OCU will be integrated into a Buffalo MPCV for Type I. RCIS capabilities will be fielded to Route Clearance Squads and Engineer Platoons which includes Tele-operation, RADAR-based Follow-Me, LIDAR obstacle detection, onscreen predictive turning map, and customizable camera views in order to achieve the RCIS mission.  \n\nStandoff Robotic Explosive Hazard Detection System (SREHD), formerly known as the Autonomous Mine Detection System (AMDS), provides increased survivability through mine and explosive hazards stand-off detection, marking and neutralization capability for the dismounted soldier. It provides area access and freedom of movement for the Commander. SREHD consists of payload modules to be mounted on man-portable unmanned ground vehicles. The payloads are for surface laid and buried threats to include mines and explosive hazards. This capability allows a soldier to remain in a protective posture while detecting and neutralizing a wide variety of hybrid and conventional explosive threats. SREHD conducted a successful Milestone (MS) C in April 2018 and initiated Low Rate Initial Production (LRIP) in June 2018. Due to the realignment of funds from FY 2020 through FY 2024 to higher Army priorities, the proponent withdrew support to the Standoff Robotic Explosive Hazard Detection System (SREHD) after Low Rate Initial Production (LRIP) award. Research, Development, Test and Evaluation (RDTE) tasks will conclude in FY 2019 under FY 2018 PE 0654808A, Project 415, Landmine Warfare\/Barrier - Eng Dev, once corrective action plans and trainer re-development are completed. The program will conclude in June 2020 under FY 2018 OPA R68260 \/ AREA MINE DETECTION SYSTEM (AMDS) and PAA E50510 \/ DEMO KIT, BLASTING: Munition Array Charge, XM335 for system qualification and production and receipt of LRIP quantities for an orderly program closeout.\n\nRobotic Explosive Hazard Detection System (REHDS) provides the warfighter with a robotic mounted capability to detect and mark buried landmines and IEDs from a safe standoff distance. REHDS is an enabler for Soldier Lethality as it guarantees soldier maneuverability by enhancing the probability and speed of detection of buried landmines and IEDs allowing for increased speed of dismounted operations making the unit more efficient and lethal. REHDS is a new start in FY 2021 and begins in the Engineering and Manufacturing Development (EMD) phase. REHDS will leverage developed SREHD capability and incorporate increased Rate of Advanced Downtrack (RoAD) and Integration to the Man Transportable Robotic System (MTRS) II platform.  FY 2021 Total Base funding in the amount of $1.998 million supports EMD activities for REHDS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "HMDS Program Management Support"
                                    },
                                    "Description": {
                                        "val": "Husky Mounted Detection System (HMDS) Program Management Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.84"
                                            },
                                            "Text": {
                                                "val": "Funded PMO Core and Matrix Support"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.131"
                                            },
                                            "Text": {
                                                "val": "Continue execution and management of Engineering Change Proposal (ECP) for Wire Detection, Infrared Illumination and Information Assurance compliance in preparation for Modification Work Order (MWO)"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no FY 2021 Base Research, Development, Test & Evaluation (RDT&E) funds requested for this project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HMDS GPR: Engineer Change Proposal (ECP) to add Wire Detection and Infrared Illumination"
                                    },
                                    "Description": {
                                        "val": "HMDS A1 Tactical GPR: Engineer Change Proposal (ECP) to add Wire Detection and Infrared Illumination"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.223"
                                            },
                                            "Text": {
                                                "val": "Funded ongoing ECP efforts for Wire Detection, Infrared Illumination and Mission Computer Upgrade"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.773"
                                            },
                                            "Text": {
                                                "val": "Will complete ongoing ECP efforts for Wire Detection, Infrared Illumination and Information Assurance compliance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no FY 2021 Base Research, Development, Test & Evaluation (RDT&E) funds for this project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HMDS Testing and Test Support activities"
                                    },
                                    "Description": {
                                        "val": "HMDS Testing and Test Support activities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.609"
                                            },
                                            "Text": {
                                                "val": "Funded Risk Reduction and ECP testing"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.388"
                                            },
                                            "Text": {
                                                "val": "Will complete Risk Reduction and ECP testing"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no FY 2021 Base Research, Development, Test & Evaluation (RDT&E) funds for this project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HMDS A1 Auto-Height Improvements"
                                    },
                                    "Description": {
                                        "val": "Auto-Height Control"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.586"
                                            },
                                            "Text": {
                                                "val": "Complete auto-height development and produce prototypes to support testing"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no FY 2021 Base Research, Development, Test & Evaluation (RDT&E) funds requested for this project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HMDS Systems Training Product Development"
                                    },
                                    "Description": {
                                        "val": "Training product development to support Developmental test and limited user testing"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.892"
                                            },
                                            "Text": {
                                                "val": "Funded training materials to support developmental and limited user testing.  Completed Limited User Testing (LUT)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.648"
                                            },
                                            "Text": {
                                                "val": "Complete development activities to support Modification Work Order (MWO)"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no FY 2021 Base Research, Development, Test & Evaluation (RDT&E) funds for this project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HMDS Program and Logistics Support"
                                    },
                                    "Description": {
                                        "val": "Program and Logistics support"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.678"
                                            },
                                            "Text": {
                                                "val": "Development of final logistics products to support logistics demo and Modification Work Order (MWO)"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no FY 2021 Base Research, Development, Test & Evaluation (RDT&E) funds requested for this project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RCIS Type I"
                                    },
                                    "Description": {
                                        "val": "Route Clearance & Interrogation System (RCIS) Type I  provides standoff capability to detect and neutralize the full spectrum of explosive hazards."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.507"
                                            },
                                            "Text": {
                                                "val": "RCIS Type I:  Executed Start of Work Meeting with both EMD contractors; completed Preliminary and Critical Design Reviews; Executed (2) user juries; initiated contractor verification testing; start the build of EMD prototypes for ATEC testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.893"
                                            },
                                            "Text": {
                                                "val": "RCIS Type I: Continue the EMD phase - perform government safety testing with full up system level RCIS prototypes; perform cyber scans and analysis; continue logistics analysis; prep for MS C in FY21."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "RDTE funding for RCIS ends in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multifunction Video Display (MVD)"
                                    },
                                    "Description": {
                                        "val": "Multifunction Video Display (MVD).  Digital display used to control and view RCV enablers"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.5"
                                            },
                                            "Text": {
                                                "val": "Will continue Support for MVD SIL at Night Vision and Electronic Sensors Directorate (NVESD) for development of additional enabler (Interrogation Arm software development for control functionality)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RCV & Enabler Improvements"
                                    },
                                    "Description": {
                                        "val": "Develop the hardware used to improve POR RCVs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.425"
                                            },
                                            "Text": {
                                                "val": "Will continue to:\n -   Develop Interrogation Arm upgrades for the Buffalo Mine Protected Clearance Vehicle (MPCV).  Demonstration of these upgrades will be performed.\n -   Develop product upgrades to the Medium Mine Protected Vehicle (MMPV) Type II Interrogation Arm so it can be operated by the MVD.\n -   Next Generation HMDS A2 to include Deep Buried Detection on the Husky and semi-autonomous control capability on the Husky and MMPV Type II \n -   Explosive Hazard Pre-Detonation (EHP) hardware upgrades"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Standoff Robotic Explosive Hazard Detection (SREHD) (Formerly AMDS)"
                                    },
                                    "Description": {
                                        "val": "Standoff Robotic Explosive Hazard Detection (SREHD) (AMDS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.811"
                                            },
                                            "Text": {
                                                "val": "Program closeout"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotic Explosive Hazard Detection System (REHDS)"
                                    },
                                    "Description": {
                                        "val": "Robotic Explosive Hazard Detection System (REHDS)"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.998"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.998"
                                            },
                                            "Text": {
                                                "val": "Develop REHDS contract and conduct Materiel Development Decision."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New Start in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.813"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "R64001"
                                    },
                                    "Title": {
                                        "val": "HUSKY MOUNTED DETECTION SYSTEM (HMDS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "35.834"
                                        },
                                        "CurrentYear": {
                                            "val": "75.586"
                                        },
                                        "BudgetYearOne": {
                                            "val": "109.069"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "109.069"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "76.8"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "297.289"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "R68102"
                                    },
                                    "Title": {
                                        "val": "GRND STANDOFF MINE DETECTN SYSM (GSTAMIDS)BLK 1"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "42.001"
                                        },
                                        "CurrentYear": {
                                            "val": "40.68"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.497"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.497"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "85.178"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DA0924"
                                    },
                                    "Title": {
                                        "val": "Modification Of In Svc Equip"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "256.642"
                                        },
                                        "CurrentYear": {
                                            "val": "83.627"
                                        },
                                        "BudgetYearOne": {
                                            "val": "114.977"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "114.977"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "29.661"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.456"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "485.363"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "R68260"
                                    },
                                    "Title": {
                                        "val": "AREA MINE DETECTION SYSTEM (AMDS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.797"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "606"
                                    },
                                    "Title": {
                                        "val": "Cntrmn\/Barrier Adv Dev"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.869"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.947"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.578"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.935"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "22.329"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "M80400"
                                    },
                                    "Title": {
                                        "val": "Robotic Combat Support System (RCSS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.879"
                                        },
                                        "CurrentYear": {
                                            "val": "5.3"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "14.179"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "E50510"
                                    },
                                    "Title": {
                                        "val": "DEMO KIT, BLASTING: Munition Array Charge, XM335"
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "R64003"
                                    },
                                    "Title": {
                                        "val": "HMDS - DEEP BURIED DETECTION"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "29.382"
                                        },
                                        "BudgetYearOne": {
                                            "val": "84.216"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "84.216"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "64.191"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "177.789"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Husky Mounted Detection System (HMDS) program is pursuing an acquisition approach that delivers capability increments - Increment A, Configuration 1 (A1) to the Warfighter by leveraging the Quick Reaction Capability (QRC) Ground Penetrating Radar (GPR) currently deployed in support of Operation Enduring Freedom (OEF) and Operation Inherent Resolve (OIR). In FY 2020, the program will complete execution of an Engineering Change Proposals (ECP) to add a wire detection capability to address evolving threat, and Infrared illumination to enable nighttime operation, improve operational availability of the HMDS during inclement weather and address obsolescence and Cyber Security deficiencies.\n\nThe Route Clearance & Interrogation System (RCIS) program executes an Engineering Manufacturing and Development (EMD) phase for Type I systems with an OEM contract award for Delta High Mobility Engineering Excavator (HMEE) support and a contract award  in 4th quarter of FY 2018 to one EMD contractor for the Semi-Autonomous Control (SAC) Kit . The SAC Kit was awarded based on a source selection from full and open competition.  The SAC EMD contract awardee will execute Preliminary Design Review (PDR), design, integration, and build phase of seven Semi-Autonomous Capability (SAC) kits, integrated onto six vehicles, with one kit available for engineering and System Integration Lab (SIL) evaluations.  These assets enable the Government to execute a full Pre-Production Qualification Test (PPQT) and to evaluate against Capability Production Document (CPD) and performance specification requirements. Production and Technical Data Package (TDP) procurement options on the EMD contract take advantage of competition to assist in cost reduction. The RCIS Type I program Lifecycle Cost Estimate (LCCE), and associated budget request, was updated based on costs associated with modifying the base HMEE platform to accept the SAC kit, changes in the acquisition strategy and alignment of development and test activities in support of a production decision. To support EMD, ALUGS is funding Reset\/Recap of four Buffalo Mine Protected Clearance Vehicle (MPCV) test assets at Letterkenny Army Depot. These will be provided to the SAC contractor for Operator Control Unit (OCU) integration.  \n\nThe Standoff Robotic Explosive Hazard Detection System (SREHD) (formerly known as AMDS) is currently in the Low Rate Initial Production (LRIP) phase to provide standoff detection, marking, and neutralization of explosive hazards (e.g., landmines, improvised explosive devices (IED), booby-traps (explosive), and unexploded ordnance (UXO)) in complex and urban terrain, including confined areas and subterranean environments (e.g., buildings, bunkers, tunnels, etc.). Transition to Low Rate Initial Production (LRIP) occurred 30 April 2018 under PAA E50510 \/ DEMO KIT, BLASTING: Munition Array Charge, XM335, for the neutralization capability, as well under OPA R68260 \/ AREA MINE DETECTION SYSTEM (AMDS) for the detection and marking capabilities.  Due to the realignment of funds beginning FY 2020 through FY 2024 to higher Army priorities, the proponent withdrew support to the Standoff Robotic Explosive Hazard Detection System (SREHD) after Low Rate Initial Production (LRIP) award.  Subsequently, the Milestone Decision Authority (MDA) directed that FY 2019 funding will not be executed for this program.  Due to timing, funding is still reflected in FY 2019.  Research, Development, Test and Evaluation (RDTE) tasks will conclude in FY 2019 under FY 2018 PE 0654808A, Project 415, Landmine Warfare\/Barrier - Eng Dev, once corrective action plans and trainer re-development are completed. The program will conclude in June 2020 under FY 2018 OPA R68260 \/ AREA MINE DETECTION SYSTEM (AMDS) and PAA E50510 \/ DEMO KIT, BLASTING: Munition Array Charge, XM335 for system qualification and production and receipt of LRIP quantities for an orderly program closeout.\n\nRobotic Explosive Hazard Detection System (REHDS) is a new start in FY 2021 and begins in the Engineering Manufacturing Development (EMD) phase.  REHDS will develop the capability to detect and mark explosive hazards from a robotic platform to deliver standoff capability to the warfighter. REHDS will leverage developed SREHDS capability and incorporate the following two changes: Increased Rate of Advanced Downtrack (RoAD) and Integration to Man Transportable Robotic System (MTRS) II platform. REHDS has planned efforts in FY 2022 and FY 2023; dollar amounts are $6.000 million and $7.000 million respectively. Plan to execute a sole source strategy utilizing the SREHD contractor as they have the ability to develop similar systems."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Due to the realignment of funds FY 2020-2024 to higher Army priorities, the proponent withdrew support to the Standoff Robotic Explosive Hazard Detection System (SREHD) after Low Rate Initial Production (LRIP) award.  Subsequently, the Milestone Decision Authority (MDA) directed that FY 2019 funding will not be executed for this program.  Due to timing, funding is still reflected in FY 2019.  Research, Development, Test and Evaluation (RDTE) tasks will conclude in FY 2019 under FY 2018 PE 0654808A, Project 415, Landmine Warfare\/Barrier - Eng Dev, once corrective action plans and trainer re-development are completed.  The program will conclude in June 2020 under FY 2018 OPA R68260 \/ AREA MINE DETECTION SYSTEM (AMDS) and PAA E50510 \/ DEMO KIT, BLASTING: Munition Array Charge, XM335 for system qualification and production and receipt of LRIP quantities for an orderly program closeout."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "HMDS System Engineering & Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Terrestrial Sensors"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Belvoir. VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.75"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.84"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.179"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.769"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management - RCIS Type I"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM FP"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.213"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.769"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.582"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SREHD (Formerly AMDS) Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JPEO A&A, PM CCS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.868"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.868"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SREHD (Formerly AMDS) Program Closeout"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JPEO A&A, PM CCS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.811"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.811"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.813"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.813"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "HMDS A1 Dev of Engineering Change Proposal w\/ Wire Detect and InfraRed"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Chemring Sensors & Electronic Systems (CSES)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dulles, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.437"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "15.223"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.821"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "25.481"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HMDS Auto-height improvements"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.634"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.634"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HMDS Systtems Training Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.892"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.696"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.588"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RCIS Type I"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "J C Bamford"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pooler, GA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.233"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.81"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.542"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.585"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RCIS Type I test assets"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Letterkenny Army Depot"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Letterkenny, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.252"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.252"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RCIS Type I SAC"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "QinetiQ"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Waltham, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.7"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.383"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Multi-Function Video Display"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NVESD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.972"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.047"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.519"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.047"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Buffalo MPCV Interrogation Arm Improvements"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "KRC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Houghton, MI"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.425"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.425"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SREHD (Formerly AMDS) EMD and Trainer Re-development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Carnegie Robotics LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pittsburgh, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "30.889"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "30.889"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SREHD (Formerly AMDS) RAMS Type B Integration with Trainer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Adelphi, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.3"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.300"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "HMDS - Program and Logistics Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.727"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.727"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RCIS Type I"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TARDEC, TACOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.588"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.768"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.332"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SREHD (Formerly AMDS)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.676"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "13.676"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Robotic Explosive Hazard Detection System"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CCDC - Picatinny"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.998"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.998"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.998"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "HMDS ATEC Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.045"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.717"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.936"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.698"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HMDS Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.892"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.433"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.325"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RCIS Type I"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.772"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.46"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.832"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.064"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SREHD (Formerly AMDS)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OTC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Hood, TX"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.341"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.341"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SREHD (Formerly AMDS)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Adelphi, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.1"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.100"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_415_0.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "5_415_1.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "5_415_2.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "HMDS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HMDS Increment A1 - MS C Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HMDS Increment A1-TC\/MR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HMDS Increment A1-FUE"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HMDS Increment A1-IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HMDS Increment A1 Award ECP for WD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HMDS Risk Reduction\/ECP"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HMDS Increment A1 w\/WD FUE"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HMDS Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCIS Type I"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCIS Type I MS B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCIS Type I EMD SAC Contract"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCIS Type I EMD Delta HMEE contract"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCIS Type I Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCIS Type I CDR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCIS Type I TRR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Standoff Robotic Explosive Hazard Detection System (SREHD) (Formerly AMDS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SREHD Regression Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SREHD Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SREHD Trainer Re-development Contract Modification"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SREHD Low Rate Initial Production (LRIP) Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SREHD Trainer Re-development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SREHD Corrective Action Period (CAP)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SREHD FAT Build"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SREHD Product Verification Test (PVT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SREHD First Article Test (FAT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SREHD LRIP Build"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SREHD LRIP Deliveries"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Robotic Explosive Hazard Detection System (REHDS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop\/award REHDS Contract"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MDD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Integration Engineering"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Risk Reduction Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Protytype build"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Product Qualification Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MS C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Production Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}