{
    "id": "2021-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-2716d21dbc896f45f0ab55d1cbc64884530e2bcd27618d8f0e40b216a43f556d-6",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602715E"
        },
        "ProgramElementTitle": {
            "val": "MATERIALS AND BIOLOGICAL TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "192.774"
            },
            "CurrentYear": {
                "val": "214.976"
            },
            "BudgetYearOne": {
                "val": "250.107"
            },
            "BudgetYearOneBase": {
                "val": "250.107"
            },
            "BudgetYearTwo": {
                "val": "245.748"
            },
            "BudgetYearThree": {
                "val": "263.598"
            },
            "BudgetYearFour": {
                "val": "290.037"
            },
            "BudgetYearFive": {
                "val": "308.873"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Materials and Biological Technology Program Element is budgeted in the Applied Research Budget Activity because its objective is to develop materials and biological technologies that make possible a wide range of new military capabilities.\n\nThe major goal of the Materials Processing Technology project is to develop novel materials, fabrication and processing techniques, models, devices and components that will lower the cost, increase the performance, and\/or enable new missions for military platforms and systems.  Included in this project are efforts across a wide range of technology areas including manufacturing, electronics, sensors, optics, and complex and autonomous systems.\n\nThe Biologically Based Materials and Devices project will leverage the growing application space of the biological sciences for the development of new DoD capabilities in materials development, threat detection, and warfighter performance.  Contained in this project are thrusts that apply biology's unique synthesis capabilities to source DoD-relevant materials and overcome current limitations in accessing, scaling, and distributing critical resources to achieve overmatch.  Programs in this project also enable in situ and stand-off detection and mitigation of biological, chemical, traditional, and emerging threats against the warfighter, the food supply, and other targets.  This project also includes efforts to develop novel biological technologies for maintaining human combat performance."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "208.898"
                },
                "CurrentYear": {
                    "val": "223.976"
                },
                "BudgetYearOne": {
                    "val": "245.397"
                },
                "BudgetYearOneBase": {
                    "val": "245.397"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "192.774"
                },
                "CurrentYear": {
                    "val": "214.976"
                },
                "BudgetYearOne": {
                    "val": "250.107"
                },
                "BudgetYearOneBase": {
                    "val": "250.107"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-16.124"
                },
                "CurrentYear": {
                    "val": "-9.000"
                },
                "BudgetYearOne": {
                    "val": "4.710"
                },
                "BudgetYearOneBase": {
                    "val": "4.710"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-9.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-4.099"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-12.025"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.710"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.710"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019:  Decrease reflects reprogrammings and the SBIR\/STTR transfer.\nFY 2020:  Decrease reflects congressional reduction.\nFY 2021:  Increase reflects minor program repricing."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MBT-01"
                    },
                    "ProjectTitle": {
                        "val": "MATERIALS PROCESSING TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "86.508"
                        },
                        "CurrentYear": {
                            "val": "100.803"
                        },
                        "BudgetYearOne": {
                            "val": "100.041"
                        },
                        "BudgetYearOneBase": {
                            "val": "100.041"
                        },
                        "BudgetYearTwo": {
                            "val": "102.122"
                        },
                        "BudgetYearThree": {
                            "val": "123.993"
                        },
                        "BudgetYearFour": {
                            "val": "149.593"
                        },
                        "BudgetYearFive": {
                            "val": "153.199"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The major goal of the Materials Processing Technology project is to develop novel materials, fabrication and processing techniques, models, devices and components that will lower the cost, increase the performance, and\/or enable new missions for military platforms and systems.  Included in this project are efforts across a wide range of technology areas including manufacturing, electronics, sensors, optics, and complex and autonomous systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Scale Modeling"
                                    },
                                    "Description": {
                                        "val": "The Multi-Scale Modeling thrust is developing advanced, multi-physics models that can predict the effect of disturbances and\/or perturbations in the space environment in order to inform operational decisions based on current space environment conditions.  Current space environment models are limited to predicting long term climatic averages or regularly occurring phenomena and do not fully account for coupling effects where perturbations in one region of the space environment may produce disturbances in another region.  Approaches for addressing these limitations under the Multi-Scale Modeling thrust include the following:  (1) development of observation driven\/first-principles theory of magnetosphere-ionosphere-thermosphere coupling; (2) creation of an extensible assimilation framework for unifying space environment monitoring systems and data; and (3) non-traditional space environment measurement approaches.  These developments will ensure the accuracy and spatiotemporal resolution of space weather models and is sufficient to enable prediction of operationally relevant perturbations and disturbances in the space environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.208"
                                            },
                                            "Text": {
                                                "val": "-  Initiated efforts to explore advanced methods and tools, such as hybridized particle\/fluid methods, adaptive mesh computational techniques, and vector processing, to extend capabilities of state-of-the-art \"nowcast\" space weather predictions.\n-  Initiated efforts to develop fully coupled space environment model suite capable of assimilating high resolution 4D data (observed and synthetic).\n-  Initiated development of an extensible framework to unify traditional and non-traditional ionospheric measurements, both terrestrial and in-situ."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-   Implement promising approaches that dynamically utilize computational architectures (adaptive meshes, vector processing and cloud architecture) to increase space weather prediction forecast accuracy out to 72 hours. \n-   Demonstrate in simulation the ability to predict and track space weather phenomena with scale lengths as small as one hundred kilometers.\n-   Implement and demonstrate an extensible 4D assimilation data framework, incorporating visualization and machine learning algorithms, capable of processing data sources from at least two major space environment observations networks in less than fifteen minutes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.500"
                                            },
                                            "Text": {
                                                "val": "-  Using actual atmospheric event data, demonstrate the ability to predict perturbations and disturbances within lengths on the order of 100 km within 72-hour window.\n-  Demonstrate the capability of plasma physics models to simulate wave\/particle interactions necessary to inform understanding of electron depletion by electromagnetic (EM) waves."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects transition from heavy system development to testing and demonstrations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Functional Materials and Devices"
                                    },
                                    "Description": {
                                        "val": "The Functional Materials and Devices thrust is developing advanced materials, components and systems to improve device performance for DoD sensing, imaging and communication applications.  One focus of this thrust involves development of advanced transductional materials that convert one form of energy to another for DoD-relevant applications in areas such as thermoelectrics.  While promising transduction materials are known for a variety of applications, integration into devices has not been realized.  Another focus area is the development of physics based models that predict material behavior when illuminated by high peak power electromagnetic interference.  A third focus area involves development of new multi-functional materials and device designs that will radically decrease the size, weight and power requirements of neutron and gamma sources for high-resolution neutron, gamma and x-ray imaging.  Such devices should enable fieldable detection units for non-destructive evaluation of parts, detection of explosives and other DoD-relevant targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.300"
                                            },
                                            "Text": {
                                                "val": "-  Optimized key design parameters as a function of synthesis conditions in order to fabricate textured ceramics for underwater transducer array applications.  \n-  Delivered test results on textured ceramic materials of different shapes and sizes leading to the first round of the validation of high power performance used to design long-range transducer performance. \n-  Performed final integrated compact neutron source prototype testing.\n-  Initiated exploration of innovative concepts for intense, transportable, mono-energetic gamma-ray sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.652"
                                            },
                                            "Text": {
                                                "val": "-  Initiate development of prototype test beds for transportable gamma ray sources that feature high intensity, tunability, and narrow bandwidth.\n-  Conduct initial component and system modeling efforts to support realization of prototype test beds for high intensity, narrow band-width, and high-energy, modest intensity gamma-ray sources.\n-  Identify and develop component technologies with potential for enabling intense, tunable, mono-energetic gamma-ray sources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.250"
                                            },
                                            "Text": {
                                                "val": "-  Refine compact gamma-ray source component technology designs and plan for integration of component technologies into compact, mono-energetic gamma-ray source prototypes.\n-  Mature component and system modeling efforts to support realization of prototype test beds for intense, transportable, mono-energetic gamma-ray sources.\n-  Explore the potential for improved precision and accuracy in hybrid classical\/quantum sensors that exploit a new class of high quality mechanical resonators that can be coherently manipulated at room temperature.\n-  Develop algorithms for quantum sensing that significantly outperform current classical methods."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 program increase reflects transition from component development to program integration and testing phases."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Chemical Processing for Force Protection"
                                    },
                                    "Description": {
                                        "val": "Research in this thrust is focused on the development of new chemical approaches and technologies across a broad spectrum of DoD needs.  One area involves development of innovative approaches for scalable small molecule synthesis coupled with predictive tools for route design, possibly offering a new strategy to discover how to make new molecules such as pharmaceuticals and explosives.  Another focus combines existing strategies for destruction of chemical agents with development of new processing methods to provide a remediation system that can process any chemical agent at the site of storage.  In addition, investments in this thrust will advance chemical characterization, information management and analysis, and automation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated the automated production of a library of molecular analogues on a single system.\n- Adapted synthesis of high value molecules to low cost, portable chemical reactors for distributed manufacturing. \n-  Performed analysis of synthetic capabilities for existing modules that outlined the potential suite of molecules that can be generated in the automated device.\n-  Demonstrated rapid search of reaction conditions (1,000s of reactions per hour) and initiated integration of these data into route design algorithms.\n-  Built first-generation chemical agent destruction prototype with modified diesel engine and acid-gas exhaust remediation system.\n-  Initiated testing of chemical agent destruction prototype with chemical agent simulants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.501"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate continuous flow synthesis of a molecule requiring a convergent approach (e.g., synthesis and subsequent combination of two intermediates).  \n-  Demonstrate full integration of molecular chemistry software and hardware, including route planning, system configuration, and molecular synthesis.\n-  Initiate efforts to leverage new tools such as molecular discovery software, continuous flow reactors, and high throughput screening platforms for developing advanced energetic molecules and formulations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop standardized protocols for conducting energetic-relevant experimentation using minimal quantities of energetic compounds.\n-  Demonstrate, through modeling and simulations, scalability of approaches that consider final formulation for energetic ingredient development.\n-  Leverage new energetic synthesis pathways to initiate development of advanced energetic formulations for one or more DoD relevant applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Accelerating Discovery and Innovation"
                                    },
                                    "Description": {
                                        "val": "The Accelerating Discovery and Innovation thrust is developing new approaches, tools and technologies to speed the pace of scientific discoveries and technological innovations from idea generation and fundamental research through integration of technologies into fieldable products and systems in production.  The path from idea generation to a discovery is a lengthy, complex process involving many unpredictable steps, cycles and stages across fundamental and applied research and development.  Research in this thrust is focused on developing and implementing strategies to address many of the challenges and bottlenecks inherent along this path and to speed the rate at which an idea can be advanced into a concrete capability.  Specific approaches include advanced multiplayer gaming technologies to catalyze development of new technology concepts, development of tools for data collection and visualization to accelerate fundamental and applied research, and strategies to understand how seemingly benign commercially available technologies may be converted or combined into threats to military operations, equipment or personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed software tools to facilitate an analytic multi-disciplinary conversation to facilitate the collective understanding and potential implications of emerging science and technology.\n-  Developed software systems to aid in identifying emerging science and technology concepts and applications based on existing understanding.\n-  Designed and built additional sets of interoperable kits for military applications from easily obtainable components with instructions and parts listed stored on a technology exchange website.\n-  Designed and built a highly capable reconnaissance-strike system that integrates the interoperable kits, with instructions and parts lists stored on a technology exchange website.\n-  Tested the reconnaissance-strike system(s) with military partners.\n-  Investigated the understanding of what enables projected animations to be perceived as real."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.800"
                                            },
                                            "Text": {
                                                "val": "-  Create and evaluate software tools to expedite the synthesis of multi-disciplinary conversations about emerging science and technology into evidence supported research proposals.\n-  Develop and evaluate tools that allow for incorporation of the needs of research and development requirement generators with the capabilities of research and development performers.\n-  Develop new features for the technology exchange website for the transition partner, the Marine Corps."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.300"
                                            },
                                            "Text": {
                                                "val": "-  Apply and evaluate online, multi-platform structured conversation tools to rapidly identify evidence-based development opportunities.\n-  Employ and evaluate online conversation tools to expedite the identification, vetting, and funding of research ideas."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY2021 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials for Extreme Environments*"
                                    },
                                    "Description": {
                                        "val": "*Previously part of Materials Processing and Manufacturing.\n\nThe Materials for Extreme Environments thrust is exploring new materials, materials architectures, and materials development processes that will significantly enhance the performance and persistence of DoD platforms operating in extremely harsh environments.  Materials with superior strength, functionality, and resiliency are critical for enabling DoD platforms, weapons and other components to operate and persist under conditions including, but not limited to, extremely high or low temperatures, turbulence, ionizing radiation, and\/or corrosive environments.  Recent developments in materials such as architected materials, high entropy alloys, and carbon fiber composites hold promise for achieving material solutions for improved survivability in a wide range of harsh environment conditions.  Similarly, advancements in material design, processing and manufacturing are enabling novel material architectures that can further enhance performance and resilience in structures such as leading edges, windows and apertures, propulsion systems, and space structures.  Building on technologies developed under the Materials Processing and Manufacturing program, also in this Program Element, exemplar areas of research within the Materials for Extreme Environments thrust include the following:  1) high temperature materials for hypersonic platforms; 2) high temperature window and aperture materials; 3) radiation and\/or electromagnetic pulse (EMP) hardened electronics for space platforms; and 4) coatings for platform survivability in corrosive environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiated development of new models for improved understanding of physical, chemical and mechanical properties of high entropy materials in hypersonic environments.\n-  Identified new processing approaches for manufacturing high temperature materials in large and\/or complex shapes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.200"
                                            },
                                            "Text": {
                                                "val": "-  Explore approaches that leverage new architected materials and computational tools to fabricate complex structures that reduce heat load and enhance platform survivability in harsh environments.\n-  Leverage recent breakthroughs in metrology to characterize atomic- through meso-scale materials behaviors.\n-  Develop model guided testing tools to validate the behavior of new materials under extreme environmental conditions.\n-  Evaluate technical approaches for mitigating thermal-optical interference in high temperature apertures.\n-  Identify materials that are amenable to manufacture in the space environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "36.991"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "36.991"
                                            },
                                            "Text": {
                                                "val": "-  Investigate mechanical\/physical\/chemical properties of high entropy alloys for applications in extreme environments.\n-  Conduct arc-jet testing on architected material coupons to quantify material performance.\n-  Identify material approaches to enable operational Infrared\/Radio Frequency (IR\/RF) performance at temperatures characteristic of hypersonic flight.\n-  Develop models to predict operational impact of improved radome materials.\n-  Identify technologies such as friction stir extrusion or robotic self-assembly, that can be modified for zero gravity operation.\n-  Identify metrology approaches to enable more precise assembly of structures in space."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects a shift from design to development and testing phases."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Reconfigurable Systems"
                                    },
                                    "Description": {
                                        "val": "In the Reconfigurable Systems thrust, new approaches are being developed to enable more rapid and robust adaptation of defense systems and systems-of-systems to changing mission requirements and unpredictable environments.  This includes development of capabilities across sensing, perception, planning and control for autonomous, high-speed operation in cluttered environments without Global Positioning System (GPS) information.  This also includes development of capabilities to manipulate and control adversary sensory perception and\/or situational awareness.  Additional work in this thrust focuses on how sensing systems and military systems-of-systems are designed for real-time resilient response to dynamic, unexpected signals and contingencies.  Research is developing a more unified view of system behavior that allows better understanding and exploitation of complex interactions among components, including development of formal mathematical approaches to complex adaptive system composition and design.  These capabilities will impact autonomous systems and systems-of-systems, including those that involve humans, in a variety of DoD-relevant contexts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed capability for self-diagnosis of current system performance from arbitrary set of sensors, behaviors, and constraints.\n-  Demonstrated closed-loop single functional recomposition from a set of sub-system components. \n-  Demonstrated redesign of system function to attrition and environmental change."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.650"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate redesign of coordinated functions to achieve maximum resilience.\n-  Demonstrate dynamic adaptive response to achieve system re-design.\n-  Demonstrate system design for adaptive response to a co-evolving threat coupled to attrition and environment change."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY2021 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials Processing and Manufacturing"
                                    },
                                    "Description": {
                                        "val": "The Materials Processing and Manufacturing thrust is exploring new manufacturing and processing approaches that will dramatically lower the cost and decrease the time required to fabricate DoD parts and systems.  Constantly changing specifications for DoD platforms combined with recent manufacturing advances, such as 3D printing and manufacture on demand, drive a need for greater efficiency in development and design cycles as well as scalable and reconfigurable manufacturing processes that incorporate advanced materials with superior properties.  Research within the Materials Processing and Manufacturing thrust is focused on achieving the following capability objectives:  (1) scalable processes to assemble fully 3D devices that include nanometer- to micron-scale components; (2) processes that yield new materials, materials capabilities and parts that cannot be made through conventional processing approaches; (3) efficient, low volume manufacturing; (4) approaches that reduce manufacturing complexity through new material feedstock formats with reconfigurable processing techniques; and (5) material processing that enhances platform survivability in extreme environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated pilot-scale production of tailorable, high-performance carbon fiber-based feedstock that meets or exceeds state-of-the-art aerospace materials capability.\n-  Reduced time and complexity to form complex curvature composite part from multiple days to two parts per day leveraging new forming techniques.\n-  Demonstrated methods for the scale-up of specific nano- and micro-assembly techniques for optical nanoparticles, biological nanofibers and surface-agnostic adhesives to DoD-application relevant sizes (cm-scale).\n-  Tested and evaluated retention of nanoscale properties when assembly process is scaled-up."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate that a multifunctional element can be incorporated into the feedstock while maintaining performance.\n-  Leverage advanced modeling tools to identify ideal use case for new composite materials and processing parameters."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MBT-02"
                    },
                    "ProjectTitle": {
                        "val": "BIOLOGICALLY BASED MATERIALS AND DEVICES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "106.266"
                        },
                        "CurrentYear": {
                            "val": "114.173"
                        },
                        "BudgetYearOne": {
                            "val": "150.066"
                        },
                        "BudgetYearOneBase": {
                            "val": "150.066"
                        },
                        "BudgetYearTwo": {
                            "val": "143.626"
                        },
                        "BudgetYearThree": {
                            "val": "139.605"
                        },
                        "BudgetYearFour": {
                            "val": "140.444"
                        },
                        "BudgetYearFive": {
                            "val": "155.674"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Biologically Based Materials and Devices project will leverage the growing application space of the biological sciences for the development of new DoD capabilities in materials development, threat detection, and warfighter performance.  Contained in this project are thrusts that apply biology's unique synthesis capabilities to source DoD-relevant materials and overcome current limitations in accessing, scaling, and distributing critical resources to achieve overmatch.  Programs in this project also enable in situ and stand-off detection and mitigation of biological, chemical, traditional, and emerging threats against the warfighter, the food supply, and other targets.  This project also includes efforts to develop novel biological technologies for maintaining human combat performance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defend Against Crop System Attack"
                                    },
                                    "Description": {
                                        "val": "The Defend Against Crop System Attack program is developing a platform technology aimed at increasing the speed of DoD response to state or non-state actor release of biological threats directed at our crop systems. Conventional methods to defend against these threats are generally slow and ineffective.  This program will leverage recent advances in molecular and synthetic biology to enable rapid delivery of gene therapies to plants for large-scale trait modification, improving resilience against adversary attack or emerging natural threats.  Research within this program will develop an agnostic, scalable capability for protecting entire crop systems from emerging threats posed to food security by U.S. adversaries."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.424"
                                            },
                                            "Text": {
                                                "val": "-  Scaled deployment of flexible plant transformation platforms in a controlled greenhouse setting.\n-  Initiated integration of novel and existing failsafe capabilities for the trait delivery platform.\n-  Investigated new approaches to increase the efficacy of genetic transmission.\n-  Demonstrated predictable and repeatable transmission of genetic materials to plants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.718"
                                            },
                                            "Text": {
                                                "val": "-  Ensure two week-long stable viral transformation resulting in gene-based protection in plant target.\n-  Determine adequate virus concentration to achieve adult plant transformation.\n-  Perform risk mitigation of potential delivery challenges within complex laboratory environments.\n-  Integrate virus delivery approach to achieve adult plant transformation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.498"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.498"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate successful delivery of a virus carrying multiple genes for downstream plant trait modification.\n-  Demonstrate insect dispersal to targeted plants in a diverse plant community without transmission to non-target plants in a contained environment.\n-  Employ multi-faceted conditional lethal approach to limit survival of vector insects."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects a reduction in initial proof-of-concept research activities to progress toward final integrated system demonstrations at scale."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Terrestrial Living Sensors"
                                    },
                                    "Description": {
                                        "val": "The Persistent Terrestrial Living Sensors program is developing engineered biological sensor platforms capable of detecting land-based threats (e.g., chemicals, radiation, explosives) and relaying unique signals to existing DoD ground, air, and space assets.  Unlike conventional methods that passively monitor threats and are limited by sensor energy needs, these biological sensors are effectively energy independent, increasing the potential for wide distribution and environmental robustness.  Resulting platforms developed within this program will enable a variety of remote, persistent monitoring and reporting capabilities to address threat scenarios relevant for national security, including detecting improvised explosive devices (IEDs) and protecting infrastructure.  These sensors will provide a flexible suite to complement conventional sensor systems within the DoD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.988"
                                            },
                                            "Text": {
                                                "val": "-  Developed a quantitative model to guide plant-based sensor resilience and environment flexibility.\n-  Demonstrated the feasibility of combining high-specificity detection traits with physiological response traits by first exploring plant cell expression and quantitative modeling, and then by altering the physiology of plants.\n-  Began production of plants with individual sense and report traits.\n-  Investigated methods to use soil-based microorganisms to sense subterranean events and propagate signals to the soil surface."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.174"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate genetic modification of plant-expressed sensory proteins associated with DoD-relevant compounds.\n-  Demonstrate genetic modification of plant-expressed reporting signals at detectable levels.\n-  Identify internal plant resource issues that will have to be addressed to develop a real-world detection platform.\n-  Identify external biotic and abiotic challenges that need to be addressed to avoid practical use of plants as sensors.\n-  Test methods for stand-off detection of signals produced by microorganisms in response to subterranean sensing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.525"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.525"
                                            },
                                            "Text": {
                                                "val": "-  Integrate plant platform to align threat detection with plant resource and ecology traits.\n-  Demonstrate the capability of stress resistant plants to sense and detect threats at stand-off.  \n-  Develop a simulated environment containing co-occurring plant, insect, and microbial species representing realistic competitive, predator, parasitic, and mutualistic interactions.\n-  Demonstrate the adaptability to grow plants in multiple simulated environments under realistic environmental stressors."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Preemptive Expression of Protective Alleles (PREPARE)"
                                    },
                                    "Description": {
                                        "val": "The Preemptive Expression of Protective Alleles (PREPARE) program is creating a transient, near immediate prophylaxis to protect military personnel and civilians against public health and national security threats.  Currently, protection against Chemical, Biological, Radiological, and Nuclear (CBRN) threats relies on physical barrier technology.  This program includes research to develop novel transient and reversible gene modulator therapies to bolster intrinsic host defenses.  Work within this project will provide novel solutions that extend beyond the DoD's limited protective capabilities to respond to re-emerging, newly emerging, or engineered threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.118"
                                            },
                                            "Text": {
                                                "val": "-  Began development of bioinformatics tools and validation methods that will improve the design and specificity of transient gene therapy strategies.\n-  Began identification of genetic targets that form the basis for cellular stress resistance to chemical, biological, and radiological\/nuclear (CBRN) threats in vitro.\n-  Initiated study of effective delivery tools for gene modulators that enable protection against threats.\n-  Began to characterize specificity of transient gene therapy in animal models.\n-  Initiated development of programmable gene-modulators as platform capabilities for scalable and adaptable threat response platform.\n-  Demonstrated effectiveness of programmable gene modulation to counter specific threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.097"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate multiplexed targeting of cellular resistance genes to resist multiple threats.\n-  Demonstrate and optimize specificity and duration of modulation of gene modulators in animal models.\n-  Optimize delivery tool specificity for gene modulators in vitro.\n-  Begin demonstration of target-agnostic platform that can address multiple threats using a common set of gene modulation and delivery components.\n-  Investigate timing of optimal countermeasure administration to maximize therapeutic and prophylactic performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.899"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.899"
                                            },
                                            "Text": {
                                                "val": "-  Establish Target Product Profile (TPP) to guide initial regulatory discussions and inform preclinical studies to determine efficacy of programmable gene modulator based medical countermeasures against Chemical, Biological, Radiological and Nuclear (CBRN) threats. \n-  Determine optimal delivery formulations to deliver programmable gene modulators in vivo to appropriate cells and tissues with high specificity and for threat-relevant periods of time.\n-  Demonstrate and optimize specificity to targets and duration and magnitude of modulation of programmable gene modulators in vivo.\n-  Demonstrate effectiveness of programmable gene modulator platform to protect against a biological, radiological, or chemical threat in vivo."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Aquatic Living Sensors"
                                    },
                                    "Description": {
                                        "val": "The Persistent Aquatic Living Sensors program is developing novel capabilities to sense and surveil submersibles (e.g., submarines, unmanned underwater vehicles) and divers in littoral waters using living organisms present in the environment.  This effort focuses on characterizing marine biological behavior in response to targets of interest and developing the hardware, software, and algorithms that will translate organism behavior into DoD actionable information.  By harnessing the unique capabilities of biology, including adaptation, response, and replication, work in this program will enable persistent dominance in contested waters.  Results from this research will enhance security for maritime activities and provide DoD naval operations with new sensing paradigms to complement current sensor technologies used in traditionally challenging regions across the world."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.204"
                                            },
                                            "Text": {
                                                "val": "-  Investigated organism response to targets of interest in a laboratory environment using benchtop instrumentation.\n-  Initiated research to convert organism response into robust sensing system by developing algorithms to classify organism response in relation to targets.\n-  Researched new reporting schemes to communicate signal detection and actionable information to existing DoD systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.066"
                                            },
                                            "Text": {
                                                "val": "-  Characterize biological responses to targets and confounders at greater distances and in more realistic environments.\n-  Investigate approaches to evoke biological responses in marine organisms.\n-  Harden engineered components for persistent deployments.\n-  Develop fully integrated seaworthy prototype combining biology and engineered components.\n-  Develop hardware and software to detect and classify targets and confounders in ecosystem-style aquaria or open waters, analyze results, and produce alerts via satellite link."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.720"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.720"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate approaches to evoke biological responses in marine organisms.\n-  Characterize operational utility of biological responses in multiple environments.\n-  Demonstrate biological responses to targets and confounders in more realistic environments, with greater discrimination fidelity.\n-  Perform field experiments to characterize maximum sensory and response propagation distances of biological organisms.\n-  Demonstrate full end-to-end system capability in near shore environments for detection, processing, and near real-time alerting to presence of manned or unmanned vehicles via seaworthy prototype."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Genome Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "The Genome Protection Technologies program is developing advances in critical efforts to generate a biodefense capability to control, counter, and reverse the effects of accidental or malicious misuse of gene editing technologies.  This research will investigate new approaches for developing tunable controls to enable the safe and predictable use of synthetic genes and pathways.  Additional work will develop protecting measures to prevent or limit unintended genome editing or engineering and develop new tools to recall or reverse engineered changes.  Advances within this program will ensure that the U.S. remains at the vanguard of this now widespread, rapidly advancing field that poses potential national security threats due to the large-scale democratization of gene editing technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.762"
                                            },
                                            "Text": {
                                                "val": "-  Conducted testing in animal models for safety and efficacy of small molecule and genetic countermeasures.\n-  Used computational models to evaluate efficacy, stability, and fitness of gene editing controllers and countermeasures.\n-  Demonstrated efficacy, stability, and fitness of gene editing controllers and countermeasures in animal models.\n-  Characterized failure modes of gene editor controllers and countermeasures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.150"
                                            },
                                            "Text": {
                                                "val": "-  Conduct advanced in vivo testing of genome editors to include characterization of off-target effects, failure modes, target editing efficiency, and stability.\n-  Design safety measures and characterize toxicity and immunogenicity of genome editors.\n-  Determine safety and efficacy and characterize off-target effects of genome editor countermeasure candidates in vivo.\n-  Incorporate empirical data such as gene flow, fitness, generational stability, and failure modes into advanced computational models.\n-  Demonstrate the ability to revert or eliminate target genes in organisms in laboratory environments.\n-  Begin development of tools for measurement of genomic sequence targets that provide sufficient coverage of genomic diversity, while also enabling single-nucleotide level specificity.\n-  Begin development of gene editing based detection technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.603"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.603"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate efficient and specific target gene removal in vivo within a simulated natural environment.\n-  Demonstrate safe, specific, stable, and highly-efficient genome editors and controllers in vivo for therapeutic applications.\n-  Demonstrate effective and safe application of genome editing inhibitors in vivo."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Expanding Human Resiliency"
                                    },
                                    "Description": {
                                        "val": "The Expanding Human Resiliency program aims to maximize warfighter resiliency by leveraging the signals of the human microbiome to improve physiology. This program will develop new technologies to control and manipulate the microbiome (e.g., to reduce attraction and feeding of disease vectors such as mosquitoes).  Current state-of-the-art approaches are focused on metagenomics to inventory and categorize the microbes in a given sample. In order to have more precise and on-demand control of microbiomes, technologies will be developed to elucidate the complex interactions between the microorganisms and their host as well as the interactions between consortia of adapted and evolved microorganisms.  Advances in this area will both develop novel technologies to interrogate complex microbial communities in human systems and discover ways to beneficially harness microbiomes to expand warfighter resiliency."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.425"
                                            },
                                            "Text": {
                                                "val": "-  Investigate ways to improve methods for interpretation and prediction of microbial interactions.\n-  Initiate testing of methods to alter chemical production by microbiomes.\n-  Begin longitudinal studies to track microbial interactions with changes in the microbiome.\n-  Begin development of initial microbiome modulation approaches."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.500"
                                            },
                                            "Text": {
                                                "val": "-  Test methods in vitro to alter chemical production by microbiomes and validate that alterations reduce attraction and feeding of mosquitoes or other disease vectors.\n-  Initiate in vivo testing of methods to alter chemical production by microbiomes.\n-  Investigate methods to deliver interventions to skin for altering chemical production by the microbiome.\n-  Investigate methods to improve physical and computational models of microbiomes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Restoring Cognitive Capability"
                                    },
                                    "Description": {
                                        "val": "The Restoring Cognitive Capability program, building upon efforts initiated in the Enhancing Neuroplasticity program also budgeted in this PE and Project, will develop novel drugs to provide rapid therapy for neuropsychiatric disorders experienced by warfighters and veterans.  Active duty military personnel face increased risk of acute and chronic neuropsychiatric dysfunction, limiting day-to-day function and return to duty.  Current therapeutic approaches for many neuropsychiatric disorders (e.g., Post Traumatic Stress Disorder [PTSD], mood disorders, and substance abuse) rely on individual management with integrated psychiatric therapy and medication.  However, most interventions approved for use in these conditions lack long-term efficacy, involve a logistical burden of treatment and\/or carry a risk of serious adverse side effects.  The Restoring Cognitive Capability program will develop and test novel drug chemotypes designed to functionally interact with neuronal receptor subtypes known to play a role in these neuropsychiatric conditions, with the aim of enabling fast-acting and effective alleviation of neuropsychiatric dysfunction with single or minimal doses."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.750"
                                            },
                                            "Text": {
                                                "val": "-  Identify structure-guided design principles for chemotype interactions with receptor subtype.\n-  Identify model systems for in vivo functional validation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.178"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.178"
                                            },
                                            "Text": {
                                                "val": "-  Develop pipeline for design and synthesis of novel molecules.  \n-  Develop novel biosensors for assessment of drug uptake and distribution.\n-  Begin assembly and validation of behavioral bioassays.\n-  Begin in vitro functional testing of novel molecules."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects initiation of biosensor development for assessment of drug uptake and distribution and phenotypic effects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Food and Feedstocks on Demand"
                                    },
                                    "Description": {
                                        "val": "The Food and Feedstocks on Demand program, building upon research conducted in the Living Foundries program also budgeted in this PE and Project, will develop biological technologies to support the DoD need to strengthen local resource security for the warfighter. Currently, operators in the field are burdened with transport and disposal of single-use materials. This program will use these burdensome materials as inputs and re-form the molecules for nutrition or other strategic applications. Research in this program will provide a versatile system that delivers food, water, and petroleum\/oils\/lubricants (POLs) so that warfighters can independently produce material support to extend mission duration and\/or expand operational flexibility in resource-limited environments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.250"
                                            },
                                            "Text": {
                                                "val": "-  Investigate the ability for controllable, predictable microorganisms co-occurring in a consortia to alter the composition of chemical compounds.\n-  Examine varied biological, chemical, and combinatorial approaches to breakdown waste for reuse."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.053"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.053"
                                            },
                                            "Text": {
                                                "val": "-  Design a prototype system to maximize the use of military waste for desired products.\n-  Design chemical, biochemical, and biological treatments, and combinatorial processes to complement the deconstruction of waste in military operation scenarios.\n-  Optimize the process for strategic material generation starting from increasingly complex mixtures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects the integration of system components for conversion of waste at scale."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unburdening the Warfighter from Chemical\/Biological (CB) Defense"
                                    },
                                    "Description": {
                                        "val": "The Unburdening the Warfighter from Chemical\/Biological (CB) Defense program aims to increase warfighter survivability by developing improved personal protective equipment (PPE) strategies for CB attacks. Current methods of CB protection require significant logistical burdens, including suits that are bulky and hot, which limit operational capability. These burdens increase if an increased level of protection is required. The Unburdening the Warfighter from CB Defense program will investigate and design novel biological and material approaches that provide rapid protection against multiple agents for the warfighter. This research will innovate PPE through the discovery of compounds and lightweight, durable systems designed to capture, neutralize, or repel CB agents. This novel approach will provide almost immediate and lasting protection even in austere operational settings."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.040"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.040"
                                            },
                                            "Text": {
                                                "val": "-  Investigate approaches such as special coatings, enzymes, biological, or other active components that can provide agent neutralization or decontamination.\n-  Initiate development of novel components, including biomolecules to provide skin, airway and ocular protection from threats, minimizing the need for external protective equipment.\n-  Investigate formulations and delivery methods to provide the warfighter with biological systems capable of mitigating threats.\n-  Determine duration of protection provided by system components in mission-relevant operating environments and concept of operations (CONOPS)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gene Editing Enabled Diagnostics & Biosurveillance"
                                    },
                                    "Description": {
                                        "val": "The Gene Editing Enabled Diagnostics & Biosurveillance program will develop fieldable, low-cost gene editing-based diagnostics capabilities for rapid, specific, sensitive, and multiplexed detection of biological threats in military and public health scenarios. This program will investigate the design rules for diagnostic and biosurveillance targets to achieve broad-spectrum detection with high confidence diagnostic results. These design rules will inform advanced computational and machine learning approaches to scan genome data and algorithmically design probes and guides for optimal assay results. Additional work will develop assay architectures, reagents, and detection platforms to enable field-forward diagnostics at the point-of-care with the same sensitivity, and reliability tests conducted in hospital\/central laboratories."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.550"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.550"
                                            },
                                            "Text": {
                                                "val": "-  Begin to develop assays with multiplexed, clinically or environmentally relevant levels of detection sensitivity.\n-  Investigate robust and reproducible detection in clinically or environmentally relevant sample matrices.\n-  Refine computational design tools to inform the design and function of optimal diagnostic and biosurveillance assays.\n-  Characterize failure modes of design and detection technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Atmospheric Water Extraction (AWE)"
                                    },
                                    "Description": {
                                        "val": "The Atmospheric Water Extraction program aims to leverage new materials and advanced engineering and manufacturing techniques to extract potable water directly from the atmosphere. Currently, the DoD relies on purification of existing water sources and\/or distribution of bottled or treated water to provide the warfighter with sufficient daily hydration. This program will develop the technology to provide potable water on-site without the need for an external water supply and will do so with size, weight, power, and water output requirements tailored to the needs of the individual warfighter, as well as larger groups (e.g., Humanitarian and Disaster Relief [HADR] missions). The ability to liberate the warfighter from the water supply chain through the technology developed by this program will provide strategic and tactical advantages aligned with the DoD shift to more distributed and self-sustaining forces."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.500"
                                            },
                                            "Text": {
                                                "val": "-  Begin development and optimization of sorbent materials with properties tailored to low-powered and rapid water capture and release.\n-  Develop a component-level system-model for an engineered water extraction device.\n-  Initiate fabrication of components of modeled water extraction device."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhancing Neuroplasticity"
                                    },
                                    "Description": {
                                        "val": "The DoD needs tools to rapidly and effectively train military personnel in multifaceted and complex tasks.  The Enhancing Neuroplasticity program is exploring and developing peripheral nerve stimulation methods and non-invasive devices to promote synaptic plasticity for improved learning paradigms.  Key advances anticipated from this research will both create an anatomical and functional map of the underlying biological circuitry that mediates plasticity and optimize stimulation and training protocols to enable long-term retention for military personnel.  Once successfully identified, the underlying mechanisms of targeted plasticity training can be applied to a broad range of cognitive skill training within the DoD, including foreign language learning, or data and intelligence analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.427"
                                            },
                                            "Text": {
                                                "val": "-  Compared effects of various nerve stimulation targets on brain neurophysiology and learning rate in animal models.\n-  Assessed the combined impacts of neuromodulator contribution with peripheral nerve stimulation to improve cognitive, motor, or sensory task performance in animal models.\n-  Determined efficacy of various biomarkers to validate target nerve stimulation in animal models.\n-  Initiated human studies of non-invasive nerve stimulation on learning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.543"
                                            },
                                            "Text": {
                                                "val": "-  Utilize biomarkers to guide effective engagement of nerve targets in clinical studies.\n-  Evaluate combined efficacy of pharmacological neuromodulation with peripheral nerve stimulation for learning.\n-  Assess the longevity of effects of targeted peripheral nerve stimulation on cognitive, motor, or sensory task performance.\n-  Demonstrate statistically valid improvement in performance and\/or decrease in the time to achieve proficiency after pairing peripheral nerve stimulation with training."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Living Foundries"
                                    },
                                    "Description": {
                                        "val": "The goal of the Living Foundries program was to create a revolutionary, biologically based manufacturing platform for the DoD and the Nation.  With its ability to perform complex chemistries, be flexibly programmed through DNA code, scale, adapt to changing environments, and self-repair, biology represents one of the most powerful manufacturing platforms known.  Living Foundries sought to develop the foundational technological infrastructure to transform biology into an engineering practice, speeding the biological design-build-test-learn cycle and expanding the complexity of systems that could be engineered.  Ultimately, Living Foundries aimed to provide game-changing manufacturing paradigms for the DoD, enabling adaptable, on-demand production of critical and high-value molecules.\n \nResearch thrusts focused on the development and demonstration of open technology platforms to prove out capabilities for rapid (months vs. years) design and construction of new bio-production systems.  The result was an integrated, modular infrastructure across the areas of design, fabrication, debugging, analysis, optimization, and validation -- spanning the entire development life-cycle and enabled the ability to rapidly assess and improve designs.  Success was predicated on tight coupling of computational design, fabrication of systems, debugging using multiple characterization data types, analysis, and further development such that iterative design and experimentation would be accurate, efficient and controlled.  Demonstration platforms were challenged to build a variety of DoD-relevant, novel molecules with complex functionalities, such as synthesis of advanced, functional chemicals, materials precursors, and polymers (those tolerant of harsh environments)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.704"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated a fully automated infrastructure pipeline capable of prototyping and generating DoD-relevant molecules.\n-  Demonstrated ability to scale production of molecules from multi-gram up to kilogram scale using biology.\n-  Investigated methods to generate molecules that have not been previously synthesized using traditional chemistry."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Immunomodulation-Based Therapeutics"
                                    },
                                    "Description": {
                                        "val": "The Adaptive Immunomodulation-Based Therapeutics program developed platform technologies to interrogate and define the biological pathways to enhance operational readiness for DoD personnel.  This program aided the warfighter by improving immune response, minimizing inflammation, and restoring critical organ function.  One approach to achieve this capability required the development of new tools to stimulate and measure responses of the nervous system in order to harness the bioelectric code, enabling targeted therapy without the need for pharmacological products, ultimately reducing logistical requirements.  An additional approach involved characterizing the host response in patients with severe infections, which provides a quantitative framework to guide therapy.  Algorithms were developed to evaluate and predict various physiological conditions for military personnel.  Advances made under the Adaptive Immunomodulation-Based Therapeutics program will offer new avenues for treating disease or organ function to improve force readiness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.639"
                                            },
                                            "Text": {
                                                "val": "-  Quantified on-target responses to neurostimulation to validate feedback biomarkers, evaluate therapeutic benefit, and demonstrate circuit specificity.\n-  Implemented computational models of integrated neuromodulation and biomarker signaling for feedback control of health status.\n-  Demonstrated sustained functionality of novel bio-interfaces for neuromodulatory control of health status in animal models.\n-  Initiated clinical studies of feedback-controlled neuromodulation system to treat inflammation-based joint pain."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}