{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-22",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603648D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Capability Technology Demonstration (JCTD)"
        },
        "R1LineNumber": {
            "val": "47"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "962.234"
            },
            "PriorYear": {
                "val": "102.494"
            },
            "CurrentYear": {
                "val": "89.859"
            },
            "BudgetYearOne": {
                "val": "85.452"
            },
            "BudgetYearOneBase": {
                "val": "85.452"
            },
            "BudgetYearTwo": {
                "val": "89.929"
            },
            "BudgetYearThree": {
                "val": "94.685"
            },
            "BudgetYearFour": {
                "val": "101.397"
            },
            "BudgetYearFive": {
                "val": "106.832"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "In alignment with the National Defense Strategy (NDS) and the Department of Defense (DoD) modernization priorities, the Joint Capability Technology Demonstration (JCTD) program conducts prototype demonstrations and experiments to address Combatant Commands' (CCMDs), and Joint Service urgent and emergent warfighting needs.  The program delivers developmental and operational prototypes, generally within two to four years, culminating in a sponsored military utility assessment (MUA), thus enabling scale-up of science and technology from the laboratories into defense acquisition programs.  The key tenets of the JCTD program are to fulfill national objectives to build a more lethal force, strengthen alliances, and enable the DoD to achieve greater performance and affordability.  Following the Undersecretary of Defense, Research and Engineering (USD(R&E))'s Modernization Priority guidance, mission focused areas were co-developed with the Joint Staff to address the Chairman's gap assessment which include, but are not limited to: time-sensitive targeting (TST), advanced electronic warfare (AEW), integrated fires (IF), and fully networked command, control and communications (FNC3).\n\nThe JCTD program achieves its objectives by engaging the CCMDs, the Joint Services, interagency, international, and non-governmental partners to expand the DoD's access to prototyping and innovation.  JCTDs serve as a vehicle primarily for CCMDs to address the Joint force's strategic priority mission areas that present significant risk and suffer from inadequate investment.  JCTDs often address technology needs that fall into the seams between the urgent\/emergent needs of CCMDs and Title-10 functions of the Military Services.  Subsequently, JCTD investments are further informed by the CCMDs' integrated priority list, the capability gaps assessed through the Joint Staff, and the Military Services' science and technology roadmaps to achieve warfighter dominance.  As U.S. and partner nations are increasingly orienting toward peer competition in contested environments across multiple, inter-dependent domains, and where feasible through CCMD’s sponsorship, the JCTD program looks to deliver leap-ahead operational capability in reduced time with the coordination of allied research and development (R&D) funding, technology, and industry participation.  The value proposition is to affordably operationalize technologies more quickly, that enable Joint\/Combined forces to access novel\/leap-ahead capabilities.\n\nJCTD outcomes are designed to accelerate technology transition by evaluating and demonstrating prototyped technologies in operationally relevant environments.  Based on the results of the MUA performed under the cognizance of a CCMD sponsor, the products of a JCTD are \"left behind\" for additional assessment or operational use, transitioned to a program of record (PoR), or returned to the technical baseline inventory for further development.  The JCTD program uses MUAs to further inform acquisition pathways to field initial capabilities faster, or prompt major acquisition program decisions prior to milestone A or B approvals.  Therefore, the JCTD program serves as a technology catalyst and transition-bridge between the USD(R&E) and the Undersecretary of Defense, Acquisition and Sustainment (USD(A&S)) offices. \n\nIn FY 2019, the JCTD program successfully completed four MUAs and transitioned ten JCTD prototypes.  Nine JCTDs transitioned all or select components to new or existing PoRs, and one operational prototype was directly fielded and is being sustained by non-JCTD funds in operational theaters.  Since the JCTD Program was reframed in 2006, it has executed 116 prototyping projects.  The historical transition rate for the JCTD program is 84 percent, including: 63 prototypes (54 percent) transitioning to a PoR; 29 prototypes (26 percent) providing \"leave-behind\" assets for operational fielding; and five (5) prototypes (4 percent) placed on the General Services Administration schedule.  The remaining 19 prototypes (16 percent) were returned to the technical base for further development or were terminated.  Overall, the JCTD program has directly supported multiple key operations by rapidly accelerating the fielding of game changing technologies and capabilities into the hands of the Joint Warfighter."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "105.808"
                },
                "CurrentYear": {
                    "val": "107.359"
                },
                "BudgetYearOne": {
                    "val": "109.925"
                },
                "BudgetYearOneBase": {
                    "val": "109.925"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "102.494"
                },
                "CurrentYear": {
                    "val": "89.859"
                },
                "BudgetYearOne": {
                    "val": "85.452"
                },
                "BudgetYearOneBase": {
                    "val": "85.452"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.314"
                },
                "CurrentYear": {
                    "val": "-17.500"
                },
                "BudgetYearOne": {
                    "val": "-24.473"
                },
                "BudgetYearOneBase": {
                    "val": "-24.473"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-17.500"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.400"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.896"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments and DOD Priorities"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.018"
                                },
                                "BudgetYearOne": {
                                    "val": "-4.398"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.398"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.107"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.107"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Reductions From Defense Wide Review"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-19.968"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-19.968"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2020 Congressional reduction of $17.500 million was directed for program growth.\n\nDefense-Wide Review: The FY 2021 funding request was reduced by $19.968 million during DWR to realign funds for higher priority DoD missions. \n\nFY 2021 also included a $0.107 million reduction for Economic Assumptions and a $4.398 million reduction for other DOD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "648"
                    },
                    "ProjectTitle": {
                        "val": "Joint Capability Technology Demonstration (JCTD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "962.234"
                        },
                        "PriorYear": {
                            "val": "102.494"
                        },
                        "CurrentYear": {
                            "val": "89.859"
                        },
                        "BudgetYearOne": {
                            "val": "85.452"
                        },
                        "BudgetYearOneBase": {
                            "val": "85.452"
                        },
                        "BudgetYearTwo": {
                            "val": "89.929"
                        },
                        "BudgetYearThree": {
                            "val": "94.685"
                        },
                        "BudgetYearFour": {
                            "val": "101.397"
                        },
                        "BudgetYearFive": {
                            "val": "106.832"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "JCTD project selection is driven by the ability to accelerate transition of new prototyped capabilities to the Joint Warfighter that have strong CCMD and Joint Staff interest; cost share commitments from the Military Services and Defense Agencies; advanced technical readiness; and a well-defined and affordable transition path for long-term sustainment.  JCTD mission focused areas were co-developed with the Joint Staff to address the Chairman’s gap assessment which include, but are not limited to: time-sensitive targeting (TST), advanced electronic warfare (AEW), integrated fires (IF), and fully networked command, control and communications (FNC3).  The final objective for the JCTD program is to maintain the United States' technological superiority across the range of military operations while reducing the cost of operations, facilitating joint interoperability, and allowing for the rapid insertion of new capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Port Improvement via Exigent Repair (PIER)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  PIER supports the National Defense Strategy's focus on logistics modernization and the need for resilient and agile logistics.  PIER will deliver a dynamic, agile, cost effective (non-military construction) expeditionary engineering solution to rapidly repair damaged or degraded ports to a minimum level of serviceability after an attack or natural disaster.  Agility is achieved through a smaller footprint, commercial off-the-shelf components, and quick reaction of theater-based repair assets (e.g., pre-packaged, pre-positioned).  In FY 2019, PIER conducted an operational demonstration on the Pier Over-Decking Structure (PODS) and a final comprehensive military utility assessment of technologies in cooperation with U.S. Transportation Command (USTRANSCOM), U.S. Navy, and U.S. Army.  Components transitioned to USTRANSCOM, U.S. Navy, and U.S. Army.  JCTD completed in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.120"
                                            },
                                            "Text": {
                                                "val": "PIER will conduct a final military utility assessment of technologies in cooperation with U.S. Transportation Command (USTRANSCOM), U.S. Navy, and U.S. Army.  Components will transition to USTRANSCOM, U.S. Navy, and U.S. Army.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Brilliant Effects Employment Shadow (BEES)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  BEES directly supports the Secretary of Defense's priority for increased lethality.  BEES will demonstrate targeting using cooperative, multi-modal intelligence surveillance and reconnaissance (ISR) and electronic warfare (EW) sensors on autonomous, unmanned aerial systems (UAS).  BEES will demonstrate autonomous behaviors to synchronize multiple ISR and EW platforms that responsively update manned strike\/command and control platforms.  In FY 2019, BEES conducted technical and operational demonstrations of autonomous EW and ISR behaviors as part of an integrated mission package.  Service funded operational and military utility assessments will conclude in FY 2020 at which time the BEES capability will transition to a Service program of record using partner funding."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.880"
                                            },
                                            "Text": {
                                                "val": "BEES will conduct a joint military utility assessment (MUA) of autonomous EW and ISR behaviors as part of an integrated mission package in an operationally representative environment.  The flight phase will conclude at the end of FY 2019.  Pending successful operational demonstrations and MUA, the BEES capability will transition to a Service program of record using partner funding."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Predictive Human Intelligence (HUMINT) Crisis Model (PICK’EM)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  PICK’EM addressed capability needs identified in the U.S. Special Operations Command\n(USSOCOM) and U.S. Africa Command (USAFRICOM) integrated priority lists.  PICK'EM leveraged machine learning and cognitive computing to provide USSOCOM, USAFRICOM, and the Defense Intelligence Agency (DIA) the capability to forecast crisis events, provide courses of action, and identify operational candidates to carry out missions in support of joint warfighters.  In FY 2019, PICK’EM validated its prototype using live scenarios, conducted operational demonstrations, and military utility assessment conducted by an independent assessor.  PICK’EM transitioned to the DIA, USSOCOM, and USAFRICOM and completed in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.867"
                                            },
                                            "Text": {
                                                "val": "PICK’EM will validate its prototype using live scenarios.  After operational demonstrations, an independent assessor will conduct a military utility assessment.  PICK’EM will transition to the DIA, USSOCOM, and USAFRICOM."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pseudolite Synthetic Aperture Radar (PSAR)"
                                    },
                                    "Description": {
                                        "val": "PSAR supports the National Defense Strategy's focus on command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR).  PSAR will mature a small form-factor synthetic aperture radar (SAR) to provide all weather ISR from a high altitude (pseudolite) platform.  The small, light, low power system will provide high ground resolution.  The PSAR capability will be demonstrated on a high altitude long endurance (HALE) unmanned aerial system.  In FY 2019, PSAR demonstrated prototypes on surrogate manned aircraft, completed integration of SAR prototypes on pseudolite aircraft, conducted technical and operational demonstrations and military utility assessment.  PSAR will transition to U.S. Navy Program Executive Office, Space, and will close out in FY 2020."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.510"
                                            },
                                            "Text": {
                                                "val": "PSAR will fly prototypes on a surrogate manned aircraft; complete integration of SAR prototypes on a pseudolite aircraft; and conduct technical and operational demonstrations, and military utility assessment.  A fully operational capability will transition to U.S. Navy Program Executive Office, Space.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quickstrike MK64 – Extended Range (QS64-ER)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  QS64-ER supports the National Defense Strategy's focus to enhance joint lethality in contested environments.  QS64-ER will provide U.S. Indo-Pacific Command a low-cost wing kit and munitions guidance package to allow for the delivery of maritime mines to a precise location, from a safe stand-off distance.  In FY 2019, QS64-ER conducted external release operational demonstration from a B-52; mine placement accuracy and delivery assessment; and military utility assessment.  In FY 2020 QS64-ER will transition to the U.S. Navy Program Manager, Ships (PMS-495).  JCTD will close out in FY 2020."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.789"
                                            },
                                            "Text": {
                                                "val": "QS64-ER will conduct a demonstration from a B-52, assess mine survivability, conduct a military utility assessment and transition to the U.S. Navy Program Manager, Ships (PMS-495)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wingman"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  Wingman supports the National Defense Strategy's focus on advanced autonomous systems and forward force maneuver.  Wingman will project lethality by utilizing unmanned ground vehicles (UGVs) that can maneuver effectively within a mounted formation and engage ahead of and along with manned platforms.  The integration of weaponized UGVs into combat elements will provide initial operational stand-off for manned vehicles, enhanced situational awareness, and mitigate the risk of casualties at first contact.  In FY 2019, Wingman conducted an operational demonstration of the first unmanned system certified on the U.S. Army table VI scout gunnery course.  Wingman will transition to Next Generation Combat Vehicle program office in FY 2020, and will close out in FY 2020."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.215"
                                            },
                                            "Text": {
                                                "val": "Wingman will conduct a final military utility assessment of maneuver operations and Wingman technologies in cooperation with the U.S. Central Command and U.S. Army.  Wingman will transition components to Product Manager, U.S. Army Applique and Large Unmanned Ground Systems (PM USA ALUGS); Program Executive Officer, U.S. Marine Corps Land Systems; and, U.S. Army Research, Development, Engineering Command.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Aerial Insertion and Resupply into Dense, Urban, Complex Terrain (AAIRDUCT)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  AAIRDUCT supports the National Defense Strategy's focus to sustain Joint Force military advantages in austere locations and the DOD's modernization priority for fully networked command, control and communications.  AAIRDUCT will integrate and demonstrate multiple low-cost software enhancements into an autonomous precision aerial dispersion system capable of precisely delivering sensors, unmanned ground vehicles (UGV), munitions, humanitarian aid, and equipment into urban environments to reach isolated personnel.  In FY 2019, AAIRDUCT completed the final design of the airdrop Multi-Use Aerial Dispersing System and conducted numerous successful airdrop demonstrations.  AAIRDUCT will transition to United States Marine Corps (USMC) \/Battlefield Resupply Program Executive Office (PEO) in FY 2021 using partner funding.  JCTD completed in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.725"
                                            },
                                            "Text": {
                                                "val": "AAIRDUCT will conduct a military utility assessment; finalize concepts of operation and tactics techniques and procedures; and update mission planning software to address urban operations.  AAIRDUCT will transition the airdrop technology to Joint Precision Aerial Delivery System Ultra Lightweight programs of record (PoRs); the dispersion system to U. S. Army Special Operations Command Military Information Support Operations PoR; and UGV\/Sensor PoR for autonomous emplacement.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dialable Effects Munition (DEM)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  DEM supports the National Defense Strategy's focus to enhance joint lethality in contested environments.  DEM will provide U.S. Central Command and U.S. European Command the capability to modify munition effects while in flight to either increase a munition’s effect on target, or to lessen the effect for reduced collateral damage across a wide variety of targets.  In FY 2019, DEM performed the critical design review of the system, commenced fabrication of the full-scale prototype; conducted ground tests; completed flight tests for inert and live prototypes; conducted a readiness review; conducted military utility assessment.  The DEM JCTD government owned technical data package and test data transitioned to the U.S. Air Force Direct Attack Weapons Branch.  JCTD completed in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.930"
                                            },
                                            "Text": {
                                                "val": "DEM will perform the critical design review of the system, commence initial fabrication of the full-scale prototype, conduct ground tests, complete flight tests for inert and live prototypes, and conduct a readiness review.  Upon successful completion of the DEM MUA, the government owned technical data package and test data will be transitioned to the U.S. Air Force Direct Attack Weapons Branch."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hydra"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  Hydra supports the National Defense Strategy's focus to enhance forward force maneuver and posture resilience, as well as joint lethality in contested environments.  Hydra will provide U.S. Central Command and U.S. European Command the capability to deliver payloads from an undersea platform.  Hydra adapts the Defense Advanced Research Projects Agency's (DARPA) Hydra system and Office of Naval Research technologies to solve a CCMD's capability shortfall, and will mature command and control capabilities to deliver the desired payload from an unmanned system.  In FY 2019, Hydra delivered a final concept of operations, technical data packages, command and control package, and a military utility assessment.  Hydra transitioned the technical package, cyber security artifacts and prototypes to the U.S. Navy Unmanned Maritime Systems Program Office (PMS 406).  JCTD completes in FY 2020."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.495"
                                            },
                                            "Text": {
                                                "val": "HYDRA will deliver a final concept of operations, final technical data packages, a command and control package, begin building a prototype launch platform with an undersea launch capability, and a military utility assessment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Spectrum - Visual Instance of the Environment for Warfighters (EMS-VIEW)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  EMS-VIEW supports the National Defense Strategy's focus on deepening interoperability and innovative operational concepts.  EMS-VIEW provides a joint enterprise framework for Services to share situational awareness, collaboratively plan, and decentralize decision making.  EMS-VIEW’s first generation framework allows for reliable electromagnetic spectrum (EMS) access and EMS freedom of maneuver for offensive and defensive operations in a multi-domain environment.  In FY 2019, EMS-VIEW transitioned the capabilities to the U.S. Marine Corps' Spectrum Services Framework program, the U.S. Army’s Electronic Warfare Planning and Management Tool program, and the DoD’s Defense Spectrum Office’s Global Electromagnetic Spectrum Information System program.  JCTD closed in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.734"
                                            },
                                            "Text": {
                                                "val": "EMS-VIEW will design, integrate, and demonstrate software services and conduct its final demonstration.  Upon completion of the military utility assessment, EMS-VIEW will transition the capabilities to the U.S. Marine Corps' Spectrum Services Framework program, the U.S. Army’s Electronic Warfare Planning and Management Tool program, and the DoD’s Defense Spectrum Office’s Global Electromagnetic Spectrum Information System program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Unmanned Air Vehicle Distributed Lethality Airborne Network (MUDLAN)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  MUDLAN supports the National Defense Strategy's focus on command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) and fully networked command, control and communications modernization.  In FY 2018, MUDLAN demonstrated resilient networking that supports high data rate communications across multiple airborne and surface platforms operating in contested environments.  In FY 2019, MUDLAN performed flight testing on air, land, and sea platforms to demonstrate military utility of high data rate communications nodes, and demonstrate over-the-horizon, distributed communications capabilities at scale."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.650"
                                            },
                                            "Text": {
                                                "val": "MULAN will perform flight testing on air, land, and sea platforms to demonstrate military utility of high data rate communications nodes, and demonstrate over-the-horizon, distributed communications capabilities at scale."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.750"
                                            },
                                            "Text": {
                                                "val": "MUDLAN will incorporate and demonstrate a spectrum agility capability to autonomously shift frequency bands to ensure continuous air, land, and sea connectivity in contested electronic warfare environments.  MUDLAN will transition the technologies to a U.S. Air Force Air Combat Command program of record.  Complete the JCTD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "JCTD will complete in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Undersea Communications With Optical Laser Frequencies (Under C-WOLF)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  Under C-WOLF directly supports the National Defense Strategy's focus to develop resilient and federated communication and information systems from the tactical to the strategic level.  Under C-WOLF provides stealthy and low-latency, optical laser communications (OCOMMS) between undersea systems and air platforms.  Using low probability of intercept\/low probability of detection technology, the Under C-WOLF JCTD accomplished this by exploiting the air-water-interface (AWI) OCOMMS system and the all-through-water (ATW) OCOMMS system to operate at tactically useful bandwidths, depths, and ranges.  The bandwidth for the AWI OCOMMS system provides real-time command and control capability to the submarine.  The bandwidth for the ATW OCOMMS system allows an unmanned underwater vehicle to provide results of extensive surveys to a submarine.  Both systems together increase operational effectiveness of underwater communications in a radio frequency denied, degraded, or contested area, particularly in the U.S. Indo-Pacific Command and U.S. European Command areas of responsibility."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.720"
                                            },
                                            "Text": {
                                                "val": "Under C-WOLF will continue maturation of the AWI and ATW systems; formulate AWI and ATW concept of operations; and acquire hardware for test demonstrations and AWI system demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Under C-WOLF will deliver the AWI system for operational testing in relevant environment; complete the AWI platform integration; conduct laboratory testing of the ATW system; and perform an operational demonstration.  Under C-WOLF will transition capabilities to the U.S. Navy Program Executive Office Command, Control, Communications, Computers, and Intelligence.  JCTD will complete in FY 2020."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "JCTD will complete in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Expedient and Expeditionary Airfield Damage Repair (E-ADR)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  E-ADR supports the National Defense Strategy's focus on resilient agile logistics and forward force maneuver.  E-ADR will provide an expeditionary low-logistics repair capability that maximizes the use of indigenous materials and readily available equipment.  E-ADR will provide an expedient repair capability for aircraft runways in austere and dynamic base locations.  In FY 2019, E-ADR conducted technical testing, model development, and tactics, techniques, and procedures (TTP) development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.470"
                                            },
                                            "Text": {
                                                "val": "E-ADR will conduct technical and operational demonstrations for model validation; runway repair quality assessment; and, damaged surface cutout and removal."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "E-ADR will refine TTPs, conduct an operational demonstration, and conduct a final military utility assessment of surface capping and crater fill material processing, placement, and compaction.  In FY 2020 E-ADR will transition low-equipment count kits optimized for expeditionary transport along with validated TTPs to U.S. Air Force Silver Flag sites and Naval Construction Groups via U.S. Air Force Civil Engineer Center, U.S. Air Force Life Cycle Management Center, Naval Facilities Command and Naval Expeditionary Combat Command.  JCTD completes in FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no JCTD funding from OSD, transition funding will be provided by IINDOPACOM in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Negation of Asymmetric Threats (JNAT)"
                                    },
                                    "Description": {
                                        "val": "JNAT leverages and automates connectivity among existing weather radars and DoD sensors to provide detection of asymmetric threats beyond the National Capital Region (NCR).  JNAT will conduct its operational demonstration with multiple radar systems and high power microwave systems, while demonstrating kinetic and non-kinetic negation options.  JNAT developed a Counter-Unmanned Aerial System (C-UAS) concept of operations and demonstrates a common operating picture and reporting tool."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.391"
                                            },
                                            "Text": {
                                                "val": "JNAT will conduct its operational demonstration with multiple radar systems and high power microwave systems, while demonstrating kinetic and non-kinetic negation options.  JNAT will develop a C-UAS concept of operations and demonstrate a common operating picture and reporting tool."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.275"
                                            },
                                            "Text": {
                                                "val": "JNAT will conduct a cyber-negation demonstration; demonstrate a leave-behind integrated air defense and point defense capability; baseline adaptable C-UAS architecture; and conduct the final military utility assessment.  JNAT will transition to the U.S. Navy, the U.S. Air Force Life Cycle Management Center, and the U.S Army Aviation and Missile Research, Development and Engineering Center."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "JCTD will complete in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "More Situational Awareness for Industrial Control Systems (MOSAICS)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  MOSAICS supports the National Defense Strategy's focus on cyber-space domain defense and improved posture resilience and cybersecurity modernization.  MOSAICS will provide cyber defense for supervisory industrial control system for critical warfighting infrastructure.  MOSAICS will provide the ability to semi-autonomously detect, analyze, visualize, mitigate and recover from asymmetric attacks on critical infrastructure industrial control systems in mission relevant timeframes.  In FY 2019, MOSAICS conducted technology and operational demonstrations to show the end-to-end system integration of the MOSAICS system; conducted a live network and cyber range test at the Joint Information Operations Range (JIOR), and delivered the Advanced Cyber Industrial Control System Tactics, Techniques and Procedures (TTP)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.775"
                                            },
                                            "Text": {
                                                "val": "MOSAICS will provide a fully integrated end-to-end prototype, conduct initial field demonstrations, and deliver advanced cyber industrial control systems tactics techniques, and procedures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.345"
                                            },
                                            "Text": {
                                                "val": "Building on FY 2019 accomplishments, MOSAICS will conduct operational demonstrations and deliver leave-behind operational prototypes, validated the Concept of the Operations (CONOPS), training packages, and Unified Facilities Criteria.  After the military utility assessment (MUA), MOSAICS will transition to U.S. Navy Naval Facilities Engineering Command for sustainment.  Complete the JCTD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "JCTD will complete in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resilient Autonomy (RA)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  RA supports the National Defense Strategy's focus on advanced autonomous systems and machine learning modernization.  RA will provide DoD with an innovative autonomous intelligence, surveillance, and reconnaissance system that implements sophisticated air and ground collision avoidance on unmanned air platforms in support of flight safety.  RA will demonstrate and field a prototyped sense-and-avoid capability that will allow it to operate in joint airspace without constant human supervision.  In FY 2019, RA conducted architecture development, aircraft integration and baseline system testing and evaluation.  RA worked with the Federal Aviation Administration (FAA) to identify metrics required for RA flight certification and detailed FAA required milestones."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.159"
                                            },
                                            "Text": {
                                                "val": "RA will complete integration of RA capabilities into the HQ-90 UAS; conduct technical demonstrations, and perform test and evaluation of the integrated capability package."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.505"
                                            },
                                            "Text": {
                                                "val": "RA will conduct an operational demonstration of autonomous flight in civilian airspace using detect and avoid technologies to ensure safe separation from other aircraft or obstructions.  A rigorous military utility assessment (MUA) will be conducted and FAA certification process established.  RA will transition to a United States Marine Corps Unmanned Aerial System program of record.  Partner funded work on final reference implementation and certification processes for fully autonomous systems will be completed in FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "JCTD will complete in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Special Advanced Low-cost Surveillance Alternative (SALSA)"
                                    },
                                    "Description": {
                                        "val": "SALSA supports the National Defense Strategy's focus on command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) and fully networked command, control and communications modernization priority.  SALSA will develop an operational, affordable prototype sensor that provides on-demand, persistent wide-area surveillance for the Arctic environment.  In FY 2019, SALSA selected the site to conduct the operational demonstration (OD), conducted planning and preparation for OD, and finalized communications architecture for flight test."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.290"
                                            },
                                            "Text": {
                                                "val": "Select site for the SALSA operational demonstration (OD), conduct planning and preparation for SALSA OD, finalize communications architecture for flight test; conduct OD."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.005"
                                            },
                                            "Text": {
                                                "val": "Conduct final OD and military utility assessment (MUA).  United States Army Program Executive Office Missiles & Space\n(PEO M&S) \/ Cruise Missile Defense System (CMDS) will provide integration partnering with Aviation and Missile Research\nDevelopment and Engineering Center (AMRDEC) for transitioning of capability.  Close out the JCTD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "JCTD will complete in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sea Launched Army Tactical Missile System (ATACMS) from Shipboard High Mobility Artillery Rocket System (HIMARS) (SLASH)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  SLASH supports the National Defense Strategy's focus on joint lethality in contested environments.  SLASH will provide a sea launch option for the ATACMS.  The JCTD will demonstrate a long range supersonic ballistic surface to surface missile for employment by Expeditionary Strike Groups (ESGs), logistic forces, and U.S. Army (USA) watercraft.  In FY 2019, SLASH completed the ATACMS software modification, validation, and verification; conducted fabrication and qualification testing of shipboard blast pad; performed validation of launcher control system adaptability for shipboard use; and conducted missile requisition and integration with HIMARS launcher."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.245"
                                            },
                                            "Text": {
                                                "val": "SLASh will complete the ATACMS software modification; conduct software validation and verification; conduct fabrication and qualification testing of shipboard blast pad; perform validation of launcher control system adaptability for shipboard use; request launch planning, safety and environmental approvals; request ship alteration and approval for T-ESB class ships; and conduct missile requisition and integration with High Mobility Artillery Rocket System (HIMARS) launcher."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.625"
                                            },
                                            "Text": {
                                                "val": "SLASH will seek validate live fire testing; complete the missile buildup and software integration; complete the concept of operations documentation; conduct an operational demonstration and final military utility assessment.  Upon successful demonstration, SLASH will transition to the U.S. Army, Program Executive Office, Missiles and Space (PEO M&S), ATACMS program of record.  The project will complete in FY 2020."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "JCTD will complete in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unmanned Logistics System-Air (ULS-A)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  ULS-A supports the National Defense Strategy's focus on resilient agile logistics, advanced autonomous systems, and machine learning modernization.  ULS-A will demonstrate the utility of unmanned aerial system (UAS) prototypes coupled with autonomous technologies to provide an organic, highly autonomous, aerial distribution capability that increases ground maneuver force agility, decreases carrying load, and allows the Joint Commanders to have ‘on-call’ control of mission essential and time-critical resupply.  In FY 2019, ULS-A conducted initial prototype acquisition, and small and medium ULS-A autonomy technical demonstrations.  ULS-A incorporated prototype improvements and new autonomy algorithms into the medium ULS-A and conducted a technical demonstration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.973"
                                            },
                                            "Text": {
                                                "val": "ULS-A will incorporate medium ULS-A prototype improvements, integrate autonomy algorithms and conduct a technical demonstration for medium ULS-A."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.950"
                                            },
                                            "Text": {
                                                "val": "ULS-A will conduct an operational demonstration of an upgraded autonomy package and UAS advanced capabilities; finalize capability development document (CDD) for Service review; complete medium ULS-A joint concept of operations; and conduct final military utility assessment.  In FY 2021 utilizing partner provided funding, ULS-A will continue work on transitioning the small ULS-A operational prototype.  The medium ULS-A operational prototype will transition to a U.S. Army and\/or NAVAIRSYSCOM program office to inform a Milestone B decision in FY 2022.  Medium ULS-A CDD and concept of operations will transition to Services fielding ULS-A.  Complete the JCTD in FY 2020."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "JCTD will complete in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Manufacturing Energetic Airframe (IMEA)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  IMEA supports the National Defense Strategy's modernization priority for joint lethality in contested environments.  IMEA will demonstrate novel structural systems that, when combined with unmanned platforms, provide enhanced lethality and mission flexibility to the Joint Warfighter.  In FY 2019, IMEA conducted energetic performance and small scale safety testing; technical demonstration of subsystem components; final design of airframe with energetic components and safe arm technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.154"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.425"
                                            },
                                            "Text": {
                                                "val": "IMEA will conduct technical demonstrations of integrated airframe, terminal navigation systems; operational demonstration of integrated platform; and military utility assessment.  IMEA JCTD will transition a complete platform data package and prototype to U.S. Army Program Executive Office Missiles and Space Close Combat Weapon Systems and U.S. Navy Submarine Combat and Weapons Control Program Office (PMS-425).  Complete the JCTD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project will complete in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automating Indications and Warnings (I&W) for Operational Awareness (REDLINE)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  REDLINE supports the National Defense Strategy's focus on military applications of machine learning to gain a competitive military advantage.  REDLINE will leverage machine learning to provide CCMDs the ability to conduct automated order of battle in denied areas.  In FY 2019, REDLINE delivered improved algorithms and fully automated dissemination of highest confidence alerts as assessed by calibrated performance models.  These capabilities improved the initial capability for vetted alerts to facilitate I&W on the Joint Worldwide Intelligence Communications System."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.495"
                                            },
                                            "Text": {
                                                "val": "REDLINE will deliver improved algorithms and a fully automated dissemination of highest confidence alerts as assessed by calibrated performance models.  The REDLINE system will deploy on the Secret Internet Protocol Router Network."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "REDLINE will scale performance to support global event detection and classification, and provide open applications programming interfaces to facilitate interoperability with other systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "REDLINE will conduct its military user assessment (MUA) in FY 2021 and will transition to the Defense Intelligence Agency’s Foundational Intelligence Modernization effort as a program of record."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreases in FY 2021 as the program transitions."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Covert Long Dwell Stratospheric Architecture (COLD STAR)"
                                    },
                                    "Description": {
                                        "val": "FY 2019 new start JCTD.  COLD STAR supports the National Defense Strategy's focus on command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) and fully networked command, control and communications modernization priority.  Develop and demonstrate a stratollite architecture equipped with autonomous navigation, high fidelity sensors, and on board algorithms to facilitate tasking, collection, processing, exploitation, and dissemination.  In FY 2019, COLD STAR conducted preliminary design review and critical design review; conducted initial technical demonstrations (TD)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.470"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Develop integrated assessment plan; conduct final TD, conduct operational demonstration (OD) with United States Southern Command (USSOUTHCOM)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Complete integrated assessment plan; conduct final OD, and military utility assessment (MUA) using autonomous navigation and on-board processing on a stratollite.  Close out the JCTD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreases in FY 2021 due to transitioning activities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy Survivable Standoff Munitions (DESSM)"
                                    },
                                    "Description": {
                                        "val": "FY 2019 new start JCTD project.  DESSM supports the National Defense Strategy’s focus on increase lethality, in addition to the DoD’s modernization priority concerning directed energy (DE) technologies.  DESSM will develop material solutions for protecting standoff munitions against DE countermeasures and weapons.  This will enable direct target prosecution of DE weapons or DE-protected targets.  DESSM will also utilize hardened munitions to reduce and eliminate weapon effectiveness zones."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.015"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.830"
                                            },
                                            "Text": {
                                                "val": "Finalize design; experimentally characterize material and component effects; perform initial integration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Complete build; concept of the operations and tactics, techniques, and procedures drafted; begin technical demonstrations, later culminating with a successful military utility assessment in the project’s third and final year."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreases in FY 2021 due to operational demonstration completing before end of fiscal year, reducing expenditures."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High-altitude Attritable Link Offset Geo-location (HALO-GEO)"
                                    },
                                    "Description": {
                                        "val": "FY 2019 new start JCTD.  HALO-GEO supports the National Defense Strategy's focus on developing resilient, survivable networks from the tactical level up to strategic planning.  HALO-GEO will provide a resilient alternate positioning, navigation, and timing (A-PNT) solution through a tactically responsive PNT which includes geolocation of adversary forces.  HALO-GEO addresses risks of losing situational awareness of adversary positions within denied regions.  HALO-GEO will enable joint and coalition operations and situational awareness in contested environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.645"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.900"
                                            },
                                            "Text": {
                                                "val": "HALO-GEO will select and develop algorithms; integrate software with prototype hardware for the technical demonstration (TD); deliver a system design review; conduct a preliminary design review and an operational demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.100"
                                            },
                                            "Text": {
                                                "val": "HALO-GEO will conduct initial flight demonstrations as well as conduct critical design reviews (CDR).  The project closes in FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "MUA conducted later in fiscal year will increase costs for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hoku-Kai"
                                    },
                                    "Description": {
                                        "val": "FY 2019 new start JCTD.  Hoku Kai supports the USD(R&E) fully networked command, control, and communications modernization priority by providing a secure command, control, and communications platform against continuously growing adversarial threats.  The JCTD will deliver assured maritime domain access and targeting using resilient undersea networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.384"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.400"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, Hoku Kai will begin the JCTD by starting development on CONOPs and TTPs, develop integrations plans, obtain environmental permits at demonstration sites, develop\/define standard network interfaces and standards, as well as conduct preliminary designs for the FY 2021 technical and operational demonstrations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.750"
                                            },
                                            "Text": {
                                                "val": "Hoku Kai will continue to build hardware nodes in FY 2021, conduct integration tests of the nodes in classified locations, develop the end-to-end network architecture, prepare and install the infrastructure at demonstration sites, and complete the delivery of final designs, prototypes, development tasks and network architecture for the JCTD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "MUA conducted later in fiscal year will increase costs for FY 2022.  JCTD completes in FY 2022."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-domain Agile Navigation and timing Network Automation (MANNA)"
                                    },
                                    "Description": {
                                        "val": "FY 2019 new start JCTD.  MANNA supports the National Defense Strategy's modernization priority on netted command, control, and communications.  MANNA will demonstrate a global positioning system-free positioning, navigation and timing (PNT) laser communications (lasorcom) solution with secure, high-rate exfiltration of intelligence data from an aerial platform to a low earth orbit space asset.  In FY 2019, MANNA conducted preliminary design reviews; bench testing; and architecture development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.678"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "MANNA will complete aircraft integration; conduct ground-to-ground and air-to-ground technical demonstrations; deliver multiple interoperable communications and PNT terminals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "MANNA will conduct space-to-air, space-to-ground technical documentation; operational demonstrations; and military utility assessment (MUA).  MANNA will transition the initial capabilities document, testing results of the MUA, verification of models, and three lasercom terminals to the RC-135 program of record via U.S. Air Force Research Laboratory."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Operational demonstration completes before end of fiscal year, reducing expenditures in FY 2021.  JCTD completes in FY 2022."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maritime Centric Skywave Over-the-Horizon Radar (MASOR)"
                                    },
                                    "Description": {
                                        "val": "FY 2019 new-start JCTD.  MASOR supports the National Defense Strategy's focus on command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) and fully networked command, control and communications modernization priority.  MASOR provides a near constant wide-area maritime detection and monitoring capability for both air and maritime targets which will degrade an adversary’s ability to remain undetected within the southern approach.  In FY 2019, MASOR acquired system specifications; site and land acquisition; finalization of transit systems plans; and installation of digital receiver."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.870"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "MASOR will install transmit array and high power amplifier; conduct transit system verification; conduct tracking and control technical demonstration; and installation of skywave over-the-horizon radar (OTHR)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "MASOR will conduct a full system checkout, testing, verification, validation; operational demonstration; and preparation for military utility assessment (MUA).  Upon successful MUA, MASOR will transition to the existing Relocating OTHR Texas system via Forces Surveillance Support Center."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in FY 2021 funding due to acceleration of development in FY 2020.  JCTD concludes in FY 2022."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resilient Expeditionary Agile Littoral Logistics (REALL)"
                                    },
                                    "Description": {
                                        "val": "FY 2019 new start JCTD.  REALL supports the National Defense Strategy's modernization priority on forward force maneuver and posture resilience.  REALL will demonstrate capabilities to enable a distributed network of fuel distribution and logistics nodes in support of emerging operational concepts.  These systems will operate within the arc of enemy fires with significantly less risk than traditional naval platforms due to their distributed nature.  In FY 2019, REALL completed platform selection; system functional requirements; system architecture; and modeling and simulation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.470"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "REALL will complete platform design, acquisition and modification; vertical take-off and landing (VTOL) kit design and development; fuel handling system design; military utility assessment (MUA) planning; and technical demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "REALL will complete systems integration and testing; tactics, techniques, and procedures; and final MUA.  REALL will transition the platform, VTOL kit fuel subsystem technical documentation to Naval Facilities Engineering Command (NAVFAC) Expeditionary Programs Office Sealift program; Naval Beach Group inventories via NAVFAC Expeditionary Programs Office; and Office of the Chief of Naval Operations, Expeditionary Warfare (OPNAV N95) and Strategic Mobility and Combat Logistics (OPNAV N42).  Complete the JCTD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding remains constant throughout the JCTD due to varying partner funding contributions in FY 2019, FY 2020, and FY 2021.  JCTD concludes in FY 2022."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "UHF Legacy Extension (ULX)"
                                    },
                                    "Description": {
                                        "val": "FY 2019 new start JCTD.  ULX supports the National Defense Strategy's focus on developing resilient, survivable networks from the tactical level up to strategic planning.  ULX will address legacy communication systems across the DoD currently lacking resilience in congested and contested environments.  These systems face near term risk of shortfalls in UHF channel capacity while wideband code division multiple access (WCDMA) radios are fielded.  ULX will resolve the legacy UHF shortfall by increasing total legacy UHF channel capacity worldwide.  ULX will reduce legacy UHF channel contention among users by leveraging Mobile User Objective System (MUOS) spot beams for regional channel assignment.  ULX provides resiliency and eliminates legacy UHF interference through innovative ground signal processing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.395"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.250"
                                            },
                                            "Text": {
                                                "val": "ULX will develop concept of the operations and tactics, techniques, and procedures; develop user-friendly frequency planning system and channel plan; conduct technical demonstration (TD); and install operational prototype."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.050"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.050"
                                            },
                                            "Text": {
                                                "val": "Conduct operational demonstration (OD) and military utility assessment (MUA).  ULX will transition operational prototype hardware and software to the MUOS program of record (PoR).  The operational prototype will be transitioned in place at the Wahiawa, HI Radio Access Facility to the MUOS PoR."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Operational demonstration completes before end of fiscal year, reducing expenditures.  JCTD concludes in FY 2022."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JCTD Concept Development\/Developmental and Operational Prototypes"
                                    },
                                    "Description": {
                                        "val": "Continually funded effort.  This funding allocation is to provide funding for the new start JCTDs.  The JCTD program will select new projects as developmental and operational prototypes, in alignment with the co-developed mission focused areas which include, but are not limited to: time-sensitive targeting (TST), advanced electronic warfare (AEW), integrated fires (IF), and fully networked command, control and communications (FNC3).  Senior representatives from each CCMD, Service, and Joint Staff will participate in the submission, initial review, and down-selection of JCTDs.  Final selections will be reviewed by the Assistant Directors for the DOD Modernization Areas and USD(R&E) executive leadership before a final recommendation for Congressional approval is made.  Selected projects will leverage networks within the global research and engineering enterprise to include government labs and integration facilities, depots, academia, as well as traditional and non-traditional technology providers.  Prototypes will utilize best practices to satisfy joint and cross-cutting needs that directly address the modernization priorities and the CCMD's technology\/capability gaps.  The JCTD office will work with the Services to identify means to streamline prototype transition into the acquisition systems where appropriate."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Select advanced prototyping activities as new starts in FY 2019 in the following three(3) focus areas: \n- Joint lethality in contested environments: Develop means to enable the Joint Force to strike diverse targets inside adversary air and missile defense networks to destroy mobile power-projection platforms.  This includes capabilities that enhance long range and close combat lethality in complex terrain.\n- Resilient C4ISR and positioning, navigation, and timing: Mature and maintain resilient, survivable, networks and information systems.  Investments will focus on gaining and exploiting information, denying competitors those same advantages through kinetic and non-kinetic means, and defending the Joint Force while holding accountable state or non-state actors during cyberattacks. \n- Survivable and agile logistics: Enabling prepositioned forward stocks and munitions, strategic mobility assets, partner and allied support, as well as non-commercially dependent distributed logistics and maintenance to ensure logistics sustainment while under persistent multi-domain attack.  These focus areas may be updated based on evolving Combatant Commanders' needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.549"
                                            },
                                            "Text": {
                                                "val": "Fund the follow-on efforts for projects started in FY 2019.  Select advanced prototyping activities as new starts in FY 2020 that support the National Defense Strategy and the USD(R&E) priorities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "43.549"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "43.549"
                                            },
                                            "Text": {
                                                "val": "Fund the follow-on efforts for projects started in FY 2020.  Select advanced prototyping activities as new starts in FY 2021 that support the National Defense Strategy and the USD(R&E) priorities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Element baseline show an increase from FY 2020 to FY 2021.  This line is dedicated to new start projects.  During the years of execution (FY 2019 \/ FY 2020), once projects are selected, funding is no longer accounted in this line and is accounted for in projects detailed separately throughout the R-2A.  The reality is that total funding supporting new start projects remains constant, at approximately 30 percent of the annual appropriation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Commander (CCMD) Support, Capability Transition and Strategic Project Operational Management"
                                    },
                                    "Description": {
                                        "val": "Previously funded effort.  This effort is comprised of three programs that support the entire JCTD Program.  The three programs are (1) CCMD direct liaison support, (2) JCTD pre-transition and (3) Program Integration Office for execution of select, classified projects.  (1) CCMD direct liaison support: The CCMDs are essential in specifying capability needs, project identification, demonstration venues, military utility assessment, and transition of JCTDs.  The JCTD program provides direct support to CCMDs enabling them to provide an on-site JCTD operational manager.  (2) JCTD pre-transition: In some cases, Service or Agency partner transition funding is not available for one to two years following the JCTD demonstration phase.  In such cases, where there is a clear transition and the need to sustain the capability for a short time prior to availability of Service or Agency transition funds, the JCTD pre-transition funds may be used to meet that need.  (3) Program Integration Office: Executes a select number of highly classified projects in areas such as electronic miniaturization, electronic countermeasures, advanced mobile ad hoc network communications, space situational awareness intelligence surveillance and reconnaissance, sensor platforms and communications, and persistence surveillance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.980"
                                            },
                                            "Text": {
                                                "val": "Provide CCMD direct participation to enable CCMD staff participation in identifying and executing developmental and operational prototypes.  Identify and execute projects selected by the technology assessment panels.  Sustain selected projects until program of record funds are received.  Execute a limited number of classified projects' military utility assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.250"
                                            },
                                            "Text": {
                                                "val": "Provide CCMD direct participation to enable CCMD staff participation in identifying and executing developmental and operational prototypes.  Identify and execute projects selected by the technology assessment panels.  Sustain selected projects until program of record funds are received.  Execute a limited number of classified projects' military utility assessments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.003"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.003"
                                            },
                                            "Text": {
                                                "val": "Provide CCMD direct participation to enable CCMD staff participation in identifying and executing developmental and operational prototypes.  Identify and execute projects selected by the technology assessment panels.  Sustain selected projects until program of record funds are received.  Execute a limited number of classified projects' military utility assessments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Slight increase from FY 2020 to FY 2021 is due to inflation of multi-year contracts."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Successful JCTDs can transition to acquisition via one of several methods:\n-  The JCTD addresses a documented capability gap in an existing program of record (PoR).  The existing PoR can acquire, further mature, sustain, and provide the capability under existing program documentation.\n-  The capabilities address capability gaps that naturally fit with an existing PoR, but program documentation addressing the new capabilities does not exist.  In these cases, existing PoR documentation (such as the capabilities development document (CDD) or capabilities production document (CPD)) is revised to include the new capabilities from the JCTD, and the JCTD capabilities transition to the PoR.\n-  The capabilities address a current operational need without requiring PoR changes.  In these cases, the JCTD capabilities may transition directly to operational use, with sustainment (operations and maintenance) funding arranged through the gaining command.  \n- The results of JCTD can be used to inform research and engineering, or validate a joint requirement per the Joint Capabilities Integration and Development System.  This includes identification of the need through development of an initial capability description (ICD) document or accelerating the development of a CDD or CPD to establish a new PoR.\n- The capabilities may be widely applicable commodity products, useful to many commands.  In these cases, the commodity products are listed on General Services Administration schedule, and made available for purchase by any commands needing the capability."
                        }
                    }
                }
            ]
        }
    }
}