{
    "id": "2021-Army-PB-2040-JBOOK-2ce7b76ca8f41dbc06183380f90728d4a8e40b9122c9effab5b4a02fdffb364e-12",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605709A"
        },
        "ProgramElementTitle": {
            "val": "Exploitation of Foreign Items"
        },
        "R1LineNumber": {
            "val": "198"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "15.026"
            },
            "CurrentYear": {
                "val": "11.168"
            },
            "BudgetYearOne": {
                "val": "8.936"
            },
            "BudgetYearOneBase": {
                "val": "7.936"
            },
            "BudgetYearOneOCO": {
                "val": "1"
            },
            "BudgetYearTwo": {
                "val": "12.801"
            },
            "BudgetYearThree": {
                "val": "13.108"
            },
            "BudgetYearFour": {
                "val": "13.407"
            },
            "BudgetYearFive": {
                "val": "15.803"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "90.249"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) provides for the acquisition, exploitation, and inventory of foreign ground materiel with potential advanced technology threats to United States (U.S.) systems, as well as emerging and destructive threats such as cyber vulnerabilities, biometric systems, and evolving improvised explosive devices. The primary aim of the PE is to maximize the efficiency of research and development for force and materiel development by reducing the uncertainties associated with these threats. The PE also answers scientific and technical intelligence requirements, provides materiel for realistic testing and training, and aids in the development of countermeasures to threat systems, materiel, and technologies. Operations have increased the amount of captured threat materiel that require immediate exploitation to develop countermeasures and force protection measures for U.S. forces. Acquisition and exploitation are executed according to Army Foreign Materiel Program (FMP) Plan prioritization and with the approval of the Army Deputy Chief of Staff for Intelligence (G2)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.026"
                },
                "CurrentYear": {
                    "val": "11.168"
                },
                "BudgetYearOne": {
                    "val": "11.441"
                },
                "BudgetYearOneBase": {
                    "val": "11.441"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "15.026"
                },
                "CurrentYear": {
                    "val": "11.168"
                },
                "BudgetYearOne": {
                    "val": "8.936"
                },
                "BudgetYearOneBase": {
                    "val": "7.936"
                },
                "BudgetYearOneOCO": {
                    "val": "1"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-2.505"
                },
                "BudgetYearOneBase": {
                    "val": "-3.505"
                },
                "BudgetYearOneOCO": {
                    "val": "1"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.505"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.505"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "1"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY19 reprogramming increase of $2.000 million was to produce a physics based mobility model for both foreign & US AFVs which will accurately predict mobility performance on complex terrain conditions and enable integrated weapon system capability.  This model will provide a foreign AFV mobility planning tool to reduce decision maker uncertainty about threat vehicle mobility corridors in support of specific OPLANS.  This is in support of requirements submitted by Army Futures Command, US Army Material Command, US European Command, & US Army Training & Doctrine Command.\n\nThe FY21 decrease was due to a recapitalizing of resources for acquisition."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "C28"
                    },
                    "ProjectTitle": {
                        "val": "Acq\/Exploit Threat Items (MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.026"
                        },
                        "CurrentYear": {
                            "val": "11.168"
                        },
                        "BudgetYearOne": {
                            "val": "8.936"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.936"
                        },
                        "BudgetYearOneOCO": {
                            "val": "1"
                        },
                        "BudgetYearTwo": {
                            "val": "12.801"
                        },
                        "BudgetYearThree": {
                            "val": "13.108"
                        },
                        "BudgetYearFour": {
                            "val": "13.407"
                        },
                        "BudgetYearFive": {
                            "val": "15.803"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "90.249"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides for the acquisition, exploitation, and inventory of foreign ground materiel with potential advanced technology threats to United States (U.S.) systems, as well as emerging and destructive threats. The primary aim of the Project is to maximize the efficiency of research and development for force and materiel development by reducing the uncertainties associated with these threats. The Project also answers scientific and technical intelligence requirements, provides materiel for realistic testing and training, and aids in the development of countermeasures to threat systems, materiel, and technologies. Operations have increased the amount of captured threat materiel that require immediate exploitation to develop countermeasures and force protection measures for U.S. forces. Acquisition and exploitation are executed according to Army Foreign Materiel Program (FMP) Plan prioritization and with the approval of the G2."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Foreign Materiel Program (FMP) Acquisition"
                                    },
                                    "Description": {
                                        "val": "This effort provides for the acquisition of foreign ground materiel with potential advanced technology threats to U.S. systems, as well as emerging and destructive threats. The primary aim of the effort is to maximize the efficiency of research and development for force and materiel development by reducing the uncertainties associated with these threats. The effort also answers scientific and technical intelligence requirements, provides materiel for realistic testing and training, and aids in the development of countermeasures to threat systems, materiel, and technologies. Operations have increased the amount of captured threat materiel that require immediate exploitation to develop countermeasures and force protection measures for US forces. Acquisition and exploitation are executed according to Army FMP Plan prioritization and with the approval of the G2."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.298"
                                            },
                                            "Text": {
                                                "val": "Conduct Foreign Materiel Acquisition of threat related foreign ground materiel systems and state-of-the-art technologies of military significance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.685"
                                            },
                                            "Text": {
                                                "val": "Will conduct Foreign Materiel Acquisition of threat related foreign ground materiel systems and state of the art technologies of military significance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.628"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.628"
                                            },
                                            "Text": {
                                                "val": "Will conduct Foreign Materiel Acquisition of threat related foreign ground materiel systems and state of the art technologies of military significance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease was due to a recapitalizing of resources for acquisition."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Foreign Materiel Program (FMP) Exploitation"
                                    },
                                    "Description": {
                                        "val": "This effort provides for the exploitation and inventory of foreign ground materiel with potential advanced technology threats to U.S. systems, as well as emerging and destructive threats such as cyber vulnerabilities, biometric systems, and evolving improvised explosive devices. The primary aim of the effort is to maximize the efficiency of research and development for force and materiel development by reducing the uncertainties associated with these threats. The effort also answers scientific and technical intelligence requirements, provides materiel for realistic testing and training, and aids in the development of countermeasures to threat systems, materiel, and technologies. Operations have increased the amount of captured threat materiel that require immediate exploitation to develop countermeasures and force protection measures for US forces. Acquisition and exploitation are executed according to Army FMP Plan prioritization and with the approval of the G2."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.728"
                                            },
                                            "Text": {
                                                "val": "Conduct Foreign Materiel Acquisition of threat related foreign ground materiel systems and state-of-the-art technologies of military significance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.483"
                                            },
                                            "Text": {
                                                "val": "Will conduct Foreign Materiel Exploitation of threat related foreign ground materiel systems and state of the art technologies of military significance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.308"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.308"
                                            },
                                            "Text": {
                                                "val": "Will conduct Foreign Materiel Exploitation of threat related foreign ground materiel systems and state of the art technologies of military significance."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Will conduct Foreign Materiel Exploitation of battlefield acquired FM."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease was due to a recapitalizing of resources for acquisition."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}