{
    "id": "2021-AirForce-PB-3600-MJBOOK-3-0-4ccc939241b47239c36ee98d5519ce37a7e18b46d494a025321d2035cb3d38d7-26",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305206F"
        },
        "ProgramElementTitle": {
            "val": "Airborne Reconnaissance Systems"
        },
        "R1LineNumber": {
            "val": "267"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "195.323"
            },
            "CurrentYear": {
                "val": "137.909"
            },
            "BudgetYearOne": {
                "val": "121.512"
            },
            "BudgetYearOneBase": {
                "val": "121.512"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "66.358"
            },
            "BudgetYearThree": {
                "val": "67.856"
            },
            "BudgetYearFour": {
                "val": "43.360"
            },
            "BudgetYearFive": {
                "val": "62.528"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "This program, BA 7, PE 0305206F, project 674820, Advanced Synthetic Aperture Radar System (ASARS)-2C (back-end), is a new start.\n\nIn FY2021 all funding in PE 0305206, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) will be realigned to provide greater visibility and transparency of funding into the projects.\nIn FY2021, PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related to Next-Generation Sensors were transferred to Project 672001, (Next-Generation Sensors)  in order to provide greater visibility and transparency.\nIn FY2021, PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related to Agile ISR were transferred to Project 672002, (Agile ISR)  in order to provide greater visibility and transparency.\nIn FY2021, PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related to System Open System Architecture were transferred to Project 672003, (Sensor Open System Architecture)  in order to provide greater visibility and transparency.\nIn FY2021, PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related ASARS-2B were transferred to Project 674820, (Sensors Development) in order to provide greater visibility and transparency.\nIn FY2021, PE 0305206F, (Airborne Reconnaissance Systems), Project 674820, (Sensor Development) funds were transferred from PE 0604257F (Advanced Technology and Sensors), Project 645148, (Common Airborne Sense and Avoid), in order to align funding with Air Force project priorities and requirements.\nIn FY2021, PE 0305206F, (Airborne Reconnaissance Systems), Project 672001, (Next Generation Sensor) received $18M in funds that were intended for PE 0305202F (Dragon U-2), Project 674820, (Sensor Development), per FY21 PBD.  Funds will be executed against U-2 avionics and sensor efforts under PE 0305202F (Dragon U-2)."
        },
        "ProgramElementMissionDescription": {
            "val": "This program funds multi-domain, multi-Intelligence (multi-INT) research, development, test and evaluation (RDT&E) efforts in support of the National Defense Strategy (NDS) and 2018 DoD Artificial Intelligence Strategy, as applied by the Air Force in the Next Generation ISR Dominance Flight Plan.  Specifically, Program 0305206F provides authorized and appropriated funding to multi-INT RDT&E efforts for utilization on airborne platforms. This program traditionally provides a venue for integration of technologies matured in both the Advanced Technology and Sensors(0604257F) and Airborne SIGINT Enterprise (0304260F) program elements.\n\nAccording to the 2018 NDS, \"we are facing an increasingly complex security environment as defined by ... adversaries in every operating domain.”  Additionally, to ensure (operations) sustainment while under persistent multi-domain attack, the Air Force has applied the NDS in the Next Generation ISR Dominance Flight Plan.  The future ISR portfolio will \"consist of a multi-domain, multi-intelligence,” systems to \"remain confident across the entire conflict spectrum.”  The Airborne Reconnaissance PE is integral to developing multi-domain, multi-INT systems capable of sustaining warfighter decisive advantage through all ranges of military operations, up to highly contested environments (HCE).\n\nThe Airborne Reconnaissance System (ARS) Program matures, develops, demonstrates, and rapidly transitions: next-generation, persistent, wide area surveillance and common imagery reconnaissance sensors, and both active and passive capabilities.  ARS includes sensor data processing for multiple airborne platforms, in addition to sensor products aiding assisted target recognition algorithms and other artificial intelligence activities (e.g., geolocation models, sensor based exploitation tools, sensor networking capabilities).  ARS provides for modeling & simulation, training and multi-INT systems engineering. This program also coordinates common collection, processing, and dissemination solutions for near-real-time multi-domain ISR development.\n\nThe ARS Program includes the following efforts:  Next Generation Sensors efforts lead advancements in multi-INT, platform agnostic capability.  The Next Generation Sensors (NGS) project is developing, demonstrating, and maturing Intelligence, Surveillance, and Reconnaissance (ISR) sensor suites in a platform agnostic environment. Sensor suites will include open architectures to further enable platform mobility and tech refresh as well as Artificial Intelligence (AI) algorithms to enable assisted target detection and identification. Efforts include but are not limited to, Triple Raven multi-GEOINT High Altitude Advanced Technology Demonstration, multi-INT Common Open Architecture Reconnaissance Programs Standard (MI-COARPS), and Assisted Target Recognition for ISR (ATRI).  Agile ISR includes Detection Removal and Characterization Operations developing a robust image quality improvement capability for airborne synthetic aperture radar (SAR) products.  Sensors Open Systems Architecture (SOSA) coordinates advanced technologies, and open architecture development for multi-INT sensor modalities. The program includes development of a family of government owned, open, platform agnostic pods - the AgilePod Family. Sensor Development includes Advanced Synthetic Aperture Radar System (ASARS) front end antenna array and receiver exciter advancements (ASARS-2B) and back end processor advancements (ASARS-2C).  ASARS-2B follow on RDT&E extends range, enhances Ground Moving Target Indicator (GMTI) and Synthetic Aperture Radar (SAR) performance and introduces maritime capability while laying in the framework for future use of open architectures. ASARS-2C effort extends the functionality and performance of ASARS-2B through the addition of advanced radar capabilities by enabling use of third party vendor solutions and multi-platform integration.  ASARS is the radar solution for Next Generation Sensors efforts.  JTC supports ISR Training Systems Integration Laboratories.  Gorgon Stare Wide Area Motion Imagery research, development, test and evaluation.  Data Compression efforts are led by Reduction of Data Using Compression Enhancement (RDUCE).  RDUCE develops data compression algorithms, addressing current and future date dissemination systems' bandwidth limitations.  Consistent with NDS, algorithms are multi-INT sensor agnostic that are submitted for formal adoption by the DoD-Intelligence Community (IC) Joint Enterprise Standards Committee (JESC) GEOINT standards groups.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver technology and sensor capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "195.334"
                },
                "CurrentYear": {
                    "val": "122.909"
                },
                "BudgetYearOne": {
                    "val": "73.719"
                },
                "BudgetYearOneBase": {
                    "val": "73.719"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "195.323"
                },
                "CurrentYear": {
                    "val": "137.909"
                },
                "BudgetYearOne": {
                    "val": "121.512"
                },
                "BudgetYearOneBase": {
                    "val": "121.512"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.011"
                },
                "CurrentYear": {
                    "val": "15.000"
                },
                "BudgetYearOne": {
                    "val": "47.793"
                },
                "BudgetYearOneBase": {
                    "val": "47.793"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "15.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.011"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "47.793"
                                },
                                "BudgetYearOneBase": {
                                    "val": "47.793"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "672001"
                    },
                    "ProjectTitle": {
                        "val": "Next-Generation Sensors\/ASI"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "36.263"
                        },
                        "BudgetYearOneBase": {
                            "val": "36.263"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "20.488"
                        },
                        "BudgetYearThree": {
                            "val": "20.111"
                        },
                        "BudgetYearFour": {
                            "val": "24.009"
                        },
                        "BudgetYearFive": {
                            "val": "23.164"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY2021, PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related to Next Generation Sensors were transferred to Project 672001, (Next Generation Sensors)  in order to provide greater visibility and transparency. This project is not a new start."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Next Generation Sensors (NGS) project is developing, demonstrating, and maturing Intelligence, Surveillance, and Reconnaissance (ISR) sensor suites in a platform agnostic environment.  Designated as a Middle Tier Acquisition, Section 804 effort, these sensor suites will include open architectures to further enable platform mobility and tech refresh as well as Artificial Intelligence (AI) algorithms to enable assisted target detection and identification.  Efforts include but are not limited to, Triple Raven multi-GEOINT High Altitude Advanced Technology Demonstration, multi-INT Common Open Architecture Reconnaissance Program Standard (MI-COARPS), Assisted Target Recognition for ISR (ATRI), and radar open architecture development in support of ASARS-2B\/2C.\n\nNGS program efforts are set by capabilities gaps within the Challenging Targets Initial Capabilities Document and as approved by the Capabilities Decision Memorandum (Signed Jan 2019). These requirements have been further verified, modeled, and developed through the Airborne Sensors for ISR (ASI) Analysis of Alternatives (AoA) and the Triple Raven ATD, which was approved by the Advanced Technology Council (ATC) in FY19. \n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver technology and sensor capabilities.  The use of such program funds would be in addition to civilian pay expenses budgeted in program element 0605831F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Next Generation Sensors"
                                    },
                                    "Description": {
                                        "val": "Mold current and future ISR into a platform agnostic, non-proprietary, autonomous multi-INT cross cueing solution that is designed based on mission requirements. Sensors will have to penetrate up to highly contested domains and survive to operate. This project will also increase interoperability by developing common standards and interfaces for mission and sensor systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "36.263"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "36.263"
                                            },
                                            "Text": {
                                                "val": "- Will transition projects from AFRL and Imaging & Targeting Support into programs of record to include new technologies in sensors and ISR technologies.\n- Triple Raven Advanced Technology Demonstration \n- Execute prototyping and requirements development for next generation platform agnostic, high altitude, non-obscured long-standoff telescope, dual-band EO\/IR and multi-mode LiDAR prototype sensors. \n- Design and develop government owned, standards compliant sensor pods. \n- Develop specific Artificial Intelligence Target Recognition Algorithms for multi-mode, ISR platforms.  Develop synthetic data sets to increase algorithm effectiveness.  Maintain database of labeled data for assisted target recognition (ATR) community. Develop multi-INT Open Architecture processors and standards. \n- Mature open architectures for ISR systems including cybersecurity analysis, industry standardization, and open architecture demonstrations.\n- Begin integration of the dual-band EO\/IR system, open architecture ISR standards, and an open architecture aircraft pod."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased because PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related to Next-Generation Sensors were transferred to Project 672001, (Next-Generation Sensor) in order to provide greater visibility and transparency; and increased sensor development requirements for restoral of U-2 up to and through FY25."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "In FY2021, PE 0305206F, (Airborne Reconnaissance Systems), Project 672001, (Next Generation Sensor) received $18M in funds that were intended for PE 0305202F (Dragon U-2), Project 674820, (Sensor Development), per FY21 PBD.  Funds will be executed against U-2 avionics and sensor efforts under PE 0305202F (Dragon U-2)."
                        },
                        "AcquisitionStrategy": {
                            "val": "Next Generation Sensors is currently executing under a Section 804, Middle Tier Acquisition authority and is currently in the Rapid Prototyping (Alpha) phase.  Next Generation Sensors (Developed from and formerly known as ASI) is also utilizing Imaging and Targeting Support (I&TS) and other ISR programs to execute rapid Technology Maturation and Risk Reduction activities.  Next Generation Sensors is leveraging Advanced Technology Demonstration authority to mature and demonstrate cutting-edge sensor technology.  This program has established a forum consisting of multiple Other Government Agencies (OGAs), end users, and MAJCOMs to ensure that the program deliverables are answering identified warfighter needs, and have a clear transition path."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "In FY2021, PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related to Next Generation Sensors were transferred to Project 672001, (Next Generation Sensor) in order to provide greater visibility and transparency."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Triple Raven ATD"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Collins"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Westford, MA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "22.988"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "22.988"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government-owned Podded Solution"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ATRI"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Open Architecture"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "I&TS Technology Integration Efforts"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Gov't costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.275"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.275"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Next Generation Sensors"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Triple Raven ATD"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- CHASM Task Order #1 (NGS Telescope)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- CHASM Task Order #2 (NGS LIDAR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- CHASM Task Order #3 (Sensor Integration)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- CHASM Task Order #4 (EO\/IR & LIDAR Demo)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "AgilePod"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "ATRI"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Open Architecture"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- MITRE (MBSE & Studies)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- MIT\/LL (MI-COARPs)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GTRI (Cybersecurity)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "I&TS Technology Integration Efforts"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "672002"
                    },
                    "ProjectTitle": {
                        "val": "Agile ISR"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.342"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.342"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.495"
                        },
                        "BudgetYearThree": {
                            "val": "5.652"
                        },
                        "BudgetYearFour": {
                            "val": "6.744"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY2021, PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related to Agile ISR were transferred to Project 672002, (Agile ISR)  in order to provide greater visibility and transparency.  This project is not a new start."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Agile ISR BPAC matures, develops, and deploys projects started under the Imaging & Targeting Support (I&TS) program in support of current and future platform agnostic, non-proprietary, autonomous, multi-INT cross cueing ISR solutions based on Advanced Battle Management System (ABMS) and Joint All-domain Command and Control (JADC2) mission requirements. This includes, but is not limited to, Detection Removal and Characterization Operations (DRACO), support and development of AgilePod, and other projects. Portions of the developmental efforts under Agile ISR are classified.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver technology and sensor capabilities.  The use of such program funds would be in addition to civilian pay expenses budgeted in program element 0605831F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DRACO"
                                    },
                                    "Description": {
                                        "val": "Detection Removal and Characterization Operations (DRACO) is a robust Image Quality improvement capability for Airborne Synthetic Aperture Radar (SAR) products. The software resides in multiple locations on the ground supporting the Air Force, Army, Navy and other customers. DRACO efforts include but are not limited to development, design, fabrication, integration, demonstration, test, and transition of image quality improvement capabilities. This project originated under the I&TS program.  All other details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.342"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.342"
                                            },
                                            "Text": {
                                                "val": "- Will mature, develop and deploy DRACO capabilities in order to give the warfighter a more efficient and effective tool.\n- Will complete DRACO 5.0 efforts and initiating DRACO 6.0.\n- Will increase interoperability by developing common standards and interfaces.\n- Will increase access and expand user base."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased because PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related to Agile ISR were transferred to Project 672002, (Agile ISR)  in order to provide greater visibility and transparency."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Capabilities will be developed and integrated onto various platforms using an incremental acquisition approach. The projects will be executed and contracted with appropriate vendor(s) to deliver capability while driving competition where possible."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "In FY2021, PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related to Agile ISR were transferred to Project 672002, (Agile ISR)  in order to provide greater visibility and transparency."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DRACO"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "King of Prussisa, PA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.312"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.312"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Management Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.030"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.030"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Agile ISR"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "DRACO 5.0"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "DRACO 6.0"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "672003"
                    },
                    "ProjectTitle": {
                        "val": "Sensors Open System Architecture"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.891"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.891"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.745"
                        },
                        "BudgetYearThree": {
                            "val": "0.766"
                        },
                        "BudgetYearFour": {
                            "val": "0.914"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY2021, PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related to System Open System Architecture were transferred to Project 672003, (Sensor Open System Architecture)in order to provide greater visibility and transparency. This project is not a new start."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Sensors Open System Architecture (SOSA) project coordinates the advanced technologies open architecture development for modalities of sensors, such as: RADAR, SIGINT, EW, Communications and EO\/IR (development of standards and open architecture interfaces for Software, Hardware, and Electrical\/Mechanical interfaces) in support of multiple airborne reconnaissance platforms, both manned and unmanned. Its objectives are to develop, demonstrate, and rapidly upgrade\/iterate advanced, interoperable, multi-platform solutions to reduce the find, fix, target, and track kill chain timeline, and to provide safe separation and collision avoidance for remotely piloted aircraft through development of abstraction interfaces for sense (such as RADAR, ADS-B, TCAS, Next Generation Sensors, ASIP, and ASARS) and avoid logic. \n\nThis project also coordinates the development of common collection, processing, and dissemination solutions for near-real time intelligence, surveillance, and reconnaissance. The SOSA project also increases interoperability by developing common standards and interfaces, as well as leveraging industry participation toward creating COTS solutions such as common C4ISR processor, AgilePOD interfaces, Red\/Black separation on the sensor, data at rest, and security\/AT with industry partners and other DoD services. \n\nThis project is designed to support development of the Next Generation Sensors program, as well as other AFLCMC\/WI emerging and program of record needs. As part of the development effort SOSA will be funding and supporting first article development of key open architecture solutions to validate\/verify open specifications as well as to prime the COTS vendors development strategies. The SOSA effort has stood up AFLCMC SIL (System Integration Laboratory) for Sensors Open System Architectures in order to establish a strong conformance\/compliance program with industry partners for COTS products, in partnership with other DoD services.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver technology and sensor capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sensors Open System Architecture"
                                    },
                                    "Description": {
                                        "val": "The Sensors Open System Architecture (SOSA) project coordinates the advanced technologies open architecture development for modalities of sensors, such as: RADAR, SIGINT, EW, Communications and EO\/IR (development of standards and open architecture interfaces for Software, Hardware, and Electrical\/Mechanical interfaces) in support of multiple airborne reconnaissance platforms, both manned and unmanned."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.891"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.891"
                                            },
                                            "Text": {
                                                "val": "- Will support of RPA Sense and Avoid Technology (C-ABSAA Technology Maturation & Risk Reduction Phase)\n- Will develop prototype of SOSA SAR\/SIGINT capability\n- Will develop AgilePod internal electrical\/mechanical interfaces\n- Will work with other Services in producing SOSA V 1.0 snapshots based on current set of USAF needs\n- Will support EO\/IR article prototyping\n- Will prepare and host industry and DOD partner interoperability demonstrations"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased because PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related to System Open System Architecture were transferred to Project 672003, (Sensor Open System Architecture)  in order to provide greater visibility and transparency."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Coalition of Industry, DoD, and OGA partnerships to develop Open Architecture specifications to support ACC and AFLCMC requirements for next generation sensors. At key specification milestones such as completion of incremental updates to SOSA a set of prototype activities will be generated to validate\/verify solution, reduce risk to adopting programs and prime the industry investments."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "In FY2021, PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related to System Open System Architecture were transferred to Project 672003, (Sensor Open System Architecture)in order to provide greater visibility and transparency."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Sensors Open System Architecture Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.891"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.891"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration (PMA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Sensors Open System Architecture"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Technical Standard Publications (Semi-Annual Deliveries)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SOSA Demonstration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SIL Activites"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "674818"
                    },
                    "ProjectTitle": {
                        "val": "Imaging and Targeting Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "133.309"
                        },
                        "CurrentYear": {
                            "val": "29.729"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "27.456"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY2021, all funds in PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related to NGS, Agile ISR, SOSA, and ASARS were transferred to Project 672001 (Next-Generation Sensors\/ASI), Project 672002, (Agile ISR), Project 672003 (Sensors Open System Architecture), and Project 674820 (Sensor Development) in order to provide greater visibility and transparency."
                        },
                        "ProjectMissionDescription": {
                            "val": "The I&TS purpose is to develop, mature, demonstrate, and rapidly transition next-generation, persistent, wide area surveillance and common imagery reconnaissance sensor capabilities (active and passive systems), including sensor data processing, for multiple airborne platforms, as well as sensor products to aid in rapid targeting (geolocation models, sensor-based exploitation tools, sensor networking capabilities).\n\nDevelopmental efforts pursued include but are not limited to: Radar, Electro-Optical\/Infrared, hyperspectral imagery (HSI), Lidar\/Ladar, and other technologies to improve measurement and signature intelligence, polarimetric imaging, ground moving target indicator (GMTI), maritime search\/track, foliage penetration, nuclear event detection, and other modalities; increased geolocation accuracy; increased dismount detection capability; advanced sensor data correlation; automated target detection; network centric warfare; and other ISR and associated planning and direction; collection; processing and exploitation; analysis and production; and dissemination capabilities. These efforts are intended to reduce both target search and kill chain timelines as well as supporting traditional intelligence activities. This project will also increase interoperability by developing common standards and interfaces.\n\nThe funds in this project are distributed in priority order, as supported by the Challenging Targets Initial Capabilities Document and set by the GCWG, for the goal of building a comprehensive GEOINT capability for the USAF. On an annual basis, developmental technologies are reviewed against warfighter capabilities and requirements based on strategic roadmaps and the results of the ASI AoA as prefaced in the Challenging Targets Initial Capabilities Document. Efforts advancing the technological maturity of promising sensors and processing capabilities are reviewed and prioritized into a recommended list for senior executive direction to implement in the coming year. \n\nActivities also include studies and analysis to support both current program planning and execution and future program planning. \n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver technology and sensor capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Sensor Open System Architecture (SOSA)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "- Continue work with other Services in producing SOSA snapshots based on current set of USAF needs."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Agile ISR"
                                    },
                                    "Description": {
                                        "val": "Mold current and future ISR into a platform agnostic, non-proprietary, autonomous Multi-INT fusion and cross cuing solution that is designed based on mission requirements.  Sensors will have to penetrate up to highly contested domains and survive to operate. This project will also increase interoperability by developing common standards and interfaces for mission and sensor systems. Through the AoA execution, the solution set will improve requirements and the development path for High Altitude SAR (ASARS), Next Generation Sensors, DRACO, SOSA, as well as other GCWG approved projects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "109.390"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.404"
                                            },
                                            "Text": {
                                                "val": "- Continue Section 804 efforts and execute various ATD efforts including, but not limited to Triple Raven which supports Tech Maturation and Risk Reduction (TMRR),\n- M&S to advance current and future ISR into a platform agnostic, non-proprietary, autonomous Multi-INT fusion and cross cuing solution that is designed based on mission requirements. \n- Includes but not limited to Next Generation Sensors, Detection Removal and Characterization Operation (DRACO), Sensor Open System Architecture (SOSA), and other GCWG approved projects. \n- Continue working interoperability by developing common standards and interfaces.\n- Continue support of C-ABSAA Technology Maturation and risk reduction phase \n- Continue first article development of SOSA, SAR\/SIGINT prototype\n- Continue support development of AgilePOD internal electrical\/mechanical interfaces\n- Continue further work with other Services in producing SOSA V 1.0 snapshots based on current set of USAF needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- Agile ISR, Next Generation Sensors and Sensors Open System Architecture will be transferred to individual Projects within PE0305206F in order to provide greater visibility and transparency into these activities. These transferred efforts will not be new starts.  The new Projects are:\n-- Next Generation Sensors, Project 672001\n-- Agile ISR, Project 672002\n-- Sensors Open System Architecture, Project 672003"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreased because PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related to NGS, Agile ISR, and SOSA were transferred to Project 672001 (Next-Generation Sensors\/ASI), Project 672002, (Agile ISR) and Project 672003 (Sensors Open System Architecture) in order to provide greater visibility and transparency."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ASARS-2B"
                                    },
                                    "Description": {
                                        "val": "Develop\/design\/fabricate\/integrate\/demonstrate\/test and field deep look high altitude ISR radar capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.919"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.325"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop\/design\/fabricate\/integrate\/demonstrate\/test and field deep look high altitude ISR radar capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- ASARS efforts realigned to Project 674820 Sensor Development for consolidation and clarity of reporting."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreased because PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related ASARS-2B were transferred to Project 674820, (Sensors Development) in order to provide greater visibility and transparency."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE 07 0305202F"
                                    },
                                    "Title": {
                                        "val": "Dragon U-2"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "87.618"
                                        },
                                        "CurrentYear": {
                                            "val": "36.389"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "A portion of the funding within the U-2 RDT&E line will be used to advance ASARS development\/design\/fabrication\/integration\/demonstration\/testing and fielding deep look high altitude ISR radar capabilities."
                        },
                        "AcquisitionStrategy": {
                            "val": "Imaging and Targeting Support and Agile ISR efforts are prioritized on an annual basis by the GCWG, in accordance with the validated gaps in the Challenging Targets Initial Capabilities Document. Resulting funded efforts are then contracted for and\/or executed by either various program offices, laboratories, industry, and\/or other government agencies.\n\nASARS \/ High Altitude SAR technology maturation is conducted by Air Force Life Cycle Management Center\/Intelligence, Surveillance, and Reconnaissance and Special Operations Forces (AFLCMC\/WIN), in conjunction and cooperation with AFLCMC\/HBG (Robins AFB) for test support.\n\nAcquisition strategy is to maximize commercial and national development efforts and investment through multiple contracting methods, including the use of engineering change proposals to modify existing contracts and new contracts that were awarded both competitively or on a sole source basis."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "In FY2019, The 267 line was rescinded -$26M amount in FY19 of the FY20 HR1158 Appropriations Bill and is not reflected in this document.  The rescission was applied towards the Aether Spy effort, but still listed due to technical error from PRCP transfer.\n\nIn FY2021, all funds in PE 0305206F, (Airborne Reconnaissance Systems), Project 674818, (Imaging and Targeting Support) efforts related to NGS, Agile ISR, SOSA, and ASARS were transferred to Project 672001 (Next-Generation Sensors\/ASI), Project 672002, (Agile ISR), Project 672003 (Sensors Open System Architecture), and Project 674820 (Sensor Development) in order to provide greater visibility and transparency."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SOSA"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "13.523"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.683"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.206"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DRACO"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "King of Prussisa, PA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.849"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.721"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.570"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ASARS-2B EMD"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "13.481"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "17.831"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "31.312"
                                                    },
                                                    "TargetValue": {
                                                        "val": "170.430"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Triple Raven ATD"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Collins"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Westford, MS"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "67.092"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "67.092"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Aether Spy"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "33.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "33.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.130"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.130"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Govt Cost"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.364"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.364"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.728"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Imaging and Targeting Support"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Advance Airborne PCPAD Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- SOSA"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- DRACO"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ASARS-2B"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "ASARS-2B EMD"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- NRE Contract Award (Feb 2019)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- PDR (Dec 2019)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- CDR (Apr 2020)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Sensors"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "- Triple Raven ATD"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- Aether Spy"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "674820"
                    },
                    "ProjectTitle": {
                        "val": "Sensor Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "43.681"
                        },
                        "CurrentYear": {
                            "val": "82.724"
                        },
                        "BudgetYearOne": {
                            "val": "62.914"
                        },
                        "BudgetYearOneBase": {
                            "val": "62.914"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "24.287"
                        },
                        "BudgetYearThree": {
                            "val": "24.789"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "238.395"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This program, BA 7, PE 0305206F, project 674820, Advanced Synthetic Aperture Radar System (ASARS)-2C (back-end), is a new start."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Sensors Development project increases the range and collection capability, interoperability and processing of the Advanced Synthetic Aperture Radar Systems (ASARS) through design, development, testing, and fielding efforts.  The Sensors Development efforts advance the capability of ASARS for U-2 employment, and is a critical component for the multi-INT Next Generation Sensors, project 672001, efforts.  ASARS-2B (front-end) & ASARS-2C (back-end) efforts provide critical advancements and risk reduction in SAR\/Moving Target Indication capability to be implemented in the future multi-INT, platform agnostic capability that Next Generation Sensors will provide. \n\nThe ASARS effort is a fifth generation, deep-look, high-altitude, ISR radar that is the foundation for the radar component of the Next Generation Sensors (NGS) family of systems as outlined in the  AFROC approved ASARS-2C draft Capabilities Development Document (CDD).  ASARS-2B (front-end) is the antenna and receiver exciter replacement.  The ASARS-2C (back end) data processing efforts extend the ASARS-2B (front-end) radar capability using open architecture data processing and multi-platform integration.  Open architecture improves performance and lowers cost by facilitating and enabling qualified third party software vendors to incorporate future multi-ISR capability to advance interoperability across joint operations. ASARS increases current capability and addresses National Defense Strategy Key Operational Problems and ISR Dominance flight plan.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver technology and sensor capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Synthetic Aperture Radar System (ASARS)-2B (front-end)"
                                    },
                                    "Description": {
                                        "val": "Develop, design, fabricate, integrate, test and field deep look high altitude ISR radar capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "43.681"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "82.724"
                                            },
                                            "Text": {
                                                "val": "- Develop, design, fabricate, integrate, test and field deep look high altitude ISR radar capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "60.914"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "60.914"
                                            },
                                            "Text": {
                                                "val": "- Will continue to develop, design, fabricate, integrate, test and field deep look high altitude ISR radar capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreased due to funding alignment with Air Force priorities and some related efforts funded through Project 672001, (Next-Generation Sensors)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Synthetic Aperture Radar System (ASARS)-2C (back-end)"
                                    },
                                    "Description": {
                                        "val": "Integrate open radar processing architectures for enhanced RF capabilities and third party mode\ndevelopment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "- Will mature standards and technologies, and develop acquisition strategy for start in FY2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased due to start of ASARS-2C (back-end) efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE 07 0305202F"
                                    },
                                    "Title": {
                                        "val": "Dragon U-2 (JMIP)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "87.618"
                                        },
                                        "CurrentYear": {
                                            "val": "36.389"
                                        },
                                        "BudgetYearOne": {
                                            "val": "18.660"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "18.660"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.319"
                                        },
                                        "BudgetYearThree": {
                                            "val": "19.813"
                                        },
                                        "BudgetYearFour": {
                                            "val": "20.167"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 06 0305206F"
                                    },
                                    "Title": {
                                        "val": "Airborne Reconnaissance Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "48.138"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "48.138"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "72.268"
                                        },
                                        "BudgetYearThree": {
                                            "val": "28.071"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.860"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.593"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "176.930"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "A portion of the funding within the U-2 RDT&E line will be used to advance ASARS development \/ design\/fabrication\/integration\/demonstration\/testing and fielding deep look high altitude ISR radar capabilities.\nIn FY19\/FY20, a portion of funding within project 674818 (Imaging and Targeting Support) is being used to advance ASARS-2B (front-end) efforts."
                        },
                        "AcquisitionStrategy": {
                            "val": "ASARS \/ High Altitude SAR technology maturation is conducted by Air Force Life Cycle Management Center\/Intelligence, Surveillance, and Reconnaissance and Special Operations Forces (AFLCMC\/WIN), in conjunction and cooperation with AFLCMC\/HBG (Robins AFB) for test support.\nAcquisition strategy is to maximize commercial and national development efforts and investment through multiple contracting methods, including but not limited to the use of engineering change proposals to modify existing contracts and new contracts that were awarded both competitively or on a sole source basis."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "ASARS-2C, due to the competitive contracting method, it is unknown at this point who the winning contractor will be."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "ASARS-2B (front-end)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "43.681"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "82.724"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "57.005"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "57.005"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ASARS-2C (back-end)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Unknown"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Not specified."
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.909"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.909"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "ASARS-2B"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "ASARS-2B EMD"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-- NRE Contract Award (Feb 2019)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-- PDR (Dec 2019)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-- CDR (Apr 2020)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-- Testing (Combined Developmental\/Operational)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ASARS-2C"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "ASARS-2C"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-- Tech Maturation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-- NRE Contract Award (Dec 2021)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-- Testing (Combined Developmental\/Operational)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675092"
                    },
                    "ProjectTitle": {
                        "val": "JTC\/SIL MUSE"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.454"
                        },
                        "CurrentYear": {
                            "val": "3.521"
                        },
                        "BudgetYearOne": {
                            "val": "3.574"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.574"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.647"
                        },
                        "BudgetYearThree": {
                            "val": "3.713"
                        },
                        "BudgetYearFour": {
                            "val": "3.779"
                        },
                        "BudgetYearFive": {
                            "val": "3.848"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Multiple Unified Simulation Environment (MUSE) is the DoD flight simulation\/training system of choice for many Unmanned Aircraft Systems (UAS), RPA, and airborne platforms.  MUSE is also known as the Air Force Synthetic Environment for Reconnaissance and Surveillance (AFSERS) in its Air Force training application. The MUSE\/AFSERS is a software suite that simulates UAS\/RPA (e.g., MQ-9) systems, tailored air vehicle & data links, and visualization systems used for payload product outputs-including Full Motion Video (FMV), Fixed Frame Imagery (FFI), Ground Moving Target Indicator (GMTI) data, and Link 16 (J2.2 and J3.5) tracking messages.  Outputs are compliant with applicable DoD standards and are continually tested against actual ground data processors to ensure DoD systems interoperability.  \n\nThe Services and Combatant Commanders have a requirement for training with a system that provides a real-time simulation environment containing multiple domain systems that can be integrated with larger force-on-force simulations.  The MUSE creates a realistic operational environment supporting military utility assessment, architecture, and employment concept development.  Training, Tactics, Techniques and Procedures (TTP) refinement, practice Processing, Exploitation and Dissemination (PED) of multi-domain information.  Conduct emerging concepts experimentation, optimizing Command, Control, Communications, and Computing (C4) with warfighting exercises and experiments. MUSE is the preferred UAS\/RPA simulation system used by US Combatant Commanders and Joint Services to support command and battle staff C4 training.\n\nThe MUSE also creates a realistic operational environment that supports: an embedded training capability for new UAS\/RPA system Program Managers; tools to minimize acquisition and life cycle cost and schedule impacts.  MUSE conducts emerging concepts experimentation, future systems exploration, systems integration, and technology insertion; applications for Joint and Service-specific warfighting exercises; and C4 training optimization.\n\nMUSE is currently used by all Services and most unified commands simulating MQ-1, MQ-9, RQ-4, MQ-1C, M\/RQ-5, RQ-7, national and commercial satellite systems, P-3, E-8 and the U-2 during warfighting exercises.  The AFSERS provides National Imagery Transmission Format (NITF) information for simulated data collection systems, supporting PED training.  The MUSE is also used as a mission rehearsal tool for current, on-going military combat operations.  Most of the MUSE\/AFSERS software suite components are also used in multiple airborne platform system training devices.  Including the MQ-9 [Medium Altitude Long Endurance Tactical (MALET) JSIL Aircrew Trainer (MJAT)] and RQ-4 [Global Hawk Sensor Operator Part Task Trainer (GHSOPTT), and Global Hawk Weapon System Trainer (WST)].\n\nThe Joint Technology Center\/Systems Integration Laboratory (JTC\/SIL) is the training center of excellence supporting UAS and RPA programs for the Services.  JTC\/SIL provides the system engineering, test and integration, interoperability, rapid technology insertion to address MUSE training requirements.  The JTC\/SIL combines the UAS\/RPA knowledge of communications standards (such as STANAGs 4586, 4607, 4545 and 4609) with Hardware in the Loop (HIL) testing, MUSE, integrating with other DoD modeling and simulation (M&S) architectures.  For those airborne assets normally not available for training, the JTC\/SIL provides surrogate systems and interfaces.  The JTC\/SIL contributes to the distributed training environments, virtually linking participants from various locations worldwide, and are routinely supported within the MUSE architecture.  The JTC\/SIL continues to develop leading edge technologies supporting the rapidly evolving UAS\/RPA training requirements required to support NDS future fighting force.\n\nMUSE project funds may be utilized to cover the GCWG Secretariat, studies and analysis activities, supporting current program planning, execution, and future program planning.  \n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver technology and sensor capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Force Synthetic Environment for Reconnaissance and Surveillance (AFSERS) Development"
                                    },
                                    "Description": {
                                        "val": "DoD's simulation\/training system of choice for Intelligence Surveillance and Reconnaissance (ISR)systems, sensors, and platforms. Includes AFSERS, Common Ground Station Interface, and infrastructure support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.454"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.521"
                                            },
                                            "Text": {
                                                "val": "- Development and release of MUSE\/AFSERS RPA and ISR simulation capability supporting theater level exercises such as Dong Maeng (formerly Ulchi Freedom Guardian and Key Resolve), Yama Sakura, Talisman Saber, Pacific Sentry, Austere Challenge, and associated events.\n- Continue incorporation of mandated Cyber Security updates.\n- Develop higher fidelity in the Moving Target Indicator payload model into MUSE\/AFSERS\n- Develop and integrate multi-sensor full motion video (FMV) payload simulations to support training missions\n- Complete the redesign of Connect and Netlink routing software to improve network routing and large data feeds, be web browser accessible, and incorporate the use of Windows Active Directory authentication.\n- Continue the re-architecture of Vignette Planning & Rehearsal Software (ViPRS) capability.\n- Continue software architecture optimization and modularization, to facilitate extensibility and scalability.\n- Extend current Link 16 simulation capabilities to include surface tracks (J3.3).\n- Conduct an image generator trade study to determine the best image generator to meet USAF training requirements of the future, to include investigating the use of \"Gaming Engine\" based Image Generation capability such as Unreal4.\n- Begin development the simulated GPS jamming effects on aircraft systems.\n- Improve Moving Target Indicator\/Synthetic Aperture Radar payload models into MUSE\/AFSERS\n- Continue integration testing with designated federations (ASCCE, JLVC, JLCCTC) ensuring joint interoperability with services and JS\/J7 capabilities.  \n- Complete certification and interoperability requirements of AFSERS components to run on the Distributed Mission Operations Network (DMON)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.574"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.574"
                                            },
                                            "Text": {
                                                "val": "JTC\/SIL will:\n- Continue development and release of MUSE\/AFSERS RPA and ISR simulation capability supporting theater level exercises such as Dong Maeng (formerly Ulchi Freedom Guardian and Key Resolve), Yama Sakura, Talisman Saber, Pacific Sentry, Austere Challenge, and associated events.\n- Continue incorporation of mandated Cyber Security updates.\n- Complete the re-architecture of Vignette Planning & Rehearsal Software (ViPRS) capability to include transitioning it to be web browser accessible, developing an after action report (AAR) capability, and more realistic attrition.\n- Continue architecture software optimization and modularization to facilitate extensibility and scalability.\n- Begin prototype development of an improved image generator based upon the results of the image generator trade study conducted during FY20.\n- Fully integrate the high fidelity SAR model into the MUSE\/AFSERS baseline which provides realistic SAR imagery based upon material encoded terrain.\n- Fully integrate MTI\/SAR sensor cross-cuing capability in MUSE\/AFSERS.\n- Develop and integrate low-cost, fixed-wing support to RPA operations.\n- Integrate a Vehicle and Dismount Exploitation Radar (VADER) sensor model in MUSE\/AFSERS.\n- Begin development of the Long Range Radar (LRR) sensor MUSE\/AFSERS model.\n- Develop IFF Modes 4, 5, & S in MUSE\/AFSERS.\n- Continue integration testing with designated federations (ASCCE, JLVC, JLCCTC) ensuring joint interoperability with services and JS\/J7 capabilities.\n- Assess services and Joint Staff emerging environments and the impact to MUSE\/AFSERS integration and interoperability"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased due to small inflation increase"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE 07 PE 0305204A"
                                    },
                                    "Title": {
                                        "val": "Tactical Unmanned Aerial Vehicles"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.748"
                                        },
                                        "CurrentYear": {
                                            "val": "4.954"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.833"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.833"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.327"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.244"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.099"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This is an enterprise services effort, jointly funded and centrally managed by the US Army.   AFLCMC\/WIN MIPRs funds in support of Unmanned Aircraft Systems modeling and simulation efforts. JTC\/SIL falls under US Army Futures Command.  The Air Force POC is Dr. Lillian-Campbell from AF Agency for Modeling & Simulation which falls under HAF\/A3T."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AFSERS Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Redstone Arsenal"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.454"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.521"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.574"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.574"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "JTC\/SIL MUSE"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "AFSERS Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675291"
                    },
                    "ProjectTitle": {
                        "val": "Gorgon Stare"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.000"
                        },
                        "CurrentYear": {
                            "val": "15.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Gorgon Stare system is a podded airborne sensor suite that provides city-sized wide area airborne surveillance and is integrated on specially-modified MQ-9 Reaper RPA. The Air Force Requirements Oversight Council (AFROC) approved Air Combat Command's recommendation to transition Gorgon Stare from a Quick Reaction Capability (QRC) to an Air Force Enduring Capability in November 2014. Gorgon Stare's requirements are documented in the Gorgon Stare Wide Area Airborne Sensor Capabilities Production Document (draft). The acquisition strategy for this Air Force podded sensor suite solution is sustainment of the currently fielded capabilities with any upgrades implemented via validated -1067s or Urgent Operational Needs.\n\nDevelopment efforts conducted with FY 2015 Congressionally-added funds included efforts focused primarily on the development of a Beyond Line of Sight (BLOS) capability in support of an Urgent Operational Need. Development efforts conducted with FY 2016 Congressionally-added RDT&E funds included further development and system integration lab testing of Near Vertical Direction Finding (NVDF) with Gorgon Stare Increment 2 Wide Area Motion Imagery (WAMI) sensors. Funds spent on NVDF will provide a ramp for future airborne integration efforts as required. Development efforts conducted with FY 2017 Congressionally-added funds further progressed efforts associated with BLOS, to include first article testing for phase 1 and a limited BLOS capability delivered to the field in FY2019. Development efforts conducted with FY 2018 Congressional added funds included further development of the next phase of BLOS to enable freedom of maneuverability and development of system imagery improvements. Development efforts conducted with FY 2019 Congressionally added funds included completion of BLOS Phase II system design and aircraft certification to enable full freedom on maneuverability, completing imagery improvements and continuation of data automation through Area of Interest (AOI) tagging and tracking efforts. Development efforts to be conducted with FY2020 Congressionally added funds include but are not limited to continuation of tagging and tracking efforts, development of an electro-optical (EO)\/infrared (IR) fusion capability, and development of tip and cue airborne cueing.\n\nActivities also include studies and analysis to support both current program planning and execution as well as future program planning.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver Gorgon Stare capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Gorgon Stare"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "- BLOS Phase II pod system design approved and ground testing initiated."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "- Will continue tagging and tracking development efforts, development of an EO\/IR fusion capability, and development of tip and cue airborne cueing."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF 05 PRDTB3"
                                    },
                                    "Title": {
                                        "val": "MQ-9 UAS Payloads"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.000"
                                        },
                                        "CurrentYear": {
                                            "val": "19.800"
                                        },
                                        "BudgetYearOne": {
                                            "val": "46.100"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "46.100"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "88.900"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 06 PRDTB3"
                                    },
                                    "Title": {
                                        "val": "Gorgon Stare"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.500"
                                        },
                                        "CurrentYear": {
                                            "val": "1.500"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.700"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "10.700"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "19.700"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The wide area airborne surveillance requirement is being delivered via the Gorgon Stare podded wide area motion imagery sensor suite integrated on dedicated, specially-modified MQ-9 Reaper RPA. Gorgon Stare transitioned from a QRC to an Air Force Enduring Capability under AFROC authority in November 2014. The program is executed by the 645th Aeronautical Systems Group, Intelligence, Surveillance, and Reconnaissance and Special Operations Forces Directorate as a post-MS C program. The sensor suite will be sustained in its current configuration. Any future capability upgrades will be fielded as a result of validated -1067s or Urgent Operational Needs."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Gorgon Stare System Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Sierra Nevada Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sparks, NV"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "15.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "25.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Gorgon Stare"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "EO\/IR Co-Collect"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Tagging and Tracking Full Field of View"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Tip and Cue\/Airborne Cueing Phase 2"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Gorgon Stare will continue operations as required using sustainment funding."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "676025"
                    },
                    "ProjectTitle": {
                        "val": "Data Compression"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.879"
                        },
                        "CurrentYear": {
                            "val": "6.935"
                        },
                        "BudgetYearOne": {
                            "val": "9.528"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.528"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "11.696"
                        },
                        "BudgetYearThree": {
                            "val": "12.825"
                        },
                        "BudgetYearFour": {
                            "val": "7.914"
                        },
                        "BudgetYearFive": {
                            "val": "8.060"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "RDUCE provides efficient and integrated compression of airborne Intelligence, Surveillance, and Reconnaissance (ISR) sensor data, maximizing the use of limited bandwidth and delivering more data to the tactical user in the field. RDUCE develops, tests, and implements new sensor data compression algorithms for current and emerging airborne ISR sensors. The program develops compression capabilities for manned and unmanned airborne platforms, associated ground stations, and the Distributed Common Ground System (DCGS). Outputs will meet standard certification for use within the Department of Defense and Intelligence Community (IC) Geospatial Intelligence (GEOINT), Signals Intelligence (SIGINT), and Measurement and Signatures Intelligence (MASINT) compression applications. \n\nActivities also include continuous studies, analysis and updates to support program planning and execution. \n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver technology and sensor capabilities.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Data Compression"
                                    },
                                    "Description": {
                                        "val": "The Data Compression effort provides the warfighter capabilities to efficiently compress ISR data and to enable dissemination in near real time to tactical users through bandwidth limited dissemination systems. The program focuses on current and emerging ISR sensors, including incorporation into open architectures like Common Open Architecture Radar Programs (COARPs), Future Airborne Capability Environment (FACE), and Sensor Open System Architecture (SOSA). The algorithms can be leveraged for any platform. For example, the HSI algorithm was selected by NASA to be included in an experimental system on the ISS. Outputs will meet standards certification for use within the DoD Geospatial Intelligence, Signals Intelligence and Measurement and Signatures Intelligence data compression applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.879"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.935"
                                            },
                                            "Text": {
                                                "val": "- For mature algorithms (e.g. SAR, Hyper-Spectral Imagery (HSI), SAR Phase History) optimize software reference implementations,  provide integration assistance, and SME support to platforms\/sensors (e.g. ASARS, MP-RTIP\/EISS, others) seeking to adopt the algorithm(s)  \n- For less mature algorithms (e.g. SIGINT, LIDAR, and EO\/IR) refine the algorithms, identify platform and exploitation partners for initial testing, and analyze results in an operationally representative environment\n- Publish and update compressed SAR and HSI samples to promote standards acceptance\n- Publish initial SAR Phase History draft standard and begin the process of formal acceptance through relevant and\/or appropriate standards bodies \n- Incorporate the TRL mature algorithms into DoD open architectures such as SOSA, Open Mission Systems (OMS), COARPs, and FACE"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.528"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.528"
                                            },
                                            "Text": {
                                                "val": "- Will provide continuous updates and integration support for the mature TRL modalities (SAR, HSI, SAR Phase History) \n- Will finalize SAR Phase history standard for formal adoption\n- Will complete initial development of LIDAR and SIGINT modalities \n- W identify platform\/sensor partners for initial test\/integration\n- Will begin feature updates to address any issues or previously uncaptured use cases to ensure the compression algorithms are operationally relevant\n- Will begin studies and initial development of EO\/IR compression algorithms"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased due to additional sensor modes added to the Data Compression portfolio."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "In FY21\/22\/23, Project 676025-Data Compression, is adding additional sensor modes to its portfolio each year."
                        },
                        "AcquisitionStrategy": {
                            "val": "Data Compression program is conducted by Air Force Life Cycle Management Center\/ Intelligence, Surveillance, and Reconnaissance and Special Operations Forces (AFLCMC\/WIN).  Acquisition strategy is to develop data compression hardware\/software, and data compression standards for various ISR applications to include airborne, ground stations, data storage facilities, and exploitation tools.  RDUCE will utilize existing contracts with full and open competition where appropriate. Integration will be accomplished by the requisite program offices."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "LIDAR"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SIGzip Phase II"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "EO\/IR"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.786"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.786"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Standardization Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.427"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.427"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Standardization Development (FLEX)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Standardization Development (SARzip)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.690"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.690"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Standardization Development (zPHD)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "ADDA Lab"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.750"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "COMPASE Lab"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Govt Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.852"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.885"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.152"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.152"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "RDUCE"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "-LIDAR"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-EO\/IR"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-SIGzip Phase II"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-COMPASE Lab"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "ADDA Lab"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Standardization Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Standardization Development (SARzip)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Standardization Development (FLEX)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Standardization Development (zPHD)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}