{
    "id": "2021-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-9791cb30a17933e364f6388e243081e196aa85793c267cee3ac7042f1c1057a0-12",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603766E"
        },
        "ProgramElementTitle": {
            "val": "NETWORK-CENTRIC WARFARE TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "58"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "413.948"
            },
            "CurrentYear": {
                "val": "507.424"
            },
            "BudgetYearOne": {
                "val": "661.158"
            },
            "BudgetYearOneBase": {
                "val": "661.158"
            },
            "BudgetYearTwo": {
                "val": "647.113"
            },
            "BudgetYearThree": {
                "val": "545.081"
            },
            "BudgetYearFour": {
                "val": "475.012"
            },
            "BudgetYearFive": {
                "val": "437.982"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Network-Centric Warfare Technology Program Element is budgeted in the Advanced Technology Development budget activity because it addresses high payoff opportunities to develop and rapidly mature advanced technologies and systems required for today's network-centric warfare concepts.  It is imperative for the future of the U.S. forces to operate flawlessly with each other, regardless of which services and systems are involved in any particular mission.  The overarching goal of this program element is to enable technologies at all levels, regardless of service component, to operate as one system.\n\nThe objective of the Joint Warfare Systems project is to create enabling technologies for seamless joint operations, from strategic planning to tactical and urban operations.  Joint Warfare Systems leverage current and emerging network, robotic, and information technology and provide next generation U.S. forces with greatly increased capability, lethality, and rapid responsiveness.  Critical issues facing this project are: (1) U.S. opponents using systems that are flexible, robust, and difficult to neutralize; and (2) U.S. doctrine that limits the use of firepower to lessen the impact of operations on noncombatants.  These problems are magnified in urban and semi-urban areas where combatants and civilians are often co-located and in peacekeeping operations where combatants and civilians are often indistinguishable.  Meeting these challenges places a heavy burden on joint war planning.  Understanding opponent networks is essential so that creative options can be developed to counter their strategies.  Synchronization of air and ground operations to apply force only where needed and with specific effects is required.\n\nThe Maritime Systems project is identifying, developing and rapidly maturing critical advanced technologies and system concepts for the naval forces' role in today's network centric warfare concept.  Improvements in communications between and among submarines, surface ships and naval aircraft have allowed these forces to operate seamlessly with each other and with other Service's network centric systems.  Naval forces will play an ever-increasing role in network centric warfare because of their forward deployed nature, their unique capability to operate simultaneously in the air, on the sea and under the sea, and their versatile ability to provide both rapid strike and project-sustained force.  The technologies developed under this project will capitalize on these attributes, improve them and enable them to operate with other network centric forces."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "434.069"
                },
                "CurrentYear": {
                    "val": "512.424"
                },
                "BudgetYearOne": {
                    "val": "447.162"
                },
                "BudgetYearOneBase": {
                    "val": "447.162"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "413.948"
                },
                "CurrentYear": {
                    "val": "507.424"
                },
                "BudgetYearOne": {
                    "val": "661.158"
                },
                "BudgetYearOneBase": {
                    "val": "661.158"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-20.121"
                },
                "CurrentYear": {
                    "val": "-5.000"
                },
                "BudgetYearOne": {
                    "val": "213.996"
                },
                "BudgetYearOneBase": {
                    "val": "213.996"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-5.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-5.525"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-14.596"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "213.996"
                                },
                                "BudgetYearOneBase": {
                                    "val": "213.996"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019:  Decrease reflects reprogrammings and the SBIR\/STTR transfer.\nFY 2020:  Decrease reflects congressional reduction. \nFY 2021:  Increase reflects expansion of experimentation programs, maritime efforts and classified programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "NET-01"
                    },
                    "ProjectTitle": {
                        "val": "JOINT WARFARE SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "100.528"
                        },
                        "CurrentYear": {
                            "val": "99.487"
                        },
                        "BudgetYearOne": {
                            "val": "148.199"
                        },
                        "BudgetYearOneBase": {
                            "val": "148.199"
                        },
                        "BudgetYearTwo": {
                            "val": "130.697"
                        },
                        "BudgetYearThree": {
                            "val": "151.941"
                        },
                        "BudgetYearFour": {
                            "val": "168.992"
                        },
                        "BudgetYearFive": {
                            "val": "197.352"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The objective of the Joint Warfare Systems project is to create enabling technologies for seamless joint operations, from strategic planning to tactical and urban operations.  Joint Warfare Systems leverage current and emerging network, robotic, and information technology and provide next generation U.S. forces with greatly increased capability, lethality, and rapid responsiveness.  Critical issues facing this project are: (1) U.S. opponents using systems that are flexible, robust, and difficult to neutralize; and (2) U.S. doctrine that limits the use of firepower to lessen the impact of operations on noncombatants.  These problems are magnified in urban and semi-urban areas where combatants and civilians are often co-located and in peacekeeping operations where combatants and civilians are often indistinguishable.  Meeting these challenges places a heavy burden on joint war planning.  Understanding opponent networks is essential so that creative options can be developed to counter their strategies.  Synchronization of air and ground operations to apply force only where needed and with specific effects is required.  This project supports all levels of the force structure including: (1) the strategic\/operational level by generating targeting options against opponents' centers of gravity that have complex networked relationships; (2) the tactical\/operational level by managing highly automated forces with tight coupling between air and ground platforms; and (3) the focused tactical level by developing platforms and tools, which acquire targets of opportunity and cue network-based analysis of likely enemy operations thus maximizing the effectiveness of ground forces in stability and support operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "System of Systems Integration Technology and Experimentation (SoSITE)"
                                    },
                                    "Description": {
                                        "val": "The System of Systems Integration Technology and Experimentation (SoSITE) program seeks to implement an architecture framework capable of assessing and demonstrating potential operational benefits of integrating various system capabilities to improve mission success in contested environments.  Such assessments would optimize system-level trades of requirements and architectures to leverage an integrated set of system characteristics and capabilities.  The demonstration assessment metrics will measure individual and combined system performance to streamline resource allocation to maximize operational impact.  In addition, providing a modeling and simulation (M&S) environment to assess complex systems will enable greater utility of emerging system technologies, since they can be assessed in near-real-world simulations without the real-world costs of testing fully integrated systems.  The program will also develop system synthesis and integration technologies that enable rapid assimilation of new and off-the-shelf technologies into the system of systems architecture.  These technologies will break down current barriers to entry that new technologies face in system of systems using formal methods, compositional reasoning, and automated design space exploration.  Technologies from this program will be transitioned to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.159"
                                            },
                                            "Text": {
                                                "val": "-  Secured test articles for flight test experiments of distributed strike and suppression of enemy air defenses using manned and unmanned platforms and experimental mission systems.\n-  Demonstrated the capability of new engineering tools to validate system of systems architecture designs prior to live flight experiments.\n-  Demonstrated the capability of formal verification techniques to validate integration of constituent systems into a system of systems prior to live flight experiments.\n-  Conducted integration events to characterize sub-systems digitally to enable rapid integration into systems of systems.\n-  Conducted live flight experiments of system of systems architectures for networked electronic attack, distributed strike, and suppression of enemy air defense missions.\n-  Applied advanced software integration methods to enable rapid upgrade and improve portability of both new and legacy aircraft platform software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.159"
                                            },
                                            "Text": {
                                                "val": "-  Deploy SoSITE integration technologies, called STITCHES (System of Systems Technology Integration Tool Chain for Heterogeneous Electronic Systems), to a DoD-accredited cloud hosted repository.\n-  Implement upgrades to toolchain required by transition partners, including technology to allow full backwards and forwards compatibility of all versions of the toolchain.\n-  Perform live flight experiments of system of systems architectures.\n-  Design coalition system of systems architectures and plan international integration events with U.S. foreign partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.625"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.625"
                                            },
                                            "Text": {
                                                "val": "-  Perform live flight experiments for USAF and USN partners.\n-  Create and deploy STITCHES training software.\n-  Establish transition team to migrate the SoSITE STITCHES toolchain to the USAF and USN."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects the transfer of the SoSITE technology and transition team to the responsibility of the USAF and USN."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prototype Resilient Operations Testbed for Expeditionary Urban Systems of Systems (PROTEUS)"
                                    },
                                    "Description": {
                                        "val": "The Prototype Resilient Operations Testbed for Expeditionary Urban Systems of Systems (PROTEUS) program will demonstrate that a dynamically composable Mosaic warfare approach provides superior performance and adaptability in the dynamic, uncertain environment imposed on U.S. warfighters by urban combat operations.  PROTEUS will provide the tools and automation to enable small tactical units to compose force packages optimized to specific urban combat objectives and challenges.  These tools will support planning and force composition for all missions relevant to the urban environment: command & control, fires, maneuver, logistics, intelligence, force protection, and medical.  PROTEUS will be adaptive to an inherently dynamic and fluid environment that will account for the environmental influence of non-combatants in urban combat as well as kinetic warfighting.  Technologies will be integrated using systems of systems principles developed under the System of Systems Integration Technology and Experimentation (SoSITE) program, budgeted in this PE\/Project.  To support concept development, testing, and warfighter interaction, the program will also develop a supporting virtual testbed.  Technologies from this program will be transitioned to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.285"
                                            },
                                            "Text": {
                                                "val": "-  Developed a multi-resolution scenario within the virtual testbed and compare outcomes against a Marine Corps exercise benchmark.\n-  Defined friendly and opposing force systems for kinetic functions.\n-  Demonstrated integration of the virtual testbed and the composition tool using the benchmarked scenario.\n-  Demonstrated adaptive composition capability with Service participants.\n-  Commenced development of mathematical tools to define and score the value of materiel in a logistics flow."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.960"
                                            },
                                            "Text": {
                                                "val": "-  Begin development of planning and force composition tools for spectrum and intelligence operations.\n-  Demonstrate integration of the virtual testbed and composition tool using multi-resolution scenarios with increased complexity.\n-  Demonstrate enhanced adaptive composition capability with Service participants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.136"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.136"
                                            },
                                            "Text": {
                                                "val": "- Expand development of planning and force composition tools for information operations.\n- Enhance features for logistics plan management and considerations for operational impacts.\n- Demonstrate integration of virtual testbed and composition tool using complex multi-domain scenario against near peer threat.\n- Demonstrate system integration with Service participants executing multi-echelon operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects a shift from initial testing and refinement to demonstration and documentation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Systems of Systems-Enhanced Small Units (SESU)"
                                    },
                                    "Description": {
                                        "val": "The System-of-Systems-Enhanced Small Unit (SESU) program will develop and demonstrate adaptive kill-web capabilities based on a system-of-systems architecture that enables a small unit of U.S. forces to prevail against a much larger near-peer adversary force in a contested environment. SESU-developed capabilities will provide the small unit with improved awareness of enemy force composition, disposition, and intent.  It will also provide the means to deter escalation of threat, and, if deterrence fails, the ability to degrade, disrupt, and\/or destroy enemy anti-access\/area denial and combat systems.  Technologies to accomplish this include command & control (C2) that operates in a contested environment; distributed sensing, including the ability to leverage indigenous information sources; hybrid effects that include a mix of kinetic, non-kinetic, and information operations capabilities; and autonomous systems to deliver effects and conduct sensing.   A Campaign of Learning (CoL) will be conducted in partnership with the Army, and technologies produced by this program will be transitioned to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.815"
                                            },
                                            "Text": {
                                                "val": "-  Completed SESU architecture definition and develop evaluation scenarios.\n-  Conducted Wargame with the Army to identify critical operational capabilities and concept of operations.\n-  Demonstrated baseline technologies in a simulated environment.\n-  Initiated design of key technologies (e.g. distributed C2, sensors, and effectors).\n-  Conducted additional modeling and simulation virtual war games to develop performance metrics, concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.185"
                                            },
                                            "Text": {
                                                "val": "-  Integrate modeling and simulation environment and evaluate baseline and advanced architecture performances based on selected scenarios.\n-  Demonstrate impact of advanced technology suites.\n-  Down select from designs based on performance and begin development of prototypes with distributed C2, sensors, and effectors.\n-  Develop plan for live field experimentation for CoL.\n-  Finalize architectures and designs for C2, sensors, and effectors and provide documentation for government modeling and simulation efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.487"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.487"
                                            },
                                            "Text": {
                                                "val": "-  Integrate sensors and effectors in autonomous ground and air platforms and demonstrate real-time operation in hardware-in-the-loop or live environment.\n-  Evaluate prototype distributed C2 software and hardware operating speeds.\n-  Conduct live and virtual experiments to demonstrate and evaluate prototype architectures with distributed C2, sensors, and effectors.\n-  Demonstrate architecture flexibility by incorporating government furnished third party sensors, effectors, and autonomous platforms.\n-  Conduct live, virtual, constructive experiments for a government provided mission to demonstrate the ability of the system to support new missions and transition."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects a shift from development to testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assault Breaker II (ABII)"
                                    },
                                    "Description": {
                                        "val": "Assault Breaker II (ABII) seeks to change the current warfighting paradigm of reliance on Service-specific, platform centric force executing prescribed kill chains to a highly adaptable, capability-based force operating as a disaggregated kill web able to execute rapidly composable, joint, all domain kill chains.  Building upon technologies developed in the Cross Domain Maritime Surveillance and Targeting (CDMaST) program, budgeted in this PE and Project NET-02, ABII will exploit both existing and emerging technologies across the Services to address known capability gaps, opportunities and threats.  ABII will conduct mission-centric, multi-Service and multi-domain analyses, modeling and simulation (M&S), and experimentation to inform research and development and program of record recommendations, and will build an enduring, multi-service M&S environment to support complex, mission level kill web analysis.  ABII will also design and develop a Vanguard Force DevOps Environment with physical nodes that will enable the transition of ABII technologies, concepts and architectures to transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.400"
                                            },
                                            "Text": {
                                                "val": "-  Made significant advancements in defining the necessary architecture for a true Joint All Domain Command and Control construct.\n-  Initiated TA1 study efforts to define the requirements in regards to emerging weapons, command and control, communications, sensing, battle management, target tracking and mutli-level security.\n-  Continued to refine the TA3, experimentation architecture originally developed under the CDMaST program to be appropriate for the ABII Vanguard Force\n-  Created and refined ABII specific scenarios, with all supporting data\n-  Took direction from the Joint Requirements Oversight Council (JROC) to begin the creation of a Vanguard Force DevOps Environment (VFDE) and leave behind facility.\n-  Initiated contracts with Sandia National Laboratories, Air Force Research Laboratories, and Pennsylvania State University Applied Research Laboratory to begin the instantiation of a true, multi-level security modeling and simulation (M&S) environment specific to the ABII effort (TA2)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete initial kill web analysis studies and deliver updated advanced kill web technologies program recommendation report.\n-  Initiate second round of kill web analysis studies to support kill web architecture refinement.\n-  Execute contracts for the modeling and simulation architectures.\n-  Complete M&S testbed development.\n-  Complete preliminary design of multi-domain, multi-level security environment.\n-  Complete preliminary experimentation plan.\n-  Perform baseline experiments to serve as a proof of concept for the final experimentation environment.\n-  Complete preliminary design of the Vanguard Force DevOps Environment (VFDE).\n-  Initiate contracting of relevant parties to execute DevOps architectures and software modules."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "71.350"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "71.350"
                                            },
                                            "Text": {
                                                "val": "-  Initiate detailed design of multi-domain, multi-level security environment.\n-  Demonstrate completed modules and simulation environment compatibility.\n-  Demonstrated completed modules and scenarios for VFDE and related facilities.\n-  Complete studies for finalization of kill web architecture and effects.\n-  Begin experimentation efforts within the Distributed Experimentation Environment (DE2).\n-  Complete stand up of the VFDE.\n-  Demonstrate completed modules and battle management capabilities of the VFDE.\n-  Complete early user evaluations and field trial of technologies matured through ABII."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY2021 increase reflects the additional scope of the VFDE, as well as the software and modules required to execute."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Combat Evolution (ACE)"
                                    },
                                    "Description": {
                                        "val": "As the Services develop new Joint Multi-Domain Battle warfighting concepts, there is a strong demand for innovative ways to assess architectures, advance technology, and support operators developing advanced multi-domain tactics.  Based upon technologies developed in the System of Systems Integration Technology and Experimentation (SoSITE) program, budgeted in this PE\/Project, the Air Combat Evolution (ACE)  program will apply technologies and principles of distributed autonomy and artificial intelligence (AI) to aerial within-visual-range (WVR) maneuvering, colloquially known as a dogfight, in modeling and simulation (M&S), sub-scale, and ultimately full-scale vehicles.  The program will deliver an initial instantiation of a scalable AI controller enabling aircraft autonomy at levels ranging from an advanced tactical autopilot for dynamic maneuver to a form of multi-domain mosaic battle management controller.  Experiments will explore both augmentation of existing manned platforms and enhanced future unmanned systems.  ACE will provide an early opportunity to build operator trust in combat autonomy and demonstrate adaptive human-machine teaming tools and architectures.  Technology developed by this program will transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.838"
                                            },
                                            "Text": {
                                                "val": "-  Develop AI dogfight algorithms and test in M&S environment against simulated red air adversaries.\n-  Develop initial empirically-based trust measurement model.\n-  Design and develop the Human Machine Interfaces (HMIs) for M&S assessment, and provide detailed designs of the HMIs for use with the sub-scale and full-scale platforms.\n-  Begin development of extension of combat autonomy algorithms to large force exercise data analytics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.601"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.601"
                                            },
                                            "Text": {
                                                "val": "-  Refine and implement WVR algorithms onto sub-scale commercial UAV aircraft and test in a live experiment.\n-  Develop HMIs for sub-scale trust assessments. Conduct trust assessment events in sub-scale aircraft environment.\n-  Conduct extension of combat autonomy to initial campaign scenarios.\n-  Prepare aircraft for testing with final 1v1 flight certification demonstrations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program shift from initial development to multiple live flight testing events."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resilient Synchronized Planning and Assessment for the Contested Environment (RSPACE)"
                                    },
                                    "Description": {
                                        "val": "Currently, Command and Control (C2) of air platforms is a highly centralized process operating largely independently across planning domains (Intelligence, Surveillance, and Reconnaissance (ISR), strike, and spectrum management) and is optimized for a permissive environment.  To address the challenges faced in today's increasingly contested environments, the Resilient Synchronized Planning and Assessment for the Contested Environment (RSPACE) program will develop tools and models to enable distribution of planning functions across the C2 hierarchy for resilience (e.g., loss of communications), while synchronizing strike, ISR, and spectrum planning to maximize the contribution of all assets through increased utilization and exploitation of synergies.  The program will develop tools supporting a mixed initiative planning approach, maximizing automation according to operator's choice, and enabling human-in-the-loop intervention and modification.  RSPACE will also develop tactical decision aids for maritime commanders and planners to build and assess courses of action (COAs) for fleet and ship movements and the employment of counter-ISR techniques.  During execution, the tools will provide lifecycle tracking of targeting and information needs and support assessment of progress towards achieving the commander's intent.  The tools will dynamically respond as directed to ad hoc requests and significant plan deviations via a real-time dynamic re-planning capability and easily adapt to technology refreshes.  RSPACE tools will transition to the Air Force and the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.869"
                                            },
                                            "Text": {
                                                "val": "-  Conducted one or more live-virtual simulation-based tests in conjunction with a scheduled live Air Force experiment to facilitate transition to the Air Force.\n-  Integrated prototype software with external systems and scale to large, high operational tempo scenarios.\n-  Enhanced models and user support interfaces in preparation for transition to operational testing by the Navy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.345"
                                            },
                                            "Text": {
                                                "val": "-  Complete software development in support of transition of select RSPACE software components to Air Force Program of Record."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NET-02"
                    },
                    "ProjectTitle": {
                        "val": "MARITIME SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "79.808"
                        },
                        "CurrentYear": {
                            "val": "127.484"
                        },
                        "BudgetYearOne": {
                            "val": "148.459"
                        },
                        "BudgetYearOneBase": {
                            "val": "148.459"
                        },
                        "BudgetYearTwo": {
                            "val": "224.082"
                        },
                        "BudgetYearThree": {
                            "val": "220.946"
                        },
                        "BudgetYearFour": {
                            "val": "239.020"
                        },
                        "BudgetYearFive": {
                            "val": "240.630"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Maritime Systems project is identifying, developing and rapidly maturing critical advanced technologies and system concepts for the naval forces' role in today's network centric warfare concept.  Improvements in communications between and among submarines, surface ships and naval aircraft have allowed these forces to operate seamlessly with each other and with other Service's network centric systems.  Naval forces will play an ever-increasing role in network centric warfare because of their forward deployed nature, their unique capability to operate simultaneously in the air, on the sea and under the sea, and their versatile ability to provide both rapid strike and project-sustained force.  The technologies developed under this project will capitalize on these attributes, improve them and enable them to operate with other network centric forces."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cross Domain Maritime Surveillance and Targeting (CDMaST)"
                                    },
                                    "Description": {
                                        "val": "The Cross Domain Maritime Surveillance and Targeting (CDMaST) program seeks to identify and implement architectures consisting of novel combinations of manned and unmanned systems to execute long-range kill chains and develop a robust \"kill web\" against submarines and ships over large contested maritime areas.  By exploiting promising new developments in unmanned platforms, seafloor systems, and emerging long-range weapon systems, the program will develop an advanced, integrated undersea and above sea warfighting capability.  The CDMaST program will establish an analytical and experimental environment to explore architecture combinations in terms of operational effectiveness as well as engineering feasibility and robustness.  The program will leverage enabling technologies needed for command, control, and communication (C3) between physical domains in order to support the architecture constructs.  Through experimentation, the program will not only demonstrate integrated system performance, but also develop new tactics that capitalize on features created by the heterogeneous architecture.  The CDMaST program will invest in technologies that will reduce cost, manage complexity, and improve reliability.  Technologies from this program will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.892"
                                            },
                                            "Text": {
                                                "val": "-  Successfully integrated system of systems assets with the CDMaST test bed and performed operational test encompassing both constructive and live systems demonstrating several key aspects of the concept.\n-  Refined the CDMaST architecture segments and service layers to include updates to aircraft choice, system employment, and communication structure.\n-  Conducted elemental, engineering, and operational tests on the communications, battle management, and autonomy aspects of the CDMaST architecture.\n-  Completed planning for at-sea demonstrations of the CDMaST architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.897"
                                            },
                                            "Text": {
                                                "val": "-  Complete system integration.\n-  Complete software-in-the-loop system testing.\n-  Complete CDMaST testbed.\n-  Conduct two at-sea demonstrations of the CDMaST architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.326"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.326"
                                            },
                                            "Text": {
                                                "val": "-  Document results of at-sea demonstrations and deliver test results report.\n-  Perform analysis of results and develop final experimentation plan.\n-  Execute final CDMaST experimentation event.\n-  Prepare documentation to support capability transition to the Navy."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects a decline in major experimentation efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hunter"
                                    },
                                    "Description": {
                                        "val": "The Hunter program seeks to develop novel concepts for Extra Large Unmanned Undersea Vehicles (XLUUVs) to deliver complex payloads.  The program will explore efficient encapsulation and buoyancy control concepts to be implemented with advanced fiber handling capabilities for high bandwidth communications in order to create a highly modular and adaptable ocean interface.  This interface will give XLUUVs significantly increased payload handling ability and allow them to deliver completely new capabilities previously delivered only by manned platforms.  Building upon research conducted under the Cross Domain Maritime Surveillance and Targeting (CDMaST) program budgeted in this PE\/Project, the Hunter program will establish a new capability for integration into maritime system of systems warfare architectures.  Technologies developed under the Hunter program will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.496"
                                            },
                                            "Text": {
                                                "val": "-  Completed design of Hunter payload delivery carriage.\n-  Built partial carriage payload delivery system to support risk reduction testing.\n-  Performed stand-alone in-water test of partial Hunter payload delivery carriage.\n-  Commenced fabrication of Hunter payload delivery carriage.\n-  Applied information assurance measures to Hunter payload delivery carriage."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.742"
                                            },
                                            "Text": {
                                                "val": "-  Complete fabrication of carriage system.\n-  Develop full Hunter system and information assurance implementation test plan.\n-  Perform stand-alone in-water test of full Hunter payload delivery carriage.\n-  Commence carriage integration with the XLUUV."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.863"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.863"
                                            },
                                            "Text": {
                                                "val": "-  Continue carriage integration with the XLUUV to include engineering testing of integrated subcomponents.\n-  Conduct pool testing of entire payload system, which includes the Hunter carriage and the XLUUV payload module.\n-  Complete coordinated in-water systems-of-systems testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects the transition from system development to integration and test."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ocean of Things"
                                    },
                                    "Description": {
                                        "val": "The goal of the Ocean of Things program is to advance oceanographic sensing and maritime awareness using low-power microelectronics and advanced data analytics.  Ocean of Things builds upon advances made in the Cross Domain Maritime Surveillance and Targeting (CDMaST) program, budgeted in this PE\/Project.  Ocean of Things will develop large numbers of heterogeneous sensing floats to cover large ocean areas, while incorporating environmentally friendly construction materials. These platforms will leverage satellite communications to populate a large data repository with sensor outputs for shared processing.  Ocean of Things will apply advanced analysis techniques to the stored data to synthesize and discover new signals and behaviors in the ocean environment. The program will research the spatio-temporal composability of sensors and develop applications for distributed platform behavior using an internet of things (IoT) architecture deployed across the world's oceans.  Further research will examine additional platform capabilities and system impacts of communication rate and edge processing.  The Ocean of Things program will improve ocean awareness and provide persistent coverage to areas between existing platforms.  Technologies developed in Ocean of Things will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.499"
                                            },
                                            "Text": {
                                                "val": "-  Conducted initial data architecture studies to determine optimal host and service platform.\n-  Conducted initial sensor and payload studies to examine optimal sensor and payload types for platform configurations.\n-  Developed initial hardware design and sensor configurations for test platform delivery.\n-  Demonstrated and tested initial sensors through small-scale ocean float deployment in Southern California and the Gulf of Mexico."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.933"
                                            },
                                            "Text": {
                                                "val": "-  Develop advanced platform design.\n-  Research active sensor behaviors for potential inclusion into advanced system design.\n-  Demonstrate and test advanced sensors through large-scale ocean float deployment.\n-  Develop government data cloud and architecture, model ocean inputs, and apply initial machine learning applications.\n-  Develop visualization of machine learning results for military application.\n-  Evaluate test data to determine performance and coverage in the ocean."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.011"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.011"
                                            },
                                            "Text": {
                                                "val": "-  Develop large data test results for Navy ingestion and application.\n-  Develop advanced data analysis and control algorithms.\n-  Evaluate test data to determine optimal deployment and test for Navy involvement.\n-  Develop updated ocean models with improved resolution for Navy employment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects the shift from hardware development to cloud deployment of software analytics."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Timely Information for Maritime Engagements (TIMEly)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Heterogeneous Under-Water Communications (HUWC)\n\nIntegration of undersea elements for joint cross-domain operations is critical for developing the most effective distributed kill webs.  The Timely Information for Maritime Engagements (TIMEly) program will create a heterogeneous underwater network architecture that will span the ocean and bridge to other operating domains.  Building upon technologies learned in the Tactical Underwater Network Architecture and Positioning System for Deep Ocean Navigation (POSYDON) programs, budgeted in this PE\/Project, TIMEly will provide an adaptive, heterogeneous, scalable communications capability to link undersea and cross-domain assets together into kill webs with minimal operator burden.  The program will focus on developing architectures with the capability to transfer the right information to its intended purpose.  TIMEly will work within commonly understood limitations, with a focus on protocols, quality of service, and information exchange.  The program will leverage developments demonstrating short-range and long-range acoustic communications at higher bandwidth and greater reliability, while minimizing detectability.  The program will also leverage recent developments in network interoperability to manage heterogeneous undersea and cross-domain networks.  Technology developed by this program will transition to the Navy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.778"
                                            },
                                            "Text": {
                                                "val": "-  Conduct modeling and simulation to support architecture design trade studies.\n-  Begin development of heterogeneous network architectures comprised of acoustic and non-acoustic elements.\n-  Begin development of algorithms to adapt networks to mission and environment.\n-  Commence operational and mission analysis to identify sample program missions and performance metrics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.259"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.259"
                                            },
                                            "Text": {
                                                "val": "-  Conduct hardware in-the-loop simulation and testing.\n-  Conduct limited in-water risk reduction testing for high risk technology areas specific to individual TIMEly architectures.\n-  Develop analytically based architecture performance predictions to evaluate TIMEly performance across a range of mission scenarios.\n-  Commence hardware design and fabrication efforts for TIMEly nodes.\n-  Begin development of hardware control logic and integration with hardware nodes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects an increase in testing, hardware procurement, and integration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Disaggregated Strike Group - Manta Ray*"
                                    },
                                    "Description": {
                                        "val": "*Previously part of Maritime Missileer\n\nThe Disaggregated Strike Group - Manta Ray (DSG - Manta Ray) program seeks to develop a new class of long duration, long-range payload capable unmanned underwater vehicles (UUVs) at an acquisition and lifecycle cost significantly less than current payload-capable UUVs.  This new class of UUV will give the combatant commander an amplification of capacity without disrupting current operations by remaining independent of manned vessels and ports once deployed.  The primary goal of the DSG - Manta Ray program is to open a design space for future UUVs that are capable of both long duration missions and large payload capacity.  A secondary goal of the program is to advance key technologies that will benefit other naval designs such as low lifecycle cost UUV operations, long duration energy management techniques, biofouling reduction technologies, and long duration navigational enablers.  The anticipated transition partner is the Navy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.415"
                                            },
                                            "Text": {
                                                "val": "-  Develop concept of operations and identify critical technologies.\n-  Develop system requirements.\n-  Develop representative platform concept designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct preliminary design review.\n-  Develop platform subsystems.\n-  Demonstrate and test subsystems in a controlled maritime environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects transition from initial concept development to systems development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "No Manning Required Ship (NOMARS)*"
                                    },
                                    "Description": {
                                        "val": "*Previously part of Maritime Missileer, formerly called Disaggregated Strike Group - Surface\n\nNo Manning Required Ship (NOMARS) seeks to develop small, low-cost, disaggregated naval platforms to demonstrate the ability to perform persistent power projection and force application combat missions currently conducted from large, high-value capital ships.  The NOMARS program seeks to design a ship that can operate autonomously for long durations at sea, enabling a ship design process that eliminates considerations associated with crew.  NOMARS focuses on exploring novel approaches to the design of the seaframe (the ship without mission systems) while accommodating representative payload size, weight, and power.  The goal of the program is to demonstrate the feasibility of Unmanned Surface Vessels (USVs) that can operate autonomously for months to years without human intervention, in large numbers, with only periodic, depot-based maintenance.  This capability will enable disaggregated persistent USVs, which allows the surface fleet to credibly threaten peer adversaries and negate their investments in high-cost weapon systems designed to counter large naval targets such as aircraft carriers.  A successful NOMARS program will prove feasibility of a small unmanned ship with significantly improved reliability and functional performance over current USVs providing a pathway to allow a distributed lethality concept to become viable: small ships, in large numbers, each of which is individually low cost and low value, but in aggregate presents a significant deterrent."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Begin evaluation of design trade space and initial concept development.\n-  Begin technology exploration activities related to self-health autonomy and other critical subsystem technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete Conceptual Design Review (CoDR).\n-  Identify critical technology risks areas and develop risk reduction strategies.\n-  Initiate formation of specific ship\/maintenance concepts.\n-  Conduct system preliminary design.\n-  Complete preliminary recurring unit cost analysis.\n-  Complete initial mission analysis study."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program continued ramp up from initial trade space analysis to risk reduction and design."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Angler"
                                    },
                                    "Description": {
                                        "val": "The undersea domain has significant importance to national security and military operations.  Yet it is a challenging domain in which to operate due to extreme water pressures, restricted communications, ever changing bottom environments, and marine fouling and corrosion.  The Angler program seeks to improve U.S. operations in this domain by enabling underwater robotic systems significantly ahead of the state-of-the-art.  These robotic systems would be able to search and manipulate objects autonomously, even in dark, turbulent, and semi-opaque sea conditions without the need for human control and without reliance on the Global Positioning System (GPS).  Key Angler technical challenges include sensing techniques that provide high-resolution navigation without GPS, perception and manipulation strategies for objects with unknown parameters, long duration autonomy approaches to support mission execution, and autonomy approaches that do not rely on human intervention.  This program also has a companion applied research effort budgeted in PE 0602702E, Project TT-03.  The anticipated transition is to the Navy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Begin systems engineering and design of prototype architecture for autonomous, undersea manipulation operations.\n-  Complete Conceptual Design Review (CoDR).\n-  Conduct Preliminary Design Review (PDR).\n-  Test robot subsystems in laboratory or simulation environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct Critical Design Reviews (CDR).\n-  Develop fully integrated robot system prototypes.\n-  Demonstrate and test robot prototypes in a representative maritime environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects system platform design and integration and initial testing of prototypes."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sea Train"
                                    },
                                    "Description": {
                                        "val": "The Sea Train program will support the delivery of masses of unmanned surface vessels into theater, without reliance on large, manned capital assets.  The Sea Train program will develop and demonstrate approaches to exploit the efficiencies of longer slender hulls, while enabling a distributed fleet of tactical Unmanned Surface Vessels (USVs).  The Sea Train concept enables vessels that are efficient for transoceanic transport while enabling dispersed operations as individual vessels.  The Sea Train program will develop and demonstrate connector approaches to couple the vessels, the control laws required to drive the vessel in open ocean conditions, sensor approaches to understand the wave environment to efficiently navigate the vessel, and the autonomy required to connect and disconnect the vessels without human intervention.  The goal of this effort is to improve transport efficiency over what can be achieved with current monohull designs.  This allows for the efficient transport of smaller vessels into and out of theater, an operation that is normally accomplished today by carrying smaller vessels on board larger vessels or reliance on at-sea refueling of smaller vessels."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct exploratory trade studies to establish feasibility of technical approaches.\n-  Perform Conceptual Design Review of the Objective System. \n-  Conduct Systems Requirements Review of the Phase 1 Demonstration System. \n-  Perform subsystem integration and test."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Positioning System for Deep Ocean Navigation (POSYDON)"
                                    },
                                    "Description": {
                                        "val": "The Positioning System for Deep Ocean Navigation (POSYDON) program will provide continuous, Global Positioning System (GPS)-level positioning accuracy to submarines and autonomous undersea vehicles (AUVs) in the ocean over extended periods of time.  Undersea navigation cannot use GPS because the water blocks its signals.  At shallower depths, masts can be raised to receive GPS signals, but masts present a detection risk.  Typically, the alternative to GPS for undersea navigation has been inertial navigation systems (INS), but INS accuracy can degrade unacceptably over time.  The POSYDON program will distribute a small number of acoustic sources, analogous to GPS satellites, around an ocean basin at known locations.  A submarine or AUV will be equipped with an acoustic receiver and appropriate software in order to obtain and maintain location.  By transmitting specific acoustic waveforms and developing accurate acoustic propagation models to predict and interpret the complex arrival structure of the acoustic sources, the submarine or AUV can determine its range from each source and thus calculate its position.  Technologies developed under this program will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.580"
                                            },
                                            "Text": {
                                                "val": "-  Designed and tested a prototype POSYDON system.\n-  Achieved real-time positioning goals for relevant AUV platforms.\n-  Documented results of at-sea testing to support systems integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.719"
                                            },
                                            "Text": {
                                                "val": "-  Transition POSYDON hardware to Navy undersea test bed.\n-  Demonstrate mission planning tool to guide system employment.\n-  Conduct modeling and simulation to demonstrate concept of operations for deep and littoral mission."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Offboard Command, Control and Attack (MOCCA)"
                                    },
                                    "Description": {
                                        "val": "The Mobile Offboard Command, Control and Attack (MOCCA) program sought to counter the fourth-generation submarine signature quieting technology that has significantly degraded passive anti-submarine warfare (ASW) sonar detection range and targeting performance.  The MOCCA program aimed to nullify submarine signature reduction trends with active sonar projectors deployed from a mobile unmanned undersea vehicle (UUV) and cooperatively processed with onboard submarine acoustic receive sonar systems.  The off-board UUV sonar projector was planned to operate under positive control at a significant distance from the cooperative submarine using communication links. The program achieved breakthrough capability for novel low probability of intercept\/low probability of detection (LPI\/LPD) communication signaling.  The MOCCA communication system was integrated into submarine onboard sonar systems.  Communication technologies from this program transitioned to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.889"
                                            },
                                            "Text": {
                                                "val": "-  Completed system utility analysis to identify optimal performance specifications for concept of operations under multiple tactical situations.\n-  Integrated MOCCA communications transmission and processing approach onboard a submarine for at-sea feasibility demonstration.\n-  Conducted at-sea feasibility demonstration to evaluate MOCCA communications transmission and processing approach using Navy assets.\n-  Coordinated with the Navy to define concepts of operations.\n-  Transitioned MOCCA communications system to the Navy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Undersea Network Architecture"
                                    },
                                    "Description": {
                                        "val": "Systems fighting as a network are vulnerable to a loss of connectivity in a contested environment.  This connectivity is important for synchronizing forces, establishing and maintaining situation awareness, and control of remotely operated vehicles and systems.  Additionally, undersea systems are challenged to maintain connectivity and must carry their own energy and operate over their design lifetime with little to no maintenance and repair.  These factors inhibit their use in collaborative networks and prevent the full exploitation of the potential of undersea systems.  The Tactical Undersea Network Architectures program sought to overcome these limitations by developing the technologies necessary for autonomous, reliable, and secure undersea data transfers; true plug, play, and operate standards; and rapid, cost-effective deployment technologies.  The program developed and demonstrated novel technology options and designs to restore connectivity temporarily for existing tactical data networks in contested environments using small-diameter optical fiber and buoy relay nodes.  The program focused on innovative system architecture designs, lightweight optical fiber technologies, and rapidly deployable buoy node designs and component technologies.  The Tactical Undersea Network Architecture program emphasized early risk reduction with scaled at-sea integrated demonstrations of increasing complexity.  Program technologies transitioned to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.220"
                                            },
                                            "Text": {
                                                "val": "-  Revised and updated component and system architectures for final at-sea testing based on results of FY2018 integration and at-sea testing.\n-  Completed integration for updated system and perform at-sea networking demonstration.\n-  Evaluated hardware packaging and radio deployment options in support of potential configuration modifications.\n-  Analyzed data collected and finalize reports on Tactical Undersea Network Architecture experimentation and demonstration events.\n-  Transitioned interface, control, and system architecture documentation to the Services."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Exploitation of the Acoustic Channel (TEAC)"
                                    },
                                    "Description": {
                                        "val": "The Tactical Exploitation of the Acoustic Channel (TEAC) program provided the capability to coherently combine acoustic energy from a distributed network of underwater acoustic sources to improve signal transmission in an undersea environment.  The ability to cohere multiple underwater sensors is showing an impact for a number of compelling applications including surveillance, communications, and vehicle positioning.  For all of these applications, sensor gain had been achieved by deploying large, costly, and cumbersome cabled arrays.  The TEAC program created the opportunity to deploy groups of low unit-cost sources that work cooperatively to focus energy undersea.  This provided an extensible, affordable, and flexible method to harness the rapid development of undersea vehicles and new acoustic source technologies.  Technologies developed under this program have transitioned to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.232"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated and test at-sea cohering of acoustic sources.\n-  Analyzed sea-test data to identify system performance robustness.\n-  Began development of command and control for a semi-autonomous distributed system.\n-  Developed a concept of operations for TEAC system deployment."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NET-06"
                    },
                    "ProjectTitle": {
                        "val": "NETWORK-CENTRIC WARFARE TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "233.612"
                        },
                        "CurrentYear": {
                            "val": "280.453"
                        },
                        "BudgetYearOne": {
                            "val": "364.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "364.500"
                        },
                        "BudgetYearTwo": {
                            "val": "292.334"
                        },
                        "BudgetYearThree": {
                            "val": "172.194"
                        },
                        "BudgetYearFour": {
                            "val": "67.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds classified DARPA programs that are reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Classified DARPA Program"
                                    },
                                    "Description": {
                                        "val": "This project funds Classified DARPA Programs.  Details of this submission are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "233.612"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "280.453"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "364.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "364.500"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Details will be provided under separate cover."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}