{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-17",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602270A"
        },
        "ProgramElementTitle": {
            "val": "Electronic Warfare Technology"
        },
        "R1LineNumber": {
            "val": "23"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "25.127"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "25.127"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is realigned with continuity of effort to the following PEs:\n* 0602146A Network C3I Technology\n* 0602148A Future Vertical Lift Technology\n* 0602150A Air and Missile Defense Technology\n* 0602213A C3I Applied Cyber"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE designs and validates electronic warfare (EW) components, both hardware and software, that deny, disrupt, or degrade the enemy's use of the electromagnetic spectrum for offensive or defensive operations. This is accomplished through the investigation of electronic support measures (ESM); countermeasures against communications systems and networks; the design and fabrication of sensors used to identify and locate threat forces in an asymmetric environment; and threat warning and electronic countermeasures (ECM) against munitions sensors, missile guidance systems, targeting systems, and explosive hazards. Project 906 supports protection of high-value ground platforms, aircraft and the Soldier from threat surveillance and tracking systems, imaging systems, and advanced radio frequency (RF)\/electro-optical (EO)\/infrared (IR) guided missiles, artillery, and smart munitions. Information fusion research addresses sensor correlation and fusion, relationship discovery, and management services through use of automated processing, as well as software that applies higher level reasoning techniques to support automated combat assessment. Project 906 also supports research and application of key EW sensors, direction finders and jammers to intercept, locate, and disrupt current and emerging communications and non-communications threat emitters to provide vital quality combat information directly to users in a timely and actionable manner. It focuses on detection of threat sensors and emitters associated with weapon systems, targeting systems and command, control, communications, computers, and intelligence systems and networks. Project CYB designs, creates, evaluates, and applies emerging cyber techniques and cyber situational awareness technologies to enhance Army capabilities and to mitigate risks and investigates cyber collection and mapping technologies to offer real time cyber situational awareness to enable interpretation of current threats and predict future enemy activities.\n\nWork in this PE complements PE 0602120A (Sensors and Electronic Survivability), PE 0602782A (Command, Control, Communications Technology), PE 0603270A (Electronic Warfare Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology); and is coordinated with PE 0603710A (Night Vision Advanced Technology) and PE 0603794A (C3 Advanced Technology).\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.558"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "25.127"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.431"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.431"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "906"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Electronic Warfare Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.962"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "19.962"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to:\nProgram Element (PE) 0602146A Network C3I Technology\n* Project AN7 COE - Every Receiver is a Sensor Technology\n* Project AO2 Stand-In Advanced RF Effects (STARE)\n* Project AQ2 EW Techniques Technology\n* Project AQ3 Network Access and Effects \n* Project AV3 Foundational S&T for Network C3I Technology\nPE 0602148A Future Vertical Lift Technology\n* Project AK2 Aviation Survivability Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs, fabricates, evaluates, and applies key electronic warfare (EW)\/information operations technologies to enhance platform survivability (to include ground combat vehicles, aircraft, and the dismounted Soldier) and to intercept, track and locate current and emerging threat munitions, communications and non- communications threat emitters. This Project applies recent advances in radio frequency (RF), infrared (IR), and electro-optical (EO) sensors and jamming sources to detect, locate, deceive, and jam threats (to include radar directed target acquisition systems, target-tracking sensors, surface-to-air missiles (SAMs), air-to-air missiles (AAMs), top attack weapons, and electronically fused munitions). This project also pursues the ability to neutralize improvised explosive devices. This project designs information systems to provide vital, quality combat information directly to users in a timely, actionable manner in accordance with concepts for future force intelligence operations. This Project investigates RF collection and mapping technologies to offer real time emitter detection, location, and identification. In addition, this project enables a remote capability to disrupt, deny, or destroy threat communication signals and enables fusion (automated assimilation and synthesis) of battlefield intelligence data to enable interpretation of current threats and future enemy activities. This allows commanders to develop operational courses of action in time to act decisively and in a pre-emptive manner.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Data Analytics for Situational Awareness"
                                    },
                                    "Description": {
                                        "val": "This effort researches and designs spectrum sensing, electronic sensing and intelligence collection technologies and analytics to enhance overall situational understanding within a contested battlespace. Efforts focus on developing the analytics necessary to taking advantage of the expanding number of data sources available by leveraging existing tactical receivers and other tactical data feeds."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.946"
                                            },
                                            "Text": {
                                                "val": "Identified relevant tactical receiver data and emerging Internet of Things (IoT) data sources, to include publicly available information, enriching the existing cyber terrain and electromagnetic operations environment; investigated potential correlation points with non-traditional data sets to identify cyber events; and explored new data analytics, fusion algorithms and semi-automated analytical methods to process and exploit the extended data sets to support cyber situational understanding."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Offensive Information Operations Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs, codes and evaluates techniques for RF network mapping, surgical disruption and unobtrusive operations in the presence of host nation networks. Electronic warfare capabilities include detection, location, classification, mapping and disruption of RF networks and providing data to a user."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.47"
                                            },
                                            "Text": {
                                                "val": "Investigated emerging networks to identify shortfalls in capability to detect, identified and mapped network nodes; and identified future analytic, sensor, and data research needs; and investigated techniques for surgical disruption and unobtrusive operation within native network infrastructures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multispectral Threat Warning and Countermeasures, formerly Multispectral Threat Warning"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates software and warning sensor\/countermeasure components to increase probability to detect and defeat current and evolving small arms and man-portable air defense system (MANPADS) type threats for aviation platforms using modeling and simulation (M&S) and hardware in the loop (HWIL) simulations. Work being accomplished under PE 0603270A (Electronic Warfare Technology) \/ K16 (Non-Commo Ecm Tech Dem) complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.8"
                                            },
                                            "Text": {
                                                "val": "Investigated technologies to indiscriminately detect and defeat broad classes of threats; conducted analysis of next-generation detect technologies with focus on machine learning algorithms to enable detection of unrecognized threat features; conducted analysis of advanced defeat technologies focusing on new lasers and laser materials and built a breadboard laser to indiscriminately degrade EO threat sensor performance; investigated RF digital hardware and software techniques that are adaptive to agile RF threats; used modeling and simulation (M&S) to iteratively train machine learning algorithms to perform threat classification and optimize laser countermeasure and RF technique development; and assessed performance of technologies (e.g., machine learning, lasers, etc.) and techniques independently and incorporate them into a digital M&S platform."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Function Intelligence, Surveillance and Reconnaissance Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and codes software algorithms and techniques to intelligently integrate tactical Intelligence, Surveillance, and Reconnaissance (ISR) sensors, improve their individual performance and increase the effectiveness of battlespace awareness\/intelligence data in an area of operations. Efforts focus on networking of sensors and open, scalable common RF architectures for terrestrial and aerial sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.242"
                                            },
                                            "Text": {
                                                "val": "Researched enhanced next generation techniques for distributed sensing and single sensor geolocation to enable detection, and geolocation of advanced threats and inform requirements for future hardware designs; investigated state of the art electronic situational awareness technique susceptibility to adversarial use of next generation RF deception and jamming; investigated cyber hardening of sensor component technology for front-end sensors; investigated a best-of-breed low-cost HF software defined radio for use in an open multifunction ISR platform to be utilized in a hostile cyber environment; explored trade space of shared multi-function next generation hardware for Radar, SIGINT and EW; performed trade-off studies to understand the feasibility and impact of executing multi-function capabilities from a common RF array with consideration for advancing threat electronic protection capability; and performed laboratory sensing data collections and analysis to address the applicability of a multi-function sensor."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi Function Electronic Warfare (MFEW) Technique Development"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops EW techniques critical to countering communications, such as networked command and control nodes or improvised explosive device threats, and radars, such as ground surveillance and counter-fire radars. The techniques developed are system agnostic and applicable to a wide variety of EW and electronic countermeasure applications, and they can be used to improve the performance and expand the functionality of both current and future EW system capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.5"
                                            },
                                            "Text": {
                                                "val": "Investigated and performed vulnerability analysis on emerging threats (including, but not limited to, tactical communications, ground surveillance radar, and counter-fire radar systems) and matured EW techniques and methods (such as active, reactive, surgical, and protocol based software) with the goals of maximizing EW waveform jamming effectiveness, minimizing transmission time, and reducing jamming power to defeat Army relevant threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.004"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CYB"
                    },
                    "ProjectTitle": {
                        "val": "Applied Offensive Cyber"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.165"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.165"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) FY 2020 this Project is realigned to: \nProgram Element (PE) 0602213A C3I Applied Cyber\n* Project 3CY Network Access and Effects Technology\n* Project 5CY Offensive Cyber Operations (OCO) Mirror Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs, creates, evaluates, and applies emerging cyber techniques and cyber situational awareness technologies to enhance Army capabilities. This Project leverages behavioral Modeling and Simulation to mitigate risks and investigates cyber collection and mapping technologies to offer real time cyber situational awareness to enable interpretation of current threats and predict future enemy activities. This allows commanders to develop operational courses of action in time to act decisively and in a pre-emptive manner.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Offensive Information Operations Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs, codes and evaluates cyber architectures, software, tools and techniques that identify and capture data traversing targeted networks for the purpose of Cyber Electro Magnetic Activity (CEMA) or otherwise countering adversary communications. Cyber capabilities include detection, identification, exploitation, direction finding (DF), geolocation, and denial of service."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.164"
                                            },
                                            "Text": {
                                                "val": "Investigated utilizing Machine Learning for threat assessment, decision aid, and mission choreography; determined algorithm design needs for recognition and Battle Damage Assessment for the purposes of survey, network topology understanding, and effect assessment; and refined CEMA interface definitions to include a mechanism for service\/capability discovery to address solidifying mission management across Unified Land Operations platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.001"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}